[
  {
    "month": 1,
    "solvedOne": false,
    "name": "January",
    "Theme": "Universe",
    "days": [
      {
        "day": 1,
        "title": "Let a once-in-life journey begin",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "03/07/2025",
        "sYear": 0,
        "specialMess": "Welcome and hello !! if it's your first time being here and you are surprised what just happened in midnight, then I have successfully gifted this Moon quest to you. Anyways, hope you enjoy it and let me reexplain how this works, as the story said, the Moon got cracked into shards because of Space&Time Rift, now each shard could be visited on Earth's atmosphere on a specific day once per year, the other details were already shown in Canva why are there challenges related to each of them. the card you're reading in called special message, if the day is special enough or I needed to share something outside of the challenge itself shall be written here, optional to skip, but yeah, you can read those only once per year :3. PS: Some plans got changed and it seems that you started on September, Whoops...",
        "enigma": "This is the card for the challenge itself to bring back the shard to you and collect it, some challenges are Science facts related, Enigma related, autistically related, many varieties that you will experience all by yourself !!! the shards are part of a crescent, and each creascent has a theme and got split in its month, so in conclusion. Each month will possess a theme on its challenges, good luck finding them out :3 ( they are also revealed on upper page with the date ). The challenge can have a link and hints, when a link is given is usually meaning the text here is not enough to express the challenge. Now to get this tutorial shard, try to go to link to find the flag for this challenge and get your first shard !!",
        "link": "https://drive.google.com/drive/u/1/folders/1DQY-cxz_p9N-7TIq4ACSYCBVYuSQ6pmo",
        "hints": [
          "This is hint n°1 !!",
          "This is hint n°2 !!"
        ],
        "answer": "MoonQuestCTF{l3t_y0ur_m00n_q35t_j0urn3y_b3g1n}",
        "reaction": "Hope you can start the new year happily with this gift nchllh"
      },
      {
        "day": 2,
        "title": "Miraculous Seven",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "03/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "There exists a rare phenomenon visible through our telescope where some known 7 objects aligne perfectly in space, what is the name of this phenomenon that occurs roughly once per 15 years ?",
        "link": "",
        "hints": [
          "the seven objects are the 7 visible planets of our solar system ( Mercury , Venus, Mars, Jupiter, .... )"
        ],
        "answer": "Planetary Parade",
        "reaction": "Wonder if there would be a day we can witness it!!"
      },
      {
        "day": 3,
        "title": "bullying a password",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "03/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Black Hole had an account to for planet and star delivery to him, but some hecker managed breach the database and stole his hashed MD5 password: '710748256d487004aa0c1e59be6da1ec', I wonder if it could be cracked",
        "link": "",
        "hints": [
          "I wonder if a cat can hash",
          "there are also useful online tools, like hash killer, you also know the algo, you can do it!!!"
        ],
        "answer": "blackhole14",
        "reaction": "Black hole was not happy that someone stole all of his informations of the planets and stars he ate!!!"
      },
      {
        "day": 4,
        "title": "Word Wide Universe",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "03/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "The Universe is full of surprises, Sub7analah, if you see the observable from afar, you will see Stars, glaxies, clusters interconnectiong between them like the Internet, name this miraculous phenomenon",
        "link": "",
        "hints": [],
        "answer": "Cosmic web",
        "reaction": "it also looks like neurons in our brains, Sub7anallah"
      },
      {
        "day": 5,
        "title": "Quantusanity",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "03/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "in naked eyes, if we put an object and then we block the vision with something, it should be hidden. However, if we block the vision with a massive mass, the object will be seen, insane but yeah, name this phenomenon ",
        "link": "https://www.hku.hk/f/news/26056/900p600/Fig1a.png?utm_source=miragenews&utm_medium=miragenews&utm_campaign=news",
        "hints": [
          "it contains two words, one is scalable and proportional with its mass"
        ],
        "answer": "Gravitational Mirages",
        "reaction": "it's pretty insane how can something so massive has ability to bend light itself"
      },
      {
        "day": 6,
        "title": "Last survivor",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "03/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Imagine, a universe so alive would surely come to an end, but have you ever thouht what objects that last the longest, in the middle of all darkness, it roams around silently without even be heard or seen, a phobia that I also posses",
        "link": "",
        "hints": [
          "The one that consumed light itself, only with gravitaional miraged would be seen"
        ],
        "answer": "Black hole",
        "reaction": "these objects are the only ones that makes me amazed and terrified by them"
      },
      {
        "day": 7,
        "title": "never underestimate short ones",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "03/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I don't know if you already seen this your sibling Star, but it couldn't even be compared to a normal star, her width is barely 20-30km due to an old Star collapse. However, It's so dense that a teaspoon out of it weighs more than billions of tons... ",
        "link": "",
        "hints": [],
        "answer": "Neutron Star",
        "reaction": "This star is so scary in mass, so never underestimate the size for what their inner is hiding..."
      },
      {
        "day": 8,
        "title": "Kaboom ?",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "03/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I love that in the end of life of a star, it's be like: 'Oh, I gess gravity is winning over me, guess I will collapse and Kaboom', it will either leave dust which it's how generates new planets and stars, or the collapse fails it becomes a neutron star, OR, the collapse is so big that Star evolves into black hole... Anyways, name this Kaboom collapse",
        "link": "",
        "hints": [],
        "answer": "Supernova",
        "reaction": "More Kabooms incoming in next days"
      },
      {
        "day": 9,
        "title": "Really big Kaboom?",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "03/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Now imagine this, you have a star of a mass about 30 times of the Sun, called supermassive stars, now imagine these will have an end of life and collapse, their explosions are 100 greater then yesterday's answer...",
        "link": "",
        "hints": [],
        "answer": "Hypernova",
        "reaction": "They could even result creating massive dangerous black holes..."
      },
      {
        "day": 10,
        "title": "Extreme powerful merge",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "03/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "if you studied shards of recent days, you already know how much powerful Neutron stars and black hole could be, now imagine a ridiculous thought, what if they meet and merge, it already happened...a powerful astronomical event that occurs when two neutron stars or a neutron star and a black hole collide and merge, producing a bright burst of light across the electromagnetic spectrum, they can even create gold and platinum themselves, elements that needs absurd ammount of energy to form out of nothing!!!!",
        "link": "",
        "hints": [],
        "answer": "Kilonova",
        "reaction": "The merge was so powerful that it enlighten the whole world to a black hole :3"
      },
      {
        "day": 11,
        "title": "the unscalable burst of death",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "05/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "did you ask this question once in your life? what is the most known deadliest unimaginable thing in the universe? well, I got you a challenge for today to know it. This event is thought to be associated with the formation of black holes or Due to Kilonova occuring and they are incredibly bright, sometimes outshining ENTIRE galaxie, While incredibly bright, they are also very brief, lasting from milliseconds to minutes. And... if it passed just even far away from us, like REALLY FAR AWAY FROM US, thousands light years let's say , it will wipe out the entire life on Earth, a truly terrifying energy",
        "link": "",
        "hints": [
          "three words, the event is known to you I think"
        ],
        "answer": "Gamma ray burst",
        "reaction": "but why did I witness something shinier in my lif-"
      },
      {
        "day": 12,
        "title": "if black hole chooses violence",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "05/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Now imagine black hole, imagine him now hold a gun laser, yeah but no kidding, hhh. There exists some black holes where they deject huge energy rays from his two poles, they are also super bright, these black holes have a specific name",
        "link": "",
        "hints": [],
        "answer": "Quasar",
        "reaction": "oh yeah, if also these rays passes just few light years away from us, bye bye Earth"
      },
      {
        "day": 13,
        "title": "path of chocolate",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "05/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "How can you name a road where milk trucks pass through?",
        "link": "",
        "hints": [],
        "answer": "milky way",
        "reaction": "should I be ready to be dad, did I pass dad joke exam?"
      },
      {
        "day": 14,
        "title": "Quantum principle",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "05/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Now here's a small Quantum physics lesson, the most important principle, two known properties were found to be equivalent : XXXX<=>YYYY , the more object has mass, the more XXXX he has , and the more XXXX exists, the more YYYY flows fastly. Write XXXX<=>YYYY principle",
        "link": "",
        "hints": [
          "a second besides black hole is almost 50 years on Earth"
        ],
        "answer": "Gravity<=>Time",
        "reaction": "Interstellar is a good film to interpret it well"
      },
      {
        "day": 15,
        "title": "Miraculous planet",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "05/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Many exoplanets were found to have potentiel of life, but also some moons could have this property, there exists a planet on our solar system that has the most moons with this potential out of all other planets, name it",
        "link": "",
        "hints": [],
        "answer": "Saturn",
        "reaction": "Coincidence? I think not, hhh"
      },
      {
        "day": 16,
        "title": "biggest ring worth the gift for",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "05/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Saturn does posses a beautiful ring that you already own, but I am not yet satisfied, is there somewhere in Universe where I can find the biggest known ring I can gift her for...",
        "link": "",
        "hints": [],
        "answer": "J1407b",
        "reaction": "Naaah, still not enough"
      },
      {
        "day": 17,
        "title": "Speedrun orbit",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "05/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Earth takes about 365 days to make a tour around its star, Mercury needs 88 days. However, there's an exoplanet somewhere in observable Universe that just needs not 10 days, not 5 days, but just 8 hours to orbit its star, name this little speedrunner",
        "link": "",
        "hints": [],
        "answer": "GJ 367 b",
        "reaction": "if you were to take this project on that planet, it would be just 1/4 day long, hhh"
      },
      {
        "day": 18,
        "title": "Perfect combination",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "05/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "XXX&YYY have an interesting factor between them, The XXX's diameter is ~400 times larger then YYY's diameter, but it's also ~400 times farther away, making these two perfect combination for astronomical beautiful enlignment. name XXX&YYY",
        "link": "",
        "hints": [
          "you can stay in solar system for this one, hhh"
        ],
        "answer": "Sun&Moon",
        "reaction": ":3"
      },
      {
        "day": 19,
        "title": "Teleportation",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "05/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "In Quantum physics, teleportation does really exist, where two opposite rotational particles can share same information even when put on extreme sides of Universe, so if we bound to share this tunnel between two group of particles( which is instantanious ), you create teleportation !!! name this phenomenon ",
        "link": "",
        "hints": [],
        "answer": "Quantum tunneling",
        "reaction": "Quantum physics couldn't be any weirder, right... right?"
      },
      {
        "day": 20,
        "title": "Year calibration",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "05/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Answer with the exact number how long the orbit of Earth around the Sun in days",
        "link": "",
        "hints": [
          "each four years, a day is added in the year for some reason"
        ],
        "answer": "365.25",
        "reaction": "this explains why in Islam follow Moon time because of its accurate precision"
      },
      {
        "day": 21,
        "title": "Survival instincts",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "05/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Have you tried to imagine if there's any bio-multi-cellular creature on Earth that can resist to outer space with its coldness and heat? well, there's a surprinsing one, he can handle space pressure without atmosphere, radioactive wave rays, extreme heat and coldness and even survives in a vacuum space, name this creature with extreme survival",
        "link": "",
        "hints": [],
        "answer": "tardigrade",
        "reaction": "I remember seeing a post about it thinking it was a fake, hhh"
      },
      {
        "day": 22,
        "title": "a particle or a wave",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "05/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "The universe hides many mysteries that seems to us normal, for example, if you think about it, Light, is it composed as element/particle, because it interacts with our worldwith reflection and heat emission, holding even energy, OR is it a wave due to how it's spreading, BUT a crazy person said once: 'It's a wave and a particle at the same time', name this particle",
        "link": "",
        "hints": [
          "the crazy person is Einstein, proving after that E = M.C²"
        ],
        "answer": "photon",
        "reaction": "Quantum physics is also filled with many twisted plot twists lol"
      },
      {
        "day": 23,
        "title": "Pokemon with Unique technique",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "05/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "There exists some Pokemon with a unique trait. it will do anything if its trainer is in danger, putting itself at risk by creating even a black hole to protect the trainer, state this protective Pokemon who can create a black hole !!!!",
        "link": "",
        "hints": [
          "it has same color themes as Shaymin"
        ],
        "answer": "Gardevoir",
        "reaction": "This Pokemon also looks like an evolution of Shaymin, hhh"
      },
      {
        "day": 24,
        "title": "Beyond and Beyond",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "05/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Physicists has been thinking a long time ago that Protons, Electrons, Neutrons were the smallest things in the Universe, and then yet again, life proved them wrong, these extremely small particules are also composed with other extreme extremely small particules!!!",
        "link": "",
        "hints": [
          "what the duck say"
        ],
        "answer": "quarks",
        "reaction": "there are also Bozons, but that's for another yapping session, hhh"
      },
      {
        "day": 25,
        "title": "How to heal oneself",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "05/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "This shard is holding a dream, a dream where it can use the universe sky as a way to heal itself, I also heard it's more impactful when someone does it besides you. name this activity for this shard",
        "link": "",
        "hints": [
          "it's better when done at night with a clear sky on a plain grass"
        ],
        "answer": "Stargazing",
        "reaction": "One day it will happen nchllh"
      },
      {
        "day": 26,
        "title": "Time Traveler",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "05/07/2025",
        "sYear": 0,
        "specialMess": "Do you remember I sent you a photo of a hint of this challenge itself ? hhh",
        "enigma": "This day is spoken to comemorate the journey of a little purple time traveler, Stories tell that she travels from space to space, from time to time, fixing problems and calamities that humans could not forseek or even aware of, a true hero working on the background. Once upon a time, there was a blue wizard who dedicated his whole life to build her a home and temple that suits her status, because he recognised the sheer ammount of hardwork she puts everyday without anyone noticing, he knows she went through much, which is why he wished he could at least gift her a home where she can peacefully rest, a place independant from Time and Space. This purple traveler had the full name as...",
        "link": "",
        "hints": [
          "her origin name was in Korean"
        ],
        "answer": "보라색 별빛",
        "reaction": "folks say she is trying now to fix the moon itself shatered to pieces, the core of blue wizard's soul..."
      },
      {
        "day": 27,
        "title": "Hidden gift",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "05/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Moon wanted to give away more gifts to the bright sunshine, but he knew she would refuse, so he just said she can just hand it over and if she finishes using it, she would give it back. Three more words to hint the answer: Book/Universe/SouthEast",
        "link": "",
        "hints": [
          "Maybe a book related to Universe?",
          "South East could mean a direction should be followed on cover book"
        ],
        "answer": "FLEURUS",
        "reaction": "my trick worked, you are owning the book, hehehe"
      },
      {
        "day": 28,
        "title": "Optical failure",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "05/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "There was a really big project to develop a scope where it can visualise distinct galaxies way afar, but it had a big failure during lunch. Name this telescope",
        "link": "",
        "hints": [
          "During, 2CP, some teacher recommended watching a documentary about it"
        ],
        "answer": "Hubble",
        "reaction": "I recommend watching the documentary of its history, pretty interesting !!!"
      },
      {
        "day": 29,
        "title": "Naruto particle",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "05/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "In November 2023, scientists from the Telescope Array Project in Utah detected an extremely high-energy cosmic ray.It was a discovery to find One of the most energetic cosmic rays ever detected, with an energy of about 244 Eev ( a really big energy for a particle!!! E = 10^18 , to put you into perpective, 1ev is the simple energy to Electron, THIS ONE HAS 10^18*224 SAME AMMOUNT WITH THE SAME DIMENSIONS). Find the name if this ray particle",
        "link": "",
        "hints": [
          "Sasuke was silent since the name was dropped",
          "'XXXX particle' as a full answer"
        ],
        "answer": "Amaterasu particle",
        "reaction": "Yeah, physiscists nailed the naming, he was a Naruto fan, hhh"
      },
      {
        "day": 30,
        "title": "Sun outshine anything",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "05/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Look at the picture on that link, sounds like just a pixelated form of Sun, but there's a plot twist: This photo was taken at night while the camera facing down, facing Earth!!! Which means they captured not the photons, but particles barely interactable, but the Sun managed to interact with it but not the Earth, name these ghostly particles",
        "link": "https://apod.nasa.gov/apod/image/9806/neusun1_superk.jpg",
        "hints": [],
        "answer": "neutrinos",
        "reaction": "Our world is full of mysteries, Sub7anallah"
      },
      {
        "day": 31,
        "title": "Shard Lost in Time and Space",
        "difficulty": "Really Hard",
        "solved": false,
        "cDay": "05/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "A shard was going to be seen today to capture, but something is wrong... the shard may have drifted away to a distorted space where time is meaningless, the only information you have is he got driven to 14/14 as a date...",
        "link": "",
        "hints": [
          "Not enough information? it might mean you need to wait another shard to give you some more valuable information...",
          "Does a calendar has a meaningful time when you skim through it"
        ],
        "answer": "TimeTravelCTF{l05t_1n_5p4c3T1m30}",
        "reaction": "you saved him, yaaaay !!! ( I wonder how much years have passed, hhh )"
      }
    ]
  },
  {
    "month": 2,
    "solvedOne": false,
    "name": "February",
    "Theme": "Cryptography I",
    "days": [
      {
        "day": 1,
        "title": "Hello Crypto World",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "05/06/2025",
        "sYear": 0,
        "specialMess": "This is your month for practical Enigmas as CTFs, hhh. Fun Fact: because you do love cryptography, this is the only only theme that has two chapters in whole year, meaning 2 months of content :3. First Chapter is for Discovery and Learning Stuff, Second chapter is... ummm, it's where mystery starts spreading, anyways, hope you enjoy it !!! ",
        "enigma": "if words are characters, and characters are numbers, and numbers are weirder numbers, then this number is: 43727970746f4354467b68333131305f77307231447d",
        "link": "",
        "hints": [],
        "answer": "CryptoCTF{h3110_w0r1D}",
        "reaction": "Welcome to the Crypto World !!!"
      },
      {
        "day": 2,
        "title": "emiT dniweR s'tI",
        "difficulty": "ysaE",
        "solved": false,
        "cDay": "05/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "}de3gd3lw0nkc4_dn1w3R{FTCotpyrC ! od annog I ma tahw !!retup ym no desrever neeb sah emit eht won ,draobyek ym no eeffoc ym dellips I !on hO",
        "link": "",
        "hints": [],
        "answer": "CryptoCTF{R3w1nd_4ckn0wl3dg3ed}",
        "reaction": "!!! taht od dluoc eeffoc tahW"
      },
      {
        "day": 3,
        "title": "Mysterious program",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "05/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Check the link to find an interesting python script that has a pecular encryption method",
        "link": "https://drive.google.com/drive/u/1/folders/1oE40QJsZiaMVDNLomKA_EZ2Eqk9FDbzw",
        "hints": [],
        "answer": "CryptoCTF{Ch1n3s3_c4n_b3_wr1tt3n_1n_2_byt3s}",
        "reaction": "Mastering Cryptography is also an experience on how to reverse any random encryption system"
      },
      {
        "day": 4,
        "title": "Permutation OG: Scytale",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "05/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "As a second commander under the wing of higher admiral 'CinammonRoll the Pillar of North', I need to send this secret message where only she can read it, Only her knows 14 means many things, so I shouldn't worry:WBUCNBMRWGCAT·ERRESAERNTRPN·WIPSHCTOUHEOI·INRSIKOWSETNP·LGISNHMDISWC··LONUEOOANEEA··",
        "link": "",
        "hints": [],
        "answer": "catnip",
        "reaction": "GLORY TO PRINCESS OF OUR SHINY KINGDOM, WE WILL DO EVERYTHING TO RESCUE HER, 3AAAAAA"
      },
      {
        "day": 5,
        "title": "Ceasar has entered the chat",
        "difficulty": "Lhzf",
        "solved": false,
        "cDay": "05/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Oh No! Ceasar came to my office and spilled his coffee on my keyboard !! Now my PC is only readable for Ceaser !! What am gonna do now: JyfwavJAM{j34z3y_o4a3z_j0mm33}",
        "link": "",
        "hints": [],
        "answer": "CryptoCTF{c34s3r_h4t3s_c0ff33}",
        "reaction": "I will get my revenge on You, CEAAAAASAAAAR!!!!"
      },
      {
        "day": 6,
        "title": "Father of modern crypto: XOR",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "05/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "XOR has many utilities in current crypto systems that you already know of, go towards this link to try and decrypt the flag",
        "link": "https://drive.google.com/drive/u/1/folders/17-HBjGlp2zS1K96SxKjaTO9judHrFPlM",
        "hints": [
          "the name of the function could lead you to the format of our key",
          "for each iteration, we do modulo i%2 to choose a position in the string '01', hmmm..."
        ],
        "answer": "CryptoCTF{X0R_w4s_gam3_ch4ng1ng}",
        "reaction": "Good Job! You are also learning how to read in Python!! I am proud of you!!"
      },
      {
        "day": 7,
        "title": "Power of subtitution",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "05/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "with the 27! possibilities, this technique is unbrute forceable, but I am sure hackers would spill coffee on my keyboard and steal from me the key down this link, which is why my key for subitution is unreadable in human eyes, mwahahahah",
        "link": "https://drive.google.com/drive/u/1/folders/1NuyUUFmyL3EQGKcAdK8dPxg0DgHV0mSr",
        "hints": [],
        "answer": "CryptoCTF{1_h4te_h4ck3rs}",
        "reaction": "Noooooo, Hooww they do it???vbsvbzoivzoi"
      },
      {
        "day": 8,
        "title": "Ceaser Cipher, The return",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "05/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I saw Ceaser from afar coming towards my keyboard not just with a single cup of coffee, but with 8 cups !!! he spilled them all of them... Now my secret got submitted with vulnerable letters in the end...UllhawPXX{W34f4j_k035_p4g3_qq_e3lt0hzq_p0d}unshine",
        "link": "",
        "hints": [],
        "answer": "CryptoCTF{C34s4r_d035_h4t3_my_k3yb0ard_l0l}",
        "reaction": "STOP ATTACKING MY KEYBOARD WITH COFFEE, 3AAAAAA"
      },
      {
        "day": 9,
        "title": "It's all a matrix",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "05/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Check the link to see if you still remember some Matrix Algebra",
        "link": "https://drive.google.com/drive/u/1/folders/1az7eeee0lF_4H_IrR8DenPWop2uxGtie",
        "hints": [],
        "answer": "HillDecryptionSuccessful",
        "reaction": "I hereby you Queen of Algebra"
      },
      {
        "day": 10,
        "title": "Ceasar and his coffee Army",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "05/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I am seeing Far away the big brother of Ceasar... Vernam, *sigh , I think my room will smell coffee today again, let's try to hide my secret from him as much as possible.",
        "link": "https://drive.google.com/drive/u/1/folders/1ZWvUbDUra6-vNRQ__dkwpzZsO7CGtTOi",
        "hints": [
          "Vernam is like Vigenair, but size of key equals size of message"
        ],
        "answer": "CryptoCTF{V3rn4m_g0t_tr1cked}",
        "reaction": "My pc will be remembered for getting sacrificed with coffees with all these battles..."
      },
      {
        "day": 11,
        "title": "Base-n encoding",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "05/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Follow the link for a brief explanation on how base32, base64 work. After that, follow the instructions to encrypt a message with my personal base16 encryption base",
        "link": "https://drive.google.com/drive/u/1/folders/12ZnHHUrRUA_oLT_GiTGAX0JgdeZzi-3X",
        "hints": [],
        "answer": "SUNSHINE14",
        "reaction": "'Based' on relatable characteristics of the reader, hehe"
      },
      {
        "day": 12,
        "title": "It's over 9000!",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "06/06/2025",
        "sYear": 0,
        "specialMess": "The title is just a reference, but don't worry, I couldn't reach 9000 times with my PC, hhh ",
        "enigma": "I have encoded a certain secret , You will never manually get my secret, MWAHAHAHA",
        "link": "https://drive.google.com/drive/u/1/folders/1gQXwEys_Lv6fQsnlPIwyrirILQWJ-z7x",
        "hints": [],
        "answer": "CryptoCTF{d33p3st_53cr3ts_4r3_w4y_h1dd3n_1n_h3art5}",
        "reaction": "I actually tried to do 9000 iteration but that was taking brutally so long"
      },
      {
        "day": 13,
        "title": "- .... . / -... .. -. .- .-. -.-- / .-.. .- -. --. ..- .- --. .",
        "difficulty": ". .- ... -.--",
        "solved": false,
        "cDay": "----- -.... -..-. ----- -.... -..-. ..--- ----- ..--- .....",
        "sYear": 0,
        "specialMess": "",
        "enigma": "...",
        "link": "https://drive.google.com/drive/u/1/folders/13W2uP8L6wCCmNj6T7r9wQOllJGyfRYpv",
        "hints": [],
        "answer": "CRYPTOCTF-M0R53-C4N-B3-TR1PPY",
        "reaction": "-- . .- -. .-- .... .. .-.. . / -- . ---... / .- -- / .. / - .-. .. .--. .--. .. -. --. / -... ..- - / .... --- .-- / -.. --- . ... / - .... .- - / .-- --- .-. -.- / ..--.. ..--.. ..--.."
      },
      {
        "day": 14,
        "title": "What the hash",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "06/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "As skeptical as always am, do you exist or am I just scinzophrenic, hmmm... I can't check with my shared experience, cause I could be insane, so I'll try with Hash, I am gonna send a message M with its signature : MD5(M), you receive this, C: 'INUGKY3LJFTFG5LOONUGS3TFJFZVEZLBNQ======'. what is the signature ?",
        "link": "",
        "hints": [],
        "answer": "5ba78068a967481ad751effcac9a0341",
        "reaction": "hmm, still not convinced, hhh ( ain't no way I do deserve someone like this easily, I always need to do more for her)"
      },
      {
        "day": 15,
        "title": "Tricky Maths",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "06/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I have a message M, and Key K=M , I used Vernam 26 Times over the message with the same Key, and I got BMJCAJ, on 27th time, what will be the result ?",
        "link": "",
        "hints": [
          "there are 26 letters in Alphabets",
          "Vernam does have a weakness when using iterations, cause of modulo"
        ],
        "answer": "CYSEAS",
        "reaction": "I won't let Vernam spill coffee again on my keyboard, MWAHAHAH"
      },
      {
        "day": 16,
        "title": "Bloc technique: CBC",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "06/06/2025",
        "sYear": 0,
        "specialMess": "You can check the link  a photo I shared for you to remember CBC. Today's Enigma should be brief to just let you have fun with some calculations, hhh",
        "enigma": "Let text message (not hexa) be: 'ABCDEF', and IV=0xCC11, and size of block is 2 bytes, and the encryption block operation used is inverse (binary inverse). Try to find in hexa (exclude 0x from answer) the result of this if we use CBC",
        "link": "https://drive.google.com/drive/u/1/folders/1logyrajp7P0O1edbDhcYsdzjzZx1eqxK",
        "hints": [],
        "answer": "72ACCE1774AE",
        "reaction": "We have a genius here, Masha'Allah !!"
      },
      {
        "day": 17,
        "title": "Cryptogram",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "06/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "You already know subtitution, but can you decrypt it with only your brain power ? check this link and try solve one, the correct sentence in md5 is the flag",
        "link": "https://drive.google.com/drive/u/1/folders/1CewW9DG6J2PRd6ZK7K1mJV7sXC92maO6",
        "hints": [],
        "answer": "e3089ddf2d4c9573836ede3dcc5ea9f2",
        "reaction": "I am sorry if that took you some time to solve it, but YOU DID IT, JCLZLCKZNLKNC"
      },
      {
        "day": 18,
        "title": "Mysterious file",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "06/06/2025",
        "sYear": 0,
        "specialMess": "This is My personal Enigma that I used for Challenge n°1 in Treasure Hunt, I want you to try it out, hhh",
        "enigma": "A mysterious file has merged upon the seas, try to open it and you lay proceed to find the flag",
        "link": "https://view.officeapps.live.com/op/view.aspx?src=https%3A%2F%2Fraw.githubusercontent.com%2FTatiYoucef%2FTreasureWeb%2Frefs%2Fheads%2Fmain%2Ffiles%2FEncryptedMessage.xlsx&wdOrigin=BROWSELINK",
        "hints": [],
        "answer": "TatAli",
        "reaction": "Good old Days, hhh"
      },
      {
        "day": 19,
        "title": "Check Signal authentics",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "06/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I need to check that I am not halucinating from your messages, so let me check if you really sent M=14. with G(X) = X^4 + X^2, calculate R(X) awaited so That I can be sure I am not hallucinating, the result is binary (4 bits)",
        "link": "",
        "hints": [
          "This is CRC, you just need to find the rest of X^4*M(X) / G(X)"
        ],
        "answer": "0100",
        "reaction": "... NO, HOW DO YOU EXIST SO EASILY IN MY LIFE, XDJXJZNXKZJNXKZJN ( I am really grateful tho, BUT STILL? ZJCLZNLKNXKZNLKZNLXKN )"
      },
      {
        "day": 20,
        "title": "Lazy Nerd",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "06/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Check the link, I built a script that do many encryptions, yet its decryption could be done in a single line, MWAHAHAHA",
        "link": "https://drive.google.com/drive/u/1/folders/1PUeHdbMKMNBZEK2Oae9Ch12EPurg--fl",
        "hints": [
          "ROT is kind of weaker than cipher, cause it has a really critical weak point"
        ],
        "answer": "CryptoCTF{R0T_3ncrypt10n_c4n_b3_vuln3r4bl3}",
        "reaction": "This problem has many solutions, but most importantly you understood how ROT works ^_^"
      },
      {
        "day": 21,
        "title": "AES has entered the chat",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "07/06/2025",
        "sYear": 0,
        "specialMess": "I didn't wanna make you an encryption with DES cause it was bit boring and we haven't studied much to let you try it out theorically",
        "enigma": "for a single block of 128bits : 'Golden HeartSoul', with a key : 'PurpleSecret Key', Just try to make a single iteration of AES with this, you'll find down this link the steps. Output the flag 16 bytes in Hexa ( no need to include 0x )",
        "link": "https://drive.google.com/drive/u/1/folders/1Zujqh_C1T5G2RMn49jfJWbhlUpIjqcST",
        "hints": [],
        "answer": "f0df3220218ace262eda3526cde3d2eb",
        "reaction": "That was tough, but in the end you did it!!!!"
      },
      {
        "day": 22,
        "title": "Asymetrical king: RSA",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "07/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Oh No !!! some indian guy just passed my computer and spilled his coffee on my keyboard, now my Phi(n) got leaked : 20. Knowing that N = 33 , e = 17 and c = 5 are public, I hope that leaked information won't ruin finding out my M...",
        "link": "",
        "hints": [],
        "answer": "26",
        "reaction": "Coffee coffee coffee, COFFEE EVERYWHERE, KHCZKBCZKJBCZKJB"
      },
      {
        "day": 23,
        "title": "Defying the hellman",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "07/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Sun and Moon needed to share a secret key, both parties possess a private favourite number : a = 4 / b = 79. They agreed on meeting on two known stars : g=16 / p=157. Now only them would know what will be their secret key that will be shared between them forever",
        "link": "",
        "hints": [
          "A = g^a % p / B = g^b %p . A and B shall be shared between all stars",
          "K = A^b % p = B^a % p = g^a*b % p"
        ],
        "answer": "67",
        "reaction": "They will soon meet again and merge with prayer and patience"
      },
      {
        "day": 24,
        "title": "Camel is calling",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "07/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "As a second commander under the wing of higher admiral 'CinammonRoll the Pillar of North', we saved our sunshine princess!!! now I need to send our secret localisation number ID to my higher admiral Cinammon, he already brought me A=67 , g=16 , p=157, with my secret b = 79 , I already prepared my crypted message C = 106. *Meanwhile Admiral Cinammon: I just received from my commander the number 106, with my secret a = 67, I will find out where's our princess to launch our rescue team",
        "link": "",
        "hints": [
          "Ask me in messages cause I don't know how to hint here, hhh"
        ],
        "answer": "100",
        "reaction": "SEND ALL TROOPS TO RESCUE OUR SUNSHINE, 3AAAAAAAAAAAAA"
      },
      {
        "day": 25,
        "title": "I thrive to sign !!!",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "07/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "They tell me that each time I send a message I need to generate a random key ? Bruh, this is just so useless to me, I will just encrypt my message with AES with key as first 128 bits of my signature of MD5 , that should be enough, MWAHAHAHA. C='xbCIEy/GE0rp93EkN4KJEYFOhEzmr4GSvmneoJibOIsqWLjyD+uKrVgBbJu6ln2E' , IV = '0123456789123456'. Leaked Data = 'INZHS4DUN5BVIRT3NYZXMM3SL4======' ",
        "link": "",
        "hints": [
          "signature is a hash of the secret message"
        ],
        "answer": "CryptoCTF{n3v3r_us3_s1gn4tur3_4s_k3y}",
        "reaction": "You're doing so good !!! Masha'Allah !!"
      },
      {
        "day": 26,
        "title": "Gray trouble",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "07/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Someone keep sending secrets using simply Xor with a binray alternate key ( repetitive 10101010.... ) but when I decrypt I still find a weird message, not a secret, what is he doing to his message before encrypting it ??? See the link for C and the key K ",
        "link": "https://drive.google.com/drive/folders/1w_ifpEteysJ_pA4k4tu8NLDdPGMsKO4C",
        "hints": [
          "hmmm, what a weird gray problem",
          "maybe he didn't like the standard binary version of his characters"
        ],
        "answer": "CryptoCTF{gr4y_c4n_d3c31v3_p30p13}",
        "reaction": "I wonder if you found out immedietluy or not, hhh, I tried my best to hint you, hehe"
      },
      {
        "day": 27,
        "title": "⠠⠮⠀⠇⠁⠝⠛⠥⠁⠛⠑⠀⠷⠀⠃⠇⠔⠙",
        "difficulty": "⠠⠑⠁⠎⠽",
        "solved": false,
        "cDay": "07/06/2025",
        "sYear": 0,
        "specialMess": "M() = MIRROR() / Ω = ALL / pos(1)..pos(6) = topLeft .. downright",
        "enigma": "(M(7))(c - M(b))(Ω - 7 + pos(2))*2(Ω - M(pos(2) + pos(6x)) )(>)(| + -)(7-pos(6))( )(pos(3)+pos(4))( )(Ω - M(L))(| + -)(pos(1))(< - pos(6))(L - pos(6))*2(> - pos(5))(pos(6))(M(7) - pos(3))(pos(1))(Ω - 4 + pos(2))(Ω - pos(5))",
        "link": "",
        "hints": [
          "it's all about intuition"
        ],
        "answer": "brailleMaster",
        "reaction": "⠱⠽⠀⠙⠊⠙⠀⠠⠊⠀⠋⠁⠝⠞⠁⠎⠊⠵⠑⠀⠍⠽⠎⠑⠇⠋⠀⠊⠍⠁⠛⠔⠤⠀⠽⠳⠀⠋⠊⠗⠌⠇⠽⠀⠃⠑⠤⠀⠉⠇⠕⠎⠑⠀⠞⠕⠀⠍⠑⠀⠊⠋⠀⠠⠊⠀⠛⠑⠞⠀⠍⠽⠎⠑⠇⠋⠀⠃⠇⠔⠙"
      },
      {
        "day": 28,
        "title": "⏃⌰⟟⟒⋏ ⌰⏃⋏☌⎍⏃☌⟒",
        "difficulty": "⟒⏃⌇⊬",
        "solved": false,
        "cDay": "07/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "⏚⟒⟒⌿⊬ ⏚⍜⍜⌿⍜ ⍙⏃⏁⏃ ⎅⟟☍⟟ ⎅⍜⎅⍜⍜... ⎐⍜⏁ ? ⎐⊬⌿⏁⍜☊⏁⎎{⎐4⌰13⋏_⎅00⎅00}",
        "link": "",
        "hints": [],
        "answer": "VYPTOCTF{V4L13N_D00D00}",
        "reaction": "⏃⍀⟒ ⊬⍜⎍ ⏃⋏ ⏃⌰⟟⟒⋏ ? ☊⏃⎍⌇⟒ ⊬⍜⎍⍀ ⌇⍜⎍⌰ ⌿⎍⍀⟟⏁⊬ ⟟⌇ ⍜⎍⏁ ⍜⎎ ⏁⊑⟟⌇ ⍙⍜⍀⌰⎅"
      },
      {
        "day": 29,
        "title": "Oscar and his favourite game",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "08/06/2025",
        "sYear": 0,
        "specialMess": "Fun fact: you can witness this shard only once per 4 years :3",
        "enigma": "We rescued Sunshine!!! The message was well received and decrypted by our higher admiral 'CinammonRoll' and he provided us the best rescue team, but... I am seeing in the far north the worst enemy, Oscar... I heard he can decrypt literally anything, he even decrypted my message I sent to my admiral about our localisation, he has the perfect intel and brute force techniques to do that. I need to send one final message to my chef:'Going East.14.7.174 at dawn 07:14', but how can I send this with Oscar intercepting everything... I heard he's blind tho, and my admiral is not far away, hmmm... maybe I can ask princess to help me send the message using her ray of lights, is there a useful code to be able to comminucate with light with my chef?",
        "link": "",
        "hints": [
          "Light can do only two things if you comminucate with it: light ON / light OFF",
          "How did the olf folk sailors communicated each other on their ships to their colleagues on coastline",
          "maybe binary language could help us here"
        ],
        "answer": "--. --- .. -. --. / . .- ... - .-.-.- .---- ....- .-.-.- --... .-.-.- .---- --... ....- / .- - / -.. .- .-- -. / ----- --... ---... .---- ....-",
        "reaction": "after the long war, Oscar couldn't see our message and sunshine was returned safely to her homeland, GLORY TO SUNSHINE, YATAAAAAAAA"
      }
    ]
  },
  {
    "month": 3,
    "solvedOne": false,
    "name": "March",
    "Theme": "Chaos",
    "days": [
      {
        "day": 1,
        "title": "mysterious pattern",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "13/06/2025",
        "sYear": 0,
        "specialMess": "Welcome to chaotic month !!! where I had no idea where to put these challenges, hhh. So, you gonna not expect what's expected, and you could expect the unexpected, as all things said, may this randomness be fun in your journey",
        "enigma": "a + z = 97122 , z + a = 71229 , b + c = 6362 , t + a + t + i = 10511697116 , o + u + a + d + i = ?",
        "link": "",
        "hints": [
          "a simple gesture is done for each operation",
          "order of equalities does affect the result"
        ],
        "answer": "01051111179710",
        "reaction": "I knew you would find the pattern, hhh"
      },
      {
        "day": 2,
        "title": "the secret IP",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "13/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Based on your PTSD knowledge, could you find what IP adress of the server hosting UnfazedTime. Due to some confusing results, I will let you know that it's X.X.X.4 ",
        "link": "",
        "hints": [
          "DNS of Google is pretty interesting"
        ],
        "answer": "216.24.57.4",
        "reaction": "unfortunately the server won't give you authority if reached by only IP"
      },
      {
        "day": 3,
        "title": "Leaked Data",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "13/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Oh No !!! Someone spilled coffe on my backend server, now some data has been leaked, I hope nobody realises it....",
        "link": "https://drive.google.com/drive/u/1/folders/1ojQ5XOsOlqiCm0v71MhIJgXsBsu2847k",
        "hints": [
          "Remember Byul's story ? I think it's the same name temple"
        ],
        "answer": "SecretVaultKey",
        "reaction": "Ahhh you also stole my reaction, then I won't react, hhh"
      },
      {
        "day": 4,
        "title": "What is this Pokemon?",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "13/06/2025",
        "sYear": 0,
        "specialMess": "I may or not left some pokemon challenges in this month...",
        "enigma": "My favourite Gen5 Pokemon, grass/fairy type, fluffy and cute, a hint image was put in link",
        "link": "https://drive.google.com/drive/folders/145udZOa63TmYI46i7eCVB9yANfcfbOu_",
        "hints": [],
        "answer": "Whimsicott",
        "reaction": "ahhhhhh, my sweety Whimsicott, LJNXLXZNLKXNLZ"
      },
      {
        "day": 5,
        "title": "Priviledge absurdity",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "13/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I putted my flag on this doc, and yet I feared for some hackers would get it from me, now I changed it its location to a more secure place, *phew...",
        "link": "https://drive.google.com/drive/u/1/folders/1l1SHvEyVnLqSyFMZTvB47fxZmsQpTyRP",
        "hints": [
          "Before is is is, is was was"
        ],
        "answer": "SecretCTF{r34lly_s3cr3t_4nd_f0rg0tt3n}",
        "reaction": "Ayyy, as expected from our chief hacker of the seas, hhh"
      },
      {
        "day": 6,
        "title": "Among us",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "13/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "do you remember MySQL ? cause you will need it here :3 . Basically if you remember DzFoot Database, a new player got added in but in the end he was an impostor, your objective is try to get the name of Impostor to find him. All data needed is in the link",
        "link": "https://drive.google.com/drive/u/1/folders/1aXpMEEjKaTkehFFe7TfapUZKCYy1pA9s",
        "hints": [
          "Many solutions could be done, most original is using MySQL itself"
        ],
        "answer": "C1N4M0NR011",
        "reaction": "I wonder if you expected SQL enigma would come here, hhh, well, it's chaotic theme :3"
      },
      {
        "day": 7,
        "title": "Art hunting",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "13/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "a flag has been chased, but its exact location seems unknown, take the link to see its last trace",
        "link": "https://drive.google.com/drive/u/1/folders/16VocU0zJc2BwLezeoKJ5vvMFMtzcf5bW",
        "hints": [
          "'pdf files ARE PROHIBITED', bruh, boomer humor"
        ],
        "answer": "artCTF{sm011_s1z3d_fl4g}",
        "reaction": "yaay, I missed artCTFs"
      },
      {
        "day": 8,
        "title": "Git gud",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "13/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "a commit has been found on some shared project done long ago...",
        "link": "",
        "hints": [
          "Done by team frontenders..."
        ],
        "answer": "memoryCTF{n0st41g1c_d4y5}",
        "reaction": "those days were precious to me excluding the project itself, hhh"
      },
      {
        "day": 9,
        "title": "unlocking the secret's chamber",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "13/06/2025",
        "sYear": 0,
        "specialMess": "Well, there are two possibilities when you reach here today, you either were so curious you found out about the secret link that archives all urls Drive I have been storing , or still couldn't figure out yet. I mean, if we think about it, you were since the beginning allowed to view and edit all those files while trusting you of course, but you never had a notification of shared access ? hmm",
        "enigma": "The link for today is broken, so you had to find it manually. Find it and the flag for today's Enigma shall be yours",
        "link": "https://youtu.be/dQw4w9WgXcQ?feature=shared",
        "hints": [
          "it should be somewhere where both of us can access to",
          "try to check your 'memories', I know it's around there"
        ],
        "answer": "SecretCTF{r00t_v4ult_f0und}",
        "reaction": "now you have the full power to check any other folder, damn..."
      },
      {
        "day": 10,
        "title": "No pirate can't play chess",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "13/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "A chess board exists in the link, but the solution is required in the white side, checkmate in 2 moves!!The password to the next challenge is the chess moves needed to make white wins in this format : Move1_Move2 (No need to write the black counter moves).You'll find also in link how to code chess moves",
        "link": "https://drive.google.com/drive/u/1/folders/1dLvKwyY5UihYftaVGzTb8Gjee1IdRj98",
        "hints": [
          "Sacrifices are needed for better outcome"
        ],
        "answer": "Qd8+_Re8#",
        "reaction": "yaaaay, you did it !!!"
      },
      {
        "day": 11,
        "title": "Who am I",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "14/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I am a number, I can consider myself an identifier for the whole promo Esi 2022, I appear unofficially only on a single platform, nobody cares about my existence, and yet without me, the conversation community wouldn't exist, who am I?",
        "link": "",
        "hints": [
          "community conversation should be some social app",
          "it might bean inderct ID, like of a group or something",
          "can the app be accessible by other means to seek the ID of promo group"
        ],
        "answer": "1302013096398946355",
        "reaction": "Niiiiiice, good job!!!"
      },
      {
        "day": 12,
        "title": "sudo ku",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "14/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I couldn't implement sudoku on website, so I wanna apologise over lack of experience in web dev, I hope if you don't mind, I made it in a sheet file so you can play it. Concatenate all rows for the final answer",
        "link": "https://drive.google.com/drive/u/1/folders/1eWJcZIbRLffu4YUTVEKEw0pMb5EnPGIK",
        "hints": [],
        "answer": "345817926726394851891265473254638197687951342913472568162589734479123685538746219",
        "reaction": "You're so good !!! Masha'Allah !!!"
      },
      {
        "day": 13,
        "title": "Small rest",
        "difficulty": "None",
        "solved": false,
        "cDay": "14/06/2025",
        "sYear": 0,
        "specialMess": "Today is rather a small healing session rather than enigma, so enjoy, hhh",
        "enigma": "Yo !! how you doing future reader, my day is 14/06/2025 , 05:48AM , it is starts of Summer vacation, I am actually having fun doing these enigmas and getting more and more excited to show them to you, they are like now my small troops that their duty would at least make your journey brighter, special as you already are, and more fun nchllh, if you reading this, it means you didn't give up and still keeping your strike every day, I can never feel any prouder. Well, let's leave some other emotional messages in the final credits... anyways, here's a link that came randomly on my head while doing this, it's a 'random month' in the end, hhh.I am always here to listen to your thoughts, don't forget !! flag:Th4nk_Y0u_f0r_y0ur_pr3c10u5_t1me",
        "link": "https://www.instagram.com/p/DEXnsJ-TX4a/",
        "hints": [
          "uhh... hello I guess ? hhh"
        ],
        "answer": "Th4nk_Y0u_f0r_y0ur_pr3c10u5_t1me",
        "reaction": "reminder you can always go back to any other enigma successfully accomplished :3"
      },
      {
        "day": 14,
        "title": "Coincidence ?",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "14/06/2025",
        "sYear": 0,
        "specialMess": "Note: This challenge needs a good ammount of Enigmas being solved",
        "enigma": "Somehow, out of all challenges and Enigmas existing daily, all of them posses a unique answer, except one... repeat the same answer here.",
        "link": "",
        "hints": [
          "one exists in August",
          "one exists in its neighbor month of the other",
          "the answer has a meaning, and possess an interisting plot twist"
        ],
        "answer": "Eclipse",
        "reaction": "Have I thought about this before or was it a coincidence? nobody knows, hhh"
      },
      {
        "day": 15,
        "title": "Follow the eyes",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "14/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "the eyes are the answer : Combee, Zubat , Unown, Regigigas , Joltik .",
        "link": "",
        "hints": [
          "Count the eyes for each pokemon, careful for tricky ones"
        ],
        "answer": "60174",
        "reaction": "Regigigas possesed fake eyes and you realised it, niice !!"
      },
      {
        "day": 16,
        "title": "Canonical name",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "14/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "the website name is actually masked on a real one, demask it and find the true name the web server",
        "link": "",
        "hints": [
          "I know it's a PTSD, but some Res2 things needs to be done"
        ],
        "answer": "gcp-us-west1-1.origin.onrender.com.cdn.cloudflare.net.",
        "reaction": "Ewww, put back the mask on that domain, hhh"
      },
      {
        "day": 17,
        "title": "Unexpected limital Encounter",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "14/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Let's suppose we are in 2022... yeah, let's really suppose that, hmmm, *pointing out randomly, here, try to find the limit (+infinity) of f(x) of exo04 subject 2 of our Bacalaurian maths... DID I STUTER ?",
        "link": "",
        "hints": [
          "strongest factor shall lead the group in sum"
        ],
        "answer": "-infinity",
        "reaction": "Ahh yes, back in the days when I didn't have backpain..."
      },
      {
        "day": 18,
        "title": "yezh iskis",
        "difficulty": "kalet",
        "solved": false,
        "cDay": "14/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Brezhoneg eo anv ar yezh-mañ, unan eus ar yezhoù ralañ implijet eo abalamour d'he bevenn rannvroel ha d'he ankouaat kozh. Ar banniel eo anv ar yezh-mañ",
        "link": "",
        "hints": [],
        "answer": "Breton",
        "reaction": ""
      },
      {
        "day": 19,
        "title": "Void page",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "14/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Void consumes everything in its path, visit it in /#/Void",
        "link": "",
        "hints": [
          "It even consumed the flag"
        ],
        "answer": "VoidCTF{v01d_p4ss3d_by_h3r3}",
        "reaction": "I do love void tho, feels so cozy and calm rather than the society"
      },
      {
        "day": 20,
        "title": "Geo guesser",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "14/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Do you love maps ? do you love exploring it trying to find all interesting views? then you love this challenge, try to answer the name of the place on the map down this link, it's my dream to also go there, not the country, but the place",
        "link": "https://drive.google.com/drive/folders/1bVGF-ryaIE9JdFEHJ6OD02FuLVRRVbhx",
        "hints": [
          "the country is known that both of use would like to visit it",
          "it has a magneficent beach",
          "existing south of a really really big island"
        ],
        "answer": "Okinawa",
        "reaction": "One day nchllh, one day, hhh"
      },
      {
        "day": 21,
        "title": "Router Infiltration",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "15/06/2025",
        "sYear": 0,
        "specialMess": "In This enigma, you will for real attack my LAN, hhh",
        "enigma": "Oh no!! A bird flied by my router now my IP got leaked: 105.98.221.177. I hope this shoudln't be enough to be able to find out my MAC address...",
        "link": "",
        "hints": [
          "did you know some algerian routers host an http server",
          "Did you also know that there's a default authentification on routers if not changed"
        ],
        "answer": "10:6F:D9:15:44:4D",
        "reaction": "you can even shut down our Router..."
      },
      {
        "day": 22,
        "title": "History of Mewtwo",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "15/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Did you know that Mewtwo is an artificial Pokemon created through experiments? Mewtwo has deep lore and long beef against humans, try to search some of it or event watch the first Pokemon film ( one of the best movies ) , the answer is the Pokemon origin of Mewtwo",
        "link": "",
        "hints": [],
        "answer": "Mew",
        "reaction": "I loved both Pokemons in different aspects, they deserve the recognition of most well built stories out there"
      },
      {
        "day": 23,
        "title": "Zì bì zhèng shūxiě de yǔyán",
        "difficulty": "Zhōngděng de",
        "solved": false,
        "cDay": "15/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Nín shìfǒu céng xiǎngxiàngguò túbù chuānyuè zhōngguó de wànlǐ chángchéng, zhè shìfǒu zhídé, kèfú kùnnán shìfǒu huì zhèngmíng shénme, wǒ bù zhīdào, dàn wǒ xiāngxìn zhè jiāng shì yīduàn nánwàng de huíyì, yóuqí shì hé nín qīnjìn de rén yīqǐ túbù bìng fēnxiǎng zhè zhǒng jīnglì, nín suǒ xúnqiú de dá'àn jiùshì zhè piān yǎnjiǎng zhōng suǒ shuō dì dìfāng",
        "link": "",
        "hints": [
          "e682a8e698afe590a6e69bbee683b3e8b1a1e8bf87e5be92e6ada5e7a9bfe8b68ae4b8ade59bbde79a84e4b887e9878ce995bfe59f8eefbc8ce8bf99e698afe590a6e580bce5be97efbc8ce5858be69c8de59bb0e99abee698afe590a6e4bc9ae8af81e6988ee4bb80e4b988efbc8ce68891e4b88de79fa5e98193efbc8ce4bd86e68891e79bb8e4bfa1e8bf99e5b086e698afe4b880e6aeb5e99abee5bf98e79a84e59b9ee5bf86efbc8ce5b0a4e585b6e698afe5928ce682a8e4bab2e8bf91e79a84e4babae4b880e8b5b7e5be92e6ada5e5b9b6e58886e4baabe8bf99e7a78de7bb8fe58e86efbc8ce682a8e68980e5afbbe6b182e79a84e7ad94e6a188e5b0b1e698afe8bf99e7af87e6bc94e8aeb2e4b8ade68980e8afb4e79a84e59cb0e696b9"
        ],
        "answer": "Great Wall of China",
        "reaction": "你做得很好，你是我最想分享经验的人"
      },
      {
        "day": 24,
        "title": "Secret memorisation",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "15/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "when I open up my PC, I have no need to memorise my password number to input, all I need to remember is the logo of VsCode which is far more easier and first digit being 1",
        "link": "",
        "hints": [
          "forms can be used to track inputs and follow the direction"
        ],
        "answer": "1596357",
        "reaction": "great, now I let you access to my PC..."
      },
      {
        "day": 25,
        "title": "Inivisible threat",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "15/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Welcome to yet another hint art hunt for you !! go check the link",
        "link": "https://drive.google.com/drive/u/1/folders/1-4_YKovm7fdFVYJ6NhpjEp-9QXcRho4X",
        "hints": [
          "once, there was that annoying project in 1CS",
          "Eyes can sometimes deceive you"
        ],
        "answer": "artCTF{h1d3_n_s33k}",
        "reaction": "still remembering the final day of 1Cs, it was a wonderful day"
      },
      {
        "day": 26,
        "title": "Prehistorical RISC code",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "15/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Check the code you find in the link, try to find out the content of R03",
        "link": "https://drive.google.com/drive/u/1/folders/1WL56qMFXEMRf8VVVQ_OqTMnQzY7aYp--",
        "hints": [
          "an old software needed to configure this"
        ],
        "answer": "14",
        "reaction": "Can't believe this is the first time 14 was an answer, hhh"
      },
      {
        "day": 27,
        "title": "[_[-€¯|¯ $|°€/-\\|<",
        "difficulty": "H/-\\|2D",
        "solved": false,
        "cDay": "07/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "!/= ¥()L| |2Ɛ/\\|] 7|~|!5 `/°µ ΛЯ☰ @ |=()|2|V|1|)/\\ß1_€ /*ƐЯ$[]|V `/()|_| §|-|0|_|1_|> 8Ɛ /*/2°L|[)  ©[][)Ɛ ]§ 7/-/€ 7]¯|¯1_[-",
        "link": "",
        "hints": [
          "1337",
          "h3ll0_w0r1d"
        ],
        "answer": "[_[-€¯|¯ $|°€/-\\|<",
        "reaction": "\\_:_/(-)/\\¯|¯ /-\\ ]-[0|\\|()|?/-\\8[_Ɛ Λ[|~|]Ɛ|/☰|V|☰|V† †() /2☰/\\[) 7:-:!5"
      },
      {
        "day": 28,
        "title": "The northern Path",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "15/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "You found yourself on a country island you can see on the link and a manuscript, seek its knowledge and answer will be forspoken: by the long tail of the beast, seek North till you reach a big black Lake, continue North till you reach a land again, from there, go towards East till you reach the back of Blue Dragon, Reach its upper head and go East again, keep going till you cross boundary of a new country, Seek its heart, make a path towards South then East with the shape of L where the intersection point is where the Lands and Seas meet, you'll continue East till a you find the small golden Egg",
        "link": "https://drive.google.com/drive/u/1/folders/169qpyG5eYiX31aJIE4tc28wM1S0pb3nq",
        "hints": [],
        "answer": "Taiwan",
        "reaction": "May your traveling be blessed for this long journey"
      },
      {
        "day": 29,
        "title": "Root of all Pokemon",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "15/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Have you ever wondered, what is the story of Pokemon world ? what is the first Pokemon ever, which came first, egg or Pokemon ? Try to find this Pokemon that resolved this contradiction in the story",
        "link": "",
        "hints": [
          "Canonically strongest Pokemon ever"
        ],
        "answer": "Arceus",
        "reaction": "I catched that Pokemon by the way :3"
      },
      {
        "day": 30,
        "title": "smoll reminder",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "13/07/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "This little fragment here wanted you to see those smol reminders for you, it's good to remember how much you're doing and how much you're giving, so don't forget yourself !! after watching the reminder in the link, the flag is the link of the post in insta.",
        "link": "https://drive.google.com/drive/u/1/folders/11N4tOs1ahubZ6hjRd7Po3soxkwEvKelk",
        "hints": [],
        "answer": "https://www.instagram.com/p/DI3g6UsP8Bo/",
        "reaction": "hope this will bright your day more nchllh!!!"
      },
      {
        "day": 31,
        "title": "Chaos control",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "15/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Nothing better than finishing this month with... chaos/randomness, let's throw a dice, a special dice with a secret face :3 , good luck !!, path : /#/games/dice",
        "link": "",
        "hints": [],
        "answer": "ChaosMasterCTF{D1c3_m4st3r3d_1n_ch405}",
        "reaction": "GG !! may only good chaos be with you nchllh"
      }
    ]
  },
  {
    "month": 4,
    "solvedOne": false,
    "name": "April",
    "Theme": "The Sun",
    "days": [
      {
        "day": 1,
        "title": "True name",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "15/03/2025",
        "sYear": 0,
        "specialMess": "This month will be focused on my most precious topic: The Sun !! generally it will be easy cause the one reading it should know herself, right ? hhh",
        "enigma": "The Sun is so lovely, she is shiny, gentle, caring, gives off that warm light to anyone facing her so freely!! but we should know firstly her full name, could you guess it ?",
        "link": "",
        "hints": [
          "I hope you don't have Amnesia 😭"
        ],
        "answer": "Ouadi Chaima",
        "reaction": "YES !! Masha'Allah, nchllh she get shinier and blessed each day"
      },
      {
        "day": 2,
        "title": "Favourite color",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "15/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "The Sun is yellow, yet, it's not the color that she would really prefer the most, I wonder what's her favourite color.",
        "link": "",
        "hints": [
          "you love reacting with some particualr emoji"
        ],
        "answer": "purple",
        "reaction": "purple is also the theme color used for this project 💜💜💜 "
      },
      {
        "day": 3,
        "title": "Nickname",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "15/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Actually, I have named the Sun with many different nicknames, you can say I got addicted, hhh. I might have a favourite one.",
        "link": "",
        "hints": [
          "Synonym of Starlight"
        ],
        "answer": "sunshine",
        "reaction": "I love it !! cause it represents directly those beautiful rays emmited that keeps me warm when facing her ☀️💙"
      },
      {
        "day": 4,
        "title": "forgotten enigma",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "15/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I didn't FORGET about that Enigma, hehe, but I am sure you're more than capable to beat it. If you forgot where was the challenge, I kept a link here. The last word found in encrypted message is the answer.",
        "link": "https://mail.google.com/mail/u/1/?ogbl#advanced-search/to=mc_ouadi%40esi.dz&subset=all&within=1d&sizeoperator=s_sl&sizeunit=s_smb&query=to%3A(mc_ouadi%40esi.dz)/QgrcJHsHkKrFJkTsLFhTGDCxBRDzBSzkFjG?compose=DmwnWtDnFdCqNGgrrhKLCztJWgFfLRvNCsBqwMkcNpjgtmTVjjZdbZtppXfFtnklvbQzKdgqTLHg",
        "hints": [
          "do you remember when I said back in the oldschool networking, people needed a language with just binary : 0 or 1. I am sure you are familiar with it",
          "are all the spaces equal ? hmmm",
          "maybe try to remember a language where we can just use two caracters"
        ],
        "answer": "CORDIALEMENT",
        "reaction": "Yaaay !! you now are 100% up to date with my enigmas, Yuppiii.... Or is it...hhh"
      },
      {
        "day": 5,
        "title": "Chronicles of Byul I",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "15/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Night passed out After Byul tried so tiressly to find the temple till the night came in. She lifted her head and gazes through the clear moon in the sky",
        "link": "",
        "hints": [
          "Byul did really love seeing the beautiness of nature",
          "Was there a moon in the story ?",
          "you can check maybe some specific slide in the story ?"
        ],
        "answer": "18374",
        "reaction": "The sky was indeed beautiful ✨✨"
      },
      {
        "day": 6,
        "title": "Glory to Shaymin",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "15/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I love Shaymin !! it does suit so well with personality of Sunshine. Shaymin prefers to live around 'plainedGrass', if you go there, I am sure she would be so happy that it would give you a gift",
        "link": "",
        "hints": [
          "The place could be related to a certain path to make",
          "you have ability to manipulate paths, try visit her !!!"
        ],
        "answer": "ShayminCTF{You_Are_The_Best}",
        "reaction": "Make sure to visit her again in another time !!!"
      },
      {
        "day": 7,
        "title": "Missing soulmate, The Moon",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "18/03/2025",
        "sYear": 0,
        "specialMess": "Ok... I am so sorry, You might hate me with this enigma, so I let you use your time machine if you cannot accept the normal terms of today's Enigma",
        "enigma": "The shinning Sun had a key agreed upon with the moon, but They divided it so each one can guard its own half: SunAndMoonCTF{1_4m_Y0u_4nd_",
        "link": "",
        "hints": [
          "The only thing that could let you win this fairly, is to wait the moon's Enigma that gives you the other half"
        ],
        "answer": "SunAndMoonCTF{1_4m_Y0u_4nd_Y0u_4r3_m3_174_<3}",
        "reaction": "Soulmates had met and made the best combo, nchllh the fate would bring them closer !!"
      },
      {
        "day": 8,
        "title": "Favourite Pen",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "18/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "The Sun has a beautiful pen that I also appreciate its form and structure. In term of BDD, how can I identify that pen?",
        "link": "",
        "hints": [
          "Does the pen had some sort of matricule that it could identify it"
        ],
        "answer": "6941798423326",
        "reaction": "That's the pen, I loved it !!!"
      },
      {
        "day": 9,
        "title": "ID of the Sun",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "18/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "is There some sort of Matricule that can identify the sunshine out of anyone in Esi ?",
        "link": "",
        "hints": [
          "I really hope you don't have amnesia 😭😭😭",
          "In terms of BDD, your ID is..."
        ],
        "answer": "22/0073",
        "reaction": "Ohhhh, look how unique this is !!"
      },
      {
        "day": 10,
        "title": "the day of birth",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "15/03/2025",
        "sYear": 0,
        "specialMess": "this day is really special, if you read this, then firstly: Congratulations!!! I made sure to give the theme of this month like this only cause of this day. nchllh le39ouba to 100 years",
        "enigma": "Master actually left an older artifact in a tower you are already familiar with, it's related to the beginning of time where a blessed soul has just came to life. Oh, also Cinammon left you a video in the link",
        "link": "https://www.instagram.com/p/DG3yfrQvmFT/",
        "hints": [
          "Maybe it's related when was born that person ?",
          "Remember how did you unlock the clock first time ? maybe there's another 'Time' that could trigger it"
        ],
        "answer": "Happy Birthday to my most precious person!!",
        "reaction": "I wonder which year you did this, but note to the future you: Congrats et Bsse7tek !!! "
      },
      {
        "day": 11,
        "title": "The spoken suggestion",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "18/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I admit, I ran out of ideas... So I asked you if you suggest me something, and you did ! it is the solution of this quiz, hhh. Hints are understandable to use here.",
        "link": "",
        "hints": [
          "the day this quiz was created is the same day I got from you a suggestion",
          "Ubishi... Does it remind you of something ?",
          "I actually sent your suggestion in insta, so no need to ask me to send it to you for profesionalism, hhh"
        ],
        "answer": "jbhjkojibujhj",
        "reaction": "JBKQJSKJBQKJBCK , YOU REMEMBERED !!! what an autistic enigma quiz, hhh"
      },
      {
        "day": 12,
        "title": "Evil Sun",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "18/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "speaking of Sun, in Super Smash Bros Ultimate. There was a big evil as shown in the link down below, name this evil and the enigma shall be yours",
        "link": "https://youtu.be/WShCN-AYHqA?si=lKtcIa1dkkEy8I0D",
        "hints": [
          "Google is permissible, you know, hhh"
        ],
        "answer": "Galeem",
        "reaction": "El7emdoulillah the Sunshine I appreciate has the opposite personality of this creature, hhh"
      },
      {
        "day": 13,
        "title": "Chronicles of Byul II",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "16/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "In the main story of Unfazed Time, there was a symbolic scene shown that represents Byul facing against time itself proving her patience and dedication in her adventure, if you spotted it, tip the time written on that moment as HH:MM",
        "link": "https://www.canva.com/design/DAGei2fJ2pA/EigKOb01bRNNV-3zOEi-rg/edit?utm_content=DAGei2fJ2pA&utm_campaign=designshare&utm_medium=link2&utm_source=sharebutton",
        "hints": [
          "Byul facing time is a metaphore and not one at the same time, but which one you should seek ?",
          "Clock also represents time, was there a moment were both Byul and Clock existed at the same scene ?"
        ],
        "answer": "21:00",
        "reaction": "As Courageous as she was, she kept going forward against Time 🕘"
      },
      {
        "day": 14,
        "title": "the golden number",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "15/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Ahh yes, Silicium, the most important material to build a cpu, do you also know what's special chimically about it?",
        "link": "",
        "hints": [
          "Chimical table is a good tool to inspect materials",
          "What day is today ?"
        ],
        "answer": "14",
        "reaction": "Yeah, who cares about its befenics, but most importantly it has 14 as atomic number!!!"
      },
      {
        "day": 15,
        "title": "Chronicles of Byul III",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "18/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "While Byul returning to enter the temple again, she realised the script in the wall has changed due to paradoxal Time anomalies",
        "link": "https://www.canva.com/design/DAGei2fJ2pA/EigKOb01bRNNV-3zOEi-rg/edit?utm_content=DAGei2fJ2pA&utm_campaign=designshare&utm_medium=link2&utm_source=sharebutton",
        "hints": [
          "you can use webshell of picoCTF to hash in md5"
        ],
        "answer": "27b5764e87d32bdce0661950bb99f0f9",
        "reaction": "Thank you, for making my life happier each day"
      },
      {
        "day": 16,
        "title": "It's Pottery Time !!!",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "18/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "You made many potteries that definitely look beautiful. However, I do have a favourite one, could you guess which one was?",
        "link": "",
        "hints": [
          "it was special for me, that's why it's my favourite one"
        ],
        "answer": "Abra",
        "reaction": "A favourite pokemon pottery made by my favourite person, thank you !!"
      },
      {
        "day": 17,
        "title": "Enigma Arts I",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "19/03/2025",
        "sYear": 0,
        "specialMess": "Enigma arts are art general based enigmas, meaning you can find clue only with photos to trace the whereabouts of key. They are independent to month's theme, and they are fun ! it was my dream to build some treasure hunt mini-games, so I hope you can enjoy them all.",
        "enigma": "Hint arts usually don't have the text, you can go directly inspect a photo down the link to hunt the flag!",
        "link": "https://drive.google.com/drive/folders/1iY1p3xUtObimTkLUBDts-YQQBOkEwh3H?usp=drive_link",
        "hints": [
          "Green color with black as theme, I wonder where did I see that..."
        ],
        "answer": "artCTF{first_treasureHunt_D0ne!}",
        "reaction": "Nice hunt !!! you are already Pro !!"
      },
      {
        "day": 18,
        "title": "the cursed subject",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "19/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I see Algebra, it reminded me of it, I see Ana, it reminded me of it, I try to study BDD, nope! it's there again, I TRY POO, WHY IS IT AGAIN THERE, KJQSBJBQKJSBDQKJ... so Yeah, as I said: 'everythin is....'",
        "link": "",
        "hints": [
          "Spiders even hate it cause their house reminded them of it, bruh"
        ],
        "answer": "RO",
        "reaction": "Even this page is RO..."
      },
      {
        "day": 19,
        "title": "Memorable day",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "19/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Sunshine organised an event with her team members about playing many different mini games to get tickets and to have fun, key of Todays's Enigma: $[EventName]CTF{$[LOCATION]_at_$[DD/MM/YYYY]}",
        "link": "",
        "hints": [
          "I remember you gave me something on that day telling me I was a VIP, thank goodness I brang also something to gift it to you, hhh "
        ],
        "answer": "ArcadeDayCTF{Cyber_at_03/12/2024}",
        "reaction": "Those were the good days, El7emdoulillah we experienced it"
      },
      {
        "day": 20,
        "title": "Chronicles of Byul IV",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "19/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "As Byul finished her Trial, she wanted to thank her guider who thanks to her she could reach where she is now. Byul gladly gave the flag to her guider as she was thanking her, she might not know how to break the 4th wall tho.",
        "link": "",
        "hints": [],
        "answer": "ByulCTF{YOU_DID_IT}",
        "reaction": "hopefully more adventures of both of you would come nchllh"
      },
      {
        "day": 21,
        "title": "Enigma Arts II",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "19/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "It's Enigma art day!!!, the photo where you need to hunt the flog is down this link",
        "link": "https://drive.google.com/drive/u/1/folders/1mILpmc0seWmwwp7WL_QMGobx-rm_ZjhZ",
        "hints": [
          "Poor Mounir, I wonder what club made this page pink just to annoy him, hhh"
        ],
        "answer": "artCTF{I_4m_everywhere_:3}",
        "reaction": "You digged so deep !! you got it, yattaaaa !"
      },
      {
        "day": 22,
        "title": "좋아하는 언어",
        "difficulty": "매질",
        "solved": false,
        "cDay": "2025년 3월 20일",
        "sYear": 0,
        "specialMess": "",
        "enigma": "선샤인은 이 언어를 좋아해요. 그래서 당연히 이 언어에는 수수께끼가 있겠죠. 이 숫자들을 해석할 수 있나요? : ed 95 9c ea b5 ad ec 96 b4 43 54 46 7b eb aa a8 eb 93 a0 5f ea b2 83 ec 9d b4 20 eb b0 94 ec 9d b4 ed 8a b8 ea b0 80 20 eb 90 a0 20 ec 88 98 20 ec 9e 88 ec 8a b5 eb 8b 88 eb 8b a4 7d",
        "link": "",
        "hints": [
          "한국어 문자가 이진법으로 변환 가능하다면, 이를 번역할 수 있을 것입니다..."
        ],
        "answer": "한국어CTF{모든_것이 바이트가 될 수 있습니다}",
        "reaction": "다른 날에는 더 많은 한국형 에니그마가 공개됩니다!!!"
      },
      {
        "day": 23,
        "title": "Root of the world",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "20/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Sunshine is the root of hope and happiness, I wonder if you can find some root to discover a secret...",
        "link": "",
        "hints": [
          "your world is the website, then... the root is...",
          "Think of it as a path."
        ],
        "answer": "SunShineCTF{r00t_0f_w0rld_is_h5r5}",
        "reaction": "You shouldn't close eye on these pages :3"
      },
      {
        "day": 24,
        "title": "Enigma Arts III",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "20/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Seek the link to see the hint art, and go hunt the flag !!!",
        "link": "https://drive.google.com/drive/u/1/folders/1KVMlLSgmUMiNhJJ58h1hkXywhgKR10Kw",
        "hints": [
          "That logo seems a bit familiar to a certain Project...",
          "That white background doesn't remind you of frames ? what tool was that again ?"
        ],
        "answer": "artCTF{DPI_PTSD}",
        "reaction": "Good thing Cinammon was helping us during that project!!!"
      },
      {
        "day": 25,
        "title": "Chronicles of Byul V",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "20/03/2025",
        "sYear": 0,
        "specialMess": "For non ambiguity, Focus solely on chapter 1 for this riddle, this is the final Chronicles of Byul, Good luck !!! ",
        "enigma": "How many Suns, How many Moons, How many cats, How many Gates, How many Statues, how many Travelers(?3), How many clocks. twin numbers decided to merge as sum. 4 and 3 befriended each other and decided to merge as sum. Sun and moon should stay aside",
        "link": "https://www.canva.com/design/DAGei2fJ2pA/EigKOb01bRNNV-3zOEi-rg/edit",
        "hints": [
          "it's a simple calcul, each slide is important to caclulate something"
        ],
        "answer": "1479183127",
        "reaction": "Could this number be a key for something else ?"
      },
      {
        "day": 26,
        "title": "Color as a key",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "20/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "if I can't hide my Viginère decryption key as a text, maybe I can do it differently without anyone noticing, hehehe: KoakbvfyPLZ{Agnuaht_uihdx_ow_bvvxrf}",
        "link": "https://www.figma.com/design/c2xPgFUbFZnDtZYGkrG3zW/TP-IGL?node-id=0-1&p=f&t=xHJ64ds2Ba7K3hyl-0",
        "hints": [
          "Title might hint into something",
          "That figma surely has a 'colored' key",
          "Are colors in the end text ?"
        ],
        "answer": "SunshineCTF{Nothing_could_be_hidden}",
        "reaction": "Brilliant mind !!!"
      },
      {
        "day": 27,
        "title": "Owlification",
        "difficulty": "OwO",
        "solved": false,
        "cDay": "20/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I love owls and cats, they are so cute !! do you know a nickname where I can refere both of them as the same time to Sunshine ?",
        "link": "",
        "hints": [
          "Ciamoi seems a good start for naming",
          "Ouadi , Owl, hmmm...",
          "Ciamoi, Chaima, hmm..."
        ],
        "answer": "Owadi Chiamoi",
        "reaction": "YES, IT'S SO FITTING, HCBKQSBKBXQBK"
      },
      {
        "day": 28,
        "title": "Abacus basics",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "20/03/2025",
        "sYear": 0,
        "specialMess": "I think I have heard you learned Abacus I think? So I tried to learn some basics to show you this small enigma, if I found some interesting enigmas related to it, why not !!!",
        "enigma": "I wonder what this weird structure means, the photo is found with the link down below.",
        "link": "https://drive.google.com/drive/u/1/folders/1XMrNfCP1OgoH9qZbP6FZBRdX0OPmrQxe",
        "hints": [
          "It's all about Abacus basics, try to extract the number found"
        ],
        "answer": "14174714",
        "reaction": "You really know Abacus !! Niiice, Masha'Allah"
      },
      {
        "day": 29,
        "title": "What in the Poneglyph",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "20/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "What is even that, lol",
        "link": "https://drive.google.com/drive/u/1/folders/1b1q_JjBpaVUN9SIQBdJZFSlnebLQWdU-",
        "hints": [
          "A language that I think you only one and me have the ley to decipher it :3"
        ],
        "answer": "FONTCTFDONE",
        "reaction": "You can read this? wow, you're amazing !!!"
      },
      {
        "day": 30,
        "title": "Guidance of Sunshine",
        "difficulty": "Really Hard",
        "solved": false,
        "cDay": "",
        "sYear": 0,
        "specialMess": "this Enigma might be one of the best ones I made, on behalf of my dream to make a treasure hunt realisable for my favourite person. Good Luck.",
        "enigma": "Sun has many different rays that emits on Earth. Once upon time, it emitted an UV ray, the exact location hasn't been spotted precisely, but we captured some povs footages that could lead you to its destination",
        "link": "https://drive.google.com/drive/u/1/folders/1Pr79Emo08VFQnky0o-TwFwWP7cn_cVR_",
        "hints": [
          "You might need some UV detector for this one",
          "If I said Treasure hunt, I really meant it, hhh... Go hunt the place the secret message of the Sun !!"
        ],
        "answer": "내  가슴  깊은  곳에  영원히  햇살이  비치네",
        "reaction": "Indeed, She did guide me and she will surely do in the future nchllh"
      }
    ]
  },
  {
    "month": 5,
    "solvedOne": false,
    "name": "May",
    "Theme": "Games",
    "days": [
      {
        "day": 1,
        "title": "Jan Ken Shizazu !!!",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "21/03/2025",
        "sYear": 0,
        "specialMess": "This month will be full of Video games or anything related to as game, some are gameplays or some are knowledge games based questions (NINTENDO, JHJDHCJHSVJ), I can't get excited to see you experience them !!!",
        "enigma": "Let's start with classical: Rock Paper Scissors!!! Go to path: /#/games/RPS, or you can use this link, and go strike your opponent 🔥🔥🔥🔥",
        "link": "https://unfazed-time.onrender.com/#/games/RPS",
        "hints": [],
        "answer": "gameMasterCTF{Rock_Paper_Scisors_mastered_147}",
        "reaction": "What a game! This is a warm up for what's next, so be prepared !!! hhh"
      },
      {
        "day": 2,
        "title": "How to unhover an autistic button",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "21/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I hate this button, no matter what, it avoids me from clicking it, It's so frustrating, LSNLILOVEYOUQSNLQ. path is: /#/games/annoyingButton",
        "link": "https://unfazed-time.onrender.com/#/games/annoyingButton",
        "hints": [
          "Is there a way to click on button without even clicking it",
          "There should be a way, users without a mouse should have the ability to interact with web"
        ],
        "answer": "gameMasterCTF{button_secret_unveiled}",
        "reaction": "I don't know what you did, but thanks for calming down that button !!!"
      },
      {
        "day": 3,
        "title": "pico memories I",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "21/03/2025",
        "sYear": 0,
        "specialMess": "It's time enigma art again !!! with this theme goes to pico images where you try to guess which level was this pico game as flag answer: ${WorldName} Lvl.?",
        "enigma": "Go to this link to try find out which level was this in pico park 2, the flag format: ${WorldName} Lvl.?",
        "link": "https://drive.google.com/drive/u/1/folders/1USBQpMNRigtN92HTahiyfTXbwC1kY8Xz",
        "hints": [
          "Once upon time, there was two soulmates wanted to play at the first time, pico park 2!!!"
        ],
        "answer": "Hello, Pico Park 2 Lvl.1",
        "reaction": "It was the start of new core memory cause she was there"
      },
      {
        "day": 4,
        "title": "Guess the sequence I",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "21/03/2025",
        "sYear": 0,
        "specialMess": "Guess the sequence enigmas are pretty fun in a way where I give you a list of words or names that has logical sequence for a game and you try to guess the next one. No need to have knowledge on that game, just an effecient way to search ( you can disable use of Chatgpt if you wanna challenge yourself, hhh )",
        "enigma": "Guess the next word of this Sequence: Mondstadt, Liyue, Inazuma, Sumeru, Fontaine, ???",
        "link": "",
        "hints": [],
        "answer": "Natlan",
        "reaction": "Imagine how big of a map with all these regions in a single game(120GB btw, hhh), wow..."
      },
      {
        "day": 5,
        "title": "Telepathy of all time",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "23/03/2025",
        "sYear ": 0,
        "specialMess": "",
        "enigma": "Could you guess my number in less than 10 tries ? Try it in path: '/#/games/guess'. Or you can use this link.",
        "link": "https://unfazed-time.onrender.com/#/games/guess",
        "hints": [
          "Have you ever heard of Recherche Dichotomique ?"
        ],
        "answer": "gameMasterCTF{Logarithm_1s_useful_at_guessing}",
        "reaction": "In the end, SFSD was useful ( sorry... )"
      },
      {
        "day": 6,
        "title": "Deja Vue I",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "23/03/2025",
        "sYear ": 0,
        "specialMess": "Deja Vue enigmas are related to images that it might makes you feel familiar, you should remember the exact moment when you were playing that game to get the codes from them as a flag.",
        "enigma": "Does this image remind you of anything particular ? Go to Link to see it.",
        "link": "https://drive.google.com/drive/u/1/folders/18ps2CvSaqkTA0tn-kAFO29IcFsovvQ9J",
        "hints": [
          "A tape, doesn't it make you remember...something ?"
        ],
        "answer": "826",
        "reaction": "I am sure it was a memorable gameplay to you, hhh"
      },
      {
        "day": 7,
        "title": "Most Powerful",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "23/03/2025",
        "sYear ": 0,
        "specialMess": "",
        "enigma": "In lore accurate storylines of Nintendo Universe, who is the most powerful caracter that exists there?",
        "link": "",
        "hints": [
          "Looks are usually deceiving",
          "I think I already yapped a bit about it",
          "He's fluffy, and cute... yes, he is the most powerful In NintendoVerse"
        ],
        "answer": "Kirby",
        "reaction": "So deadly with cuteness !! just like y-...Ahem, I shall go keep sleeping...and dreaming..."
      },
      {
        "day": 8,
        "title": "pico memories II",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "21/03/2025",
        "sYear": 0,
        "specialMess": "This level of today was also emotional one, about how we beated together that level, I wonder if we ever reach there with Nadine.",
        "enigma": "Go to this link to try find out which level was this in pico park 2, the flag format: ${WorldName} Lvl.?",
        "link": "https://drive.google.com/drive/u/1/folders/1SLVHh_dRfx74_f2gCHGflKQ8WdgtybjY",
        "hints": [
          "A boss should only exist in the last level, not final world tho, weirdly..."
        ],
        "answer": "Shoot 'em up Lvl.4",
        "reaction": "I still remember how you keep shooting after beating the boss, it was so memorable moment for me, hhh"
      },
      {
        "day": 9,
        "title": "Lost in the deep woods",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "24/03/2025",
        "sYear ": 0,
        "specialMess": "",
        "enigma": "Deep woods whispered you the secret path to not get lost: NWNEESENE",
        "link": "https://drive.google.com/drive/u/1/folders/10OrPrXk_jsp0tTduTOHzT3z0MUGMUj__",
        "hints": [
          "if you follow the whispers given, you shall never feel lost"
        ],
        "answer": "DeepWoodCTF{n0thin6_cut5_d33p3r_th4n_4_t0n6u3}",
        "reaction": "You are now a child of Deep woods who already mastered the paths of the forest"
      },
      {
        "day": 10,
        "title": "Let's do GAMBLING",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "23/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I wanna have a sunshine, could you get it for me? ",
        "link": "https://drive.google.com/drive/u/1/folders/155_2vHbh99rJGFizhY4o-FPOROB40M3a",
        "hints": [],
        "answer": "gameMasterCTF{MarioKart_Madness}",
        "reaction": "Nice reflexes !!! As expected from a pro gambler, hhhh"
      },
      {
        "day": 11,
        "title": "Deja Vue II",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "24/03/2025",
        "sYear ": 0,
        "specialMess": "",
        "enigma": "Does this image remind you of anything particular ? Go to Link to see it.",
        "link": "https://drive.google.com/drive/u/1/folders/1WgljbpNm42Va9K650fOMqsUMajwzJrj7",
        "hints": [
          "A red skirt and a needle, doesn't it remind you of something....or someone?",
          "You defenitely played the game where she existed there, I also played that game."
        ],
        "answer": "Hornet",
        "reaction": "I fantisized that caracter to be you when I played Hollow Knight..."
      },
      {
        "day": 12,
        "title": "Cpt++",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "24/03/2025",
        "sYear ": 0,
        "specialMess": "",
        "enigma": "Do you know how to count? go follow this link for more details and rules.",
        "link": "https://drive.google.com/drive/u/1/folders/1V6oGsi2peIEEsLHrrFNO6YfxFdz9-Rbn",
        "hints": [],
        "answer": "39",
        "reaction": "You have a potentiel to be a Pro in Mario Party, yaaaay"
      },
      {
        "day": 13,
        "title": "Guess the sequence II",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "24/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Guess the next word of this Sequence: Kanto, Johto, Hoenn, Sinnoh, Unnova, Kalos, Alola, ???",
        "link": "",
        "hints": [],
        "answer": "Galar",
        "reaction": "Small fact: Your game pokemon Diamond was released in 4th gen with the release of 4th region: Sinnoh !!!"
      },
      {
        "day": 14,
        "title": "Countdown",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "24/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Do you have good reflexes? try it on path: /#/games/reflexe. or you can go to this link, hehe.",
        "link": "https://unfazed-time.onrender.com/#/games/reflexe",
        "hints": [],
        "answer": "gameMasterCTF{ADHD_k1ll3r_141477}",
        "reaction": "Nice reflexes!!! As expected from pro pico player :3"
      },
      {
        "day": 15,
        "title": "pico memories III",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "21/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Go to this link to try find out which level was this in pico park 2, the flag format: ${WorldName} Lvl.?",
        "link": "https://drive.google.com/drive/u/1/folders/1SuoQjShre1ErUW_4YxU_IOQBb-VTV0uT",
        "hints": [
          "it was struggling about how to break the glass using... our ears ?"
        ],
        "answer": "Skills Or Devices Lvl.3",
        "reaction": "I still don't fully understand how developers made their mind to this level, lol"
      },
      {
        "day": 16,
        "title": "Deja Vue III",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "24/03/2025",
        "sYear ": 0,
        "specialMess": "",
        "enigma": "Does this image remind you of anything particular ? Go to Link to see it.",
        "link": "https://drive.google.com/drive/u/1/folders/1ajE8THLzN2-n6yRJzkJLfYH58YslHN6w",
        "hints": [
          "It's obviously a map of something"
        ],
        "answer": "GreenPath",
        "reaction": "a region full of nature and green, just like your soul-... ANYWAYS, KJXKJKXZJXjk"
      },
      {
        "day": 17,
        "title": "whoami",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "24/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Pokemon fears my presence, I have resistance from all primary elements, we are so hostile that we can be dangerous even against our blood, my worst fear is a fairy and coldness, who am I?",
        "link": "",
        "hints": [
          "if we talking about resistance and effectiveness, the most logical answer would be a type of a Pokemon"
        ],
        "answer": "Dragon",
        "reaction": "Dragon type pokemons are the most powerful types in the end"
      },
      {
        "day": 18,
        "title": "Guess the sequence III",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "24/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Guess the next word of this Sequence: Super Mario 64, Super Mario Sunshine, Super Mario Galaxy1/2, Super Mario 3D World, ???",
        "link": "",
        "hints": [
          "Are you seeing some pattern of these Mario Games",
          "Oh look! A Mario that has a story not in 2D, how special !!"
        ],
        "answer": "Super Mario Odyssey",
        "reaction": "They are all Goated, I hope I can get to show you all of them when I get the chance nchllh"
      },
      {
        "day": 19,
        "title": "tricky Hide&Seek",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "24/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Something is hidding from you, go Chase it!!! the 'root' place starts with this link",
        "link": "https://drive.google.com/drive/u/1/folders/1XHFYoaUZAueoffH4PNiHgxQjN7iFMomV",
        "hints": [
          "Sometimes, everyone underestimate obvious spots in Hide&Seek",
          "when I was young, I used to do inverse psychologie where I don't hide the furthest away, but the opposite to be unpredectible"
        ],
        "answer": "GameMasterCTF{h1d3_n_s33k_1s_s0m3t1m35_tr1cky}",
        "reaction": "Next Time, you should always start checking from the beginnig, hehe"
      },
      {
        "day": 20,
        "title": "pico memories IV",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "21/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Go to this link to try find out which level was this in pico park 2, the flag format: ${WorldName} Lvl.?",
        "link": "https://drive.google.com/drive/u/1/folders/1Lzmd8jtHgPdE7q__s6_IF2ExobSBYjUV",
        "hints": [
          "it was also a memorable moment when accomplishing that level, cause it symbolises the begining if the end of a big adventure"
        ],
        "answer": "Last Park Lvl.4",
        "reaction": "*Sniff, who's cutting onions..."
      },
      {
        "day": 21,
        "title": "Deja Vue IV",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "25/03/2025",
        "sYear ": 0,
        "specialMess": "",
        "enigma": "Does this image remind you of anything particular ? Go to Link to see it. You should name the game that the screenshot has taken from",
        "link": "https://drive.google.com/drive/u/1/folders/1NCx91cNa3aDuq8joevlaoGi86aXfQ8VT",
        "hints": [
          "I played this game and wanted to show you my achievement, hope you didn't mind for my arrogance, hhh"
        ],
        "answer": "Pokemon Sword",
        "reaction": "That took me some time to catch 400 different breeds, lol"
      },
      {
        "day": 22,
        "title": "Mysterious dots",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "25/03/2025",
        "sYear ": 0,
        "specialMess": "",
        "enigma": "what is this file? I wonder if it hides a secret",
        "link": "https://tatiyoucef.github.io/TreasureWeb/files/EncryptedMessage.xlsx",
        "hints": [
          "The shape doesn't remind you of some crypting method used graphically?"
        ],
        "answer": "TatAli",
        "reaction": "this challenge was actually made in Treasure Hunt Orga event by me, I am sure you would love our event !!"
      },
      {
        "day": 23,
        "title": "Guess the sequence IV",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "25/03/2025",
        "sYear ": 0,
        "specialMess": "",
        "enigma": "Guess the next word of this Sequence: Mario&Luigi, Wario&Waluigi, Toad&Toadette, Peach&???",
        "link": "",
        "hints": [
          "These duo caracters seem so alike in characteristics, hmmm"
        ],
        "answer": "Daisy",
        "reaction": "Almost everyone forget that she is also a princess in Mario games, lol"
      },
      {
        "day": 24,
        "title": "Maths Speedrun",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "25/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Are you good at maths Calculations? Test your calculation power in path: /#/games/maths",
        "link": "https://unfazed-time.onrender.com/#/games/maths",
        "hints": [],
        "answer": "gameMasterCTF{B1g_br41n_t1me_7714}",
        "reaction": "Don't underestimate Soroban teacher, hhh"
      },
      {
        "day": 25,
        "title": "pico memories V",
        "difficulty": "Dark",
        "solved": false,
        "cDay": "21/03/2025",
        "sYear": 0,
        "specialMess": "This level was also touching, considering that it was last level ever to beat for us, thank you for letting me experience this magical journey with you.",
        "enigma": "Go to this link to try find out which level was this in pico park 2, the flag format: ${WorldName} Lvl.?",
        "link": "https://drive.google.com/drive/u/1/folders/1w3-VArqhs3RNaXlGCrqWSKoirzdWgC3X",
        "hints": [
          "At last, pico soulmates stepped on their last level together, even tho it wasn't the last for the game..."
        ],
        "answer": "Hard Park Lvl.4",
        "reaction": "Thank you so much to play with me, Chaima, I hope you know how precious this was for me"
      },
      {
        "day": 26,
        "title": "Deja Vue V",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "26/03/2025",
        "sYear ": 0,
        "specialMess": "",
        "enigma": "Does this image remind you of anything particular ? Go to Link to see it.",
        "link": "https://drive.google.com/drive/u/1/folders/13Q94Mj509E_B3mLxZvEQPF46hP2jtBy7",
        "hints": [
          "you and I played the game, but I don't think you have accomplished it yet, but that's fine by me lol",
          "that blue theme rectangle doesn't remind you of Something ?",
          "that blue thing sounds like some sort of creature, hmm..."
        ],
        "answer": "Dawn",
        "reaction": "I can't get myself excited to see you finish one day a pokemon, one day nchllh"
      },
      {
        "day": 27,
        "title": "Mastering literrature",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "26/03/2025",
        "sYear ": 0,
        "specialMess": "",
        "enigma": "Do you know Wordle? A game to try to guess a word of 5 letters, find the word as the flag of this enigma!!!",
        "link": "https://wordleplay.com?challenge=c2hpbnk=",
        "hints": [
          "it has a caracteristic about you, hehe",
          "in terms of word knowledge, you already know this word, it's a simple one"
        ],
        "answer": "Shiny",
        "reaction": "Yaaay, Nice one !! as expected from our shiny teacher of English, hhh"
      },
      {
        "day": 28,
        "title": "Guess the sequence V",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "26/03/2025",
        "sYear ": 0,
        "specialMess": "",
        "enigma": "Guess the next word of this Sequence: Mario|Bowser, Sonic|Dr.Eggman , Kirby|Void, Link|???",
        "link": "",
        "hints": [
          "if you put these 2 caracters in a single room, there will be no room after that"
        ],
        "answer": "Ganondorf",
        "reaction": "If you tried to type firstly Ganon, I need to yap 100 hours how it's not the final antagonist in Zelda Trilogy, lol"
      },
      {
        "day": 29,
        "title": "crafting a ring from nothingness",
        "difficulty": "Really Hard",
        "solved": false,
        "cDay": "26/03/2025",
        "sYear ": 0,
        "specialMess": "",
        "enigma": "there's a game called infinity craft, where you start having only 4 primary elements, but fusing them might give you new elements that will be in your disposal. My proposal is simple: Build me a Saturn :3 (yes, literally), and the flag will be yours (Screenshot me your Saturn to reward you the flag).",
        "link": "https://infinite-craft.com/",
        "hints": [
          "you have all the freedom to make Saturn, my attempt was first to find planet and ring"
        ],
        "answer": "gameMasterCTF{1nf1n1ty_Cr4ft_1s_fun_741147_:3}",
        "reaction": "I wonder your reaction of some of your crafts, hhh"
      },
      {
        "day": 30,
        "title": "Lost in the shuffle",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "26/03/2025",
        "sYear ": 0,
        "specialMess": "",
        "enigma": "there are some dolls that will be shuffled, focus on the one that is on the center... More details will be given down this link",
        "link": "https://drive.google.com/drive/u/1/folders/124OAROPXutm5tikK0ZlzRzeYfKYV2YZD",
        "hints": [],
        "answer": "334",
        "reaction": "Good eyes!!! I am sure now you have good potentiel in Mario Party, hehe"
      },
      {
        "day": 31,
        "title": "May the stars shine down on you",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "23/03/2025",
        "sYear": 0,
        "specialMess": "I was actually only recently (recently of my timeline, lol) found out that someone in Mario games said a sentence so close of 'May my sunshine guide me', So I made it as final enigma of this Month, hope you enjoyed it !!!'",
        "enigma": "Name the character in Mario Universe that said a sentence with closest meaning of : 'May the sunshine guide you'.",
        "link": "",
        "hints": [
          "if we talking about stars, this character should exist in a Mario game related to Space.",
          "This character also loves stars and guide them.",
          "the theme color of this caracter is white and cyan."
        ],
        "answer": "Rosalina",
        "reaction": "She is also guardian of the galaxy, how convenient and fitting with someone reffered to as sunshine, hhh"
      }
    ]
  },
  {
    "month": 6,
    "solvedOne": false,
    "name": "Juin",
    "Theme": "Activities",
    "days": [
      {
        "day": 1,
        "title": "Good Morning",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/03/2025",
        "sYear": 0,
        "specialMess": "In this month, as it's the beginning of the Summer, I thought of giving you Enigmas as fun social activities or some loved hobbies to do, you won't need to try hard, it will be a good theme to just rest and have fun, hhh",
        "enigma": "Wake up, wash your face, start do Prayer and thank rebbi sub7anou for your progress in life till now, say Good morning to anyone: to your family, to your best friend ( maybe to me if you don't mind... )... I know your honesty, so if you did this, you can go to this link as the flag waits you there, hhh.",
        "link": "https://drive.google.com/drive/u/1/folders/1DRghYlPfcWFDsq2GeEMBCDlb_vT9KJzB",
        "hints": [
          "I don't think you should need a hint to how to salute someone xD, especially that is your expertise, hhh"
        ],
        "answer": "funActivtivitiesCTF{g00d_t0_st4rt_d4y_p0s1t1v3ly}",
        "reaction": "Good morning to sunshine!! nchllh every day is a blessing to you !!!"
      },
      {
        "day": 2,
        "title": "safari enigma I",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/03/2025",
        "sYear": 0,
        "specialMess": "Safari enigma is one of categories of challenges of this theme, basically I describe you anything and you should find a picture about it, I hope you enjoy them all!!! ",
        "enigma": "Try to take a picture of Dawn or Sunset of this day, I don't mind any quality, send it here in this link or to me, and I will reveal you the flag.",
        "link": "https://drive.google.com/drive/u/1/folders/1tcR1wmL7K3lag6Q3VBQjiQbVYbrF7ZCd",
        "hints": [],
        "answer": "funActivtivitiesCTF{sun_1s_4lw4ys_b34ut1ful}",
        "reaction": "So shiny!!! sub7anallah, Sun is so gorgeaus in everything, hehe"
      },
      {
        "day": 3,
        "title": "linking fate with rope",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Do you love knitting? and do you have a needle and a silk to knit? if yes, if you don't mind, try to knit something simple, anything is enough to get today's enigma, send it here in this link or to me, and I will reveal you the flag.",
        "link": "https://drive.google.com/drive/u/1/folders/1_0DJ-CDH4bCLfxReg3bVmVWh3U77Toxl",
        "hints": [],
        "answer": "funActivtivitiesCTF{kn1tt1ng_m4k3s_l1f3_3nj0y34ble}",
        "reaction": "Masha'Allah, such beautiful knit as her owner, hehe, rebbi y7efdek nchllh"
      },
      {
        "day": 4,
        "title": "Drawing Contest I",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/03/2025",
        "sYear": 0,
        "specialMess": "in this category, I will ask you to draw something and you can use any tool to draw it, let's see your masterpieces in action, hhh",
        "enigma": "Let's start with something simple, a cat !!! try to draw a simple cat, any tool is possible. send it here in this link or to me, and I will reveal you the flag.",
        "link": "https://drive.google.com/drive/u/1/folders/1WhorXvZPP-9two9Sx5hLhAhheaF4mXs3",
        "hints": [],
        "answer": "funActivtivitiesCTF{4rt154n4_1s_4_d33p_c0nc3pt_t0_gr45p}",
        "reaction": "Can I predict that you drew a kitty with a smile ? or maybe a caleco ? hehe"
      },
      {
        "day": 5,
        "title": "Pokemon adventure I",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/03/2025",
        "sYear": 0,
        "specialMess": "you might hate this categorie, I am so sorry T_T, you will need to play Pokemon Diamond and try to get the pokedex info of the Pokemon I specify (by owning that pokemon through catching, evolving, ....)",
        "enigma": "As introduction, I know you have a Piplup, try to send me his Pokedex as a screenshot on drive or directly to me and the flag shall be yours",
        "link": "https://drive.google.com/drive/u/1/folders/1Y00kDfhD2bNIU8yrrLQYJaY8Uko2UkC_",
        "hints": [
          "Pause tha game > Pokedex > Search Piplup > Screenshot his data"
        ],
        "answer": "PokemonCTF{St4rt_0f_n3w_3r4}",
        "reaction": "You know I haven't forget that you left this game, do you? hhh (Don't worry, I wouldn't mind that at all, lol)"
      },
      {
        "day": 6,
        "title": "Telepathying the telepathy",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "29/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "ignoring the silly title, let's play a small X/O game in this link, hhh, flag will be given after at least a single match done",
        "link": "https://drive.google.com/drive/u/1/folders/1q1gjGxqJuVSLdGp4oRRb9Od5whulQYy3",
        "hints": [],
        "answer": "SillyCTF{GG_th4nk5_f0r_pl4y1ng}",
        "reaction": "I would say we will have a lot of ties, hhh"
      },
      {
        "day": 7,
        "title": "Gentle reminder I",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "29/03/2025",
        "sYear": 0,
        "specialMess": "You know, as each day passes, it's really important to be aware about how lucky we are to have this life, so, I have let some dailys to be reminders for yourself make dou3a2 and nchllh get closer to our creator.",
        "enigma": "Go to this link to see the small task with flag reward",
        "link": "https://drive.google.com/drive/u/1/folders/1TVYgdl0eCYOlbFI1OYo_k4ckCurWjfGy",
        "hints": [],
        "answer": "GentleReminderCTF{tessbi7_after_prayer_is_a_blessing}",
        "reaction": "El7emdoulillh for ni3mat Islam, Dailies should also be reminders to how thankful we should be."
      },
      {
        "day": 8,
        "title": "Silly joke",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "29/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Tell me a joke so I can see how much autistic my level of humour is :)",
        "link": "",
        "hints": [],
        "answer": "ActivityCTF{LOL}",
        "reaction": "I think I am already seeing my stupid face laughing at your joke..."
      },
      {
        "day": 9,
        "title": "Pokemon adventure II",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I wanna see if you can catch a bird, hmmm, how about a starly! try to send me his Pokedex as a screenshot on drive or directly to me and the flag shall be yours",
        "link": "https://drive.google.com/drive/u/1/folders/1FREMDj6exwrTxfsokUWVHaD2n0y4VUh2",
        "hints": [
          "Pause tha game > Pokedex > Search Starly > Screenshot his data",
          "Pokepedia is really a good website to search for where to find or catch any pokemon of any generation, google: Starly pokepedia, you will find Etourmi which is his name in french, go there and try to get used to how to web browse there"
        ],
        "answer": "PokemonCTF{St4rly_1s_r3ally useful_1n_3ndg4m3}",
        "reaction": "Yattaaaa, Into the next hunt !!! ( I hope you didn't hate it... )"
      },
      {
        "day": 10,
        "title": "Drawing Contest II",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "29/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "invite me to draw with you a video game caracter, I will suggest you some and you choose",
        "link": "",
        "hints": [],
        "answer": "funActivtivitiesCTF{dr4w1ng_t0g3th3r_1s_h34l1ng}",
        "reaction": "I am sure your drawing was better than mine, but I just did this for fun, hhh"
      },
      {
        "day": 11,
        "title": "safari enigma II",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "30/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Try to take a picture of the Moon (any shape is acceptable), I don't mind if it was already taken before, send it here in this link or to me, and I will reveal you the flag.",
        "link": "https://drive.google.com/drive/u/1/folders/1t7U66XbpG7NFYK0wcDoJULWMGgUsevsw",
        "hints": [],
        "answer": "SafariCTF{m00n_1s_br1ght_wh3n_f4c1ng_Sun}",
        "reaction": "You got it beautifully !!! masha'Allah"
      },
      {
        "day": 12,
        "title": "symbolic message",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "30/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "In today's enigma, I want you try to describe anything you wanna as a poem, LLMs are permissible as long they can describe what you need to write, met me see your masterpiece !!!",
        "link": "",
        "hints": [],
        "answer": "PoetCTF{w0rds_c4n_h4ve_d33p_m34n1ngs_^-^}",
        "reaction": "I am sure you made something harmonic and beautiful, hehe"
      },
      {
        "day": 13,
        "title": "Pokemon adventure III",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "30/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Do Rocks talk? well, ask Geodude, hhh. try to send me his Pokedex as a screenshot to me and the flag shall be yours",
        "link": "",
        "hints": [
          "Pause tha game > Pokedex > Search geodude > Screenshot his data",
          "Pokepedia is really a good website to search for where to find or catch any pokemon of any generation, google: geodude pokepedia, you will find Racaillou which is his name in french, go there and try to get used to how to web browse there"
        ],
        "answer": "PokemonCTF{th1s_p0k3m0n_1s_us3ful_4s_expl0ring_4ss1st}",
        "reaction": "pokedex++, yaaaaay"
      },
      {
        "day": 14,
        "title": "Gentle reminder II",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "30/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Go to this link to see the small task with flag reward",
        "link": "https://drive.google.com/drive/u/1/folders/1e9TOjELCfCVPGLyMMgu6NscF8NbwPlyw",
        "hints": [],
        "answer": "GentleReminderCTF{100_cl0s3r_st3p5_t0_f33l_m0re_bl3ss3d}",
        "reaction": "Llah ybarek, may nchllh rebbi bless your soul every day"
      },
      {
        "day": 15,
        "title": "Drawing Contest III",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "30/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "In this, let your mind be free to draw anything, you can try anything and let me know about the end result",
        "link": "",
        "hints": [],
        "answer": "funActivtivitiesCTF{fr33d0m_4s_4rt_1s_b34ut1ful}",
        "reaction": "I am sure it was a beautiful piece of art!!!"
      },
      {
        "day": 16,
        "title": "Uno Reverse",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "01/04/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Aight, I hate giving you instructions while I do nothing, so why not do the opposite, tell me anything to do as enigma or activity (infinity craft for example) and the flag shall be yours (you don't have to wait for me to get it)",
        "link": "",
        "hints": [],
        "answer": "universal enigma is about sharing experience betweeb us :3",
        "reaction": "Now you becoming closer and closer to become Master, hhh"
      },
      {
        "day": 17,
        "title": "safari enigma III",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "01/04/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I love clouds, you also do !!! They are gorgeaus and unique for each moment, try to find an orange cloud and show it to me",
        "link": "",
        "hints": [],
        "answer": "cloudCTF{beauty_of_nature_is_gorgeaus}",
        "reaction": "Sub7anallah, I am sure you felt happy when you saw it too, hhh"
      },
      {
        "day": 18,
        "title": "It's Bingo Time !!!",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "01/04/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Are you ready to challenge a bingo game with a moon shard? all knowledge you have is enough to try it and have fun !!! message me when you're ready!!!",
        "link": "",
        "hints": [],
        "answer": "BingoCTF{I_LOVE_BINGO}",
        "reaction": "AAAAAAA, I WAS EXCITED DOING THIS ONE, JDLCLQKDCLKN"
      },
      {
        "day": 19,
        "title": "Gentle reminder III",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "01/04/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Go to this Drive link to accomplish a simple task",
        "link": "https://drive.google.com/drive/u/1/folders/1C2UPn4txlfFeSDrdWo2XDGlKY-Sc_uUq",
        "hints": [],
        "answer": "GentleReminderCTF{each_letter_is_worth_more_than_diamond}",
        "reaction": "Masha'Allah, rebbi y7efdek nchllh, let me know what you have read for lore purposes, hhh"
      },
      {
        "day": 20,
        "title": "Scrrrrrrribble",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "01/04/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Do you know Skribble? ask me in insta to let you know and play together online!!!",
        "link": "",
        "hints": [],
        "answer": "SkribbleCTF{Always_fun_when_playing_with_friends}",
        "reaction": "I am sure you easily win many games in this, hhhh"
      },
      {
        "day": 21,
        "title": "Drawing Contest IV",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "02/04/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Welcome to another Drawing Enigma day !!! today's Drawing contest is : a pokemon !!!, any pokemon is accepted,any tool is allowed, good luck !!!",
        "link": "",
        "hints": [],
        "answer": "PokemonCTF{doudoudou_dididi}",
        "reaction": "everyone: who's that Pokemon ? Grandmas: ' IT'S PIKACHU ' DJCKZJDCZBJCBZK"
      },
      {
        "day": 22,
        "title": "core memory",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "02/04/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "do you still remember... pico park 2? do you mind... if we play a bit ? I can directly give you the flag if you already busy, don't worry, hhh",
        "link": "",
        "hints": [],
        "answer": "3460635",
        "reaction": "if we played or not, thanks again for bringing this memory with me when we played, hhh"
      },
      {
        "day": 23,
        "title": "safari enigma IV",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "02/04/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "as sky has many flavours and colors, do you have by any chance a sky colored as your favourite colour in your gallery? send it to me to witness its glory",
        "link": "",
        "hints": [],
        "answer": "PurpleCTF{Sky_Sky_so_Magestic_Wow}",
        "reaction": "Sub7anallah, I am sure you smiled when you took a picture there, hhh"
      },
      {
        "day": 24,
        "title": "Pokemon adventure IV",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "02/04/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I am thinking about a Pokemon that you need to catch, hmmm, how about something that looks like a bat? the name? Ah, I forgot :)",
        "link": "",
        "hints": [],
        "answer": "PokemonCTF{Zubat_is_actually_good_when_evolved_twice}",
        "reaction": "TO THE ROAD OF BEING CHAMPION, YATTAAAA"
      },
      {
        "day": 25,
        "title": "Uno reverse again ?",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "02/04/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Wllh I feel dreadful just giving you all these enigmas while I do nothing 😭😭😭, SO LET'S DO UNO EVERSE, REVENGE AND GIVE ME A HARD ENIGMA (if you don't know where to go, infinity craft have many hard words to craft...)",
        "link": "",
        "hints": [],
        "answer": "GuiltyCTF{YESSSS_I_FEEL_ALSO_THE_SAME_LJCLZJC}",
        "reaction": "I hope I did finish your chalenge, hhhh"
      },
      {
        "day": 26,
        "title": "Drawing Contest V",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "11/04/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Welcome to another Drawing Enigma day !!! today's Drawing contest is : Space, anything related to it !!! go and open your mind to it !! ( Bonus: you can invite me to help you :3)",
        "link": "",
        "hints": [],
        "answer": "SpaceCTF{so_full_of_darkness_but_full_of_wonders}",
        "reaction": "SPAAAACE, I LOVE SPACE, LJCLKZNCLKNLCNKZl"
      },
      {
        "day": 27,
        "title": "Gentle reminder IV",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "11/04/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Go to this Drive link to accomplish a simple task",
        "link": "https://drive.google.com/drive/folders/1q9EwXQKqndfYf1b1k1_Uz6w_5643nZIB",
        "hints": [],
        "answer": "GentleReminderCTF{small_act_can_change_everything}",
        "reaction": "you did good, rebbi y7efdek nchllh, precious one"
      },
      {
        "day": 28,
        "title": "safari enigma V",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "11/04/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Esi might have Some most desertic crappy places ever, but maybe there are moments and places where you can just enjoy the view right there, try to find a picture that fits this sentence",
        "link": "",
        "hints": [],
        "answer": "EsiCTF{Full_of_PTSD_yet_full_of_beauty}",
        "reaction": "In the end, we did enjoy some places in Esi, nature speaking of course, hhh"
      },
      {
        "day": 29,
        "title": "Pokemon adventure V",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "11/04/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I was shoked you can get Gyarados easily in Pokemon diamond, try to search how to get it and show me his pokedex as a proof",
        "link": "",
        "hints": [],
        "answer": "PokemonCTF{never_underestimate_unevolved_pokemon}",
        "reaction": "I remember I named him 'Kaido' on my game, hhhh"
      },
      {
        "day": 30,
        "title": "Good Night",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "As the sun sets, the call of duty of today rests away as people's minds calms away. It's time to make the night's prayer and prepare your body for the next day to eep well, say a good night as last thing to say for today to anyone and you can take the flag from this drive.",
        "link": "https://drive.google.com/drive/u/1/folders/1GyC04ByWh2bslcaqYHc1oyMWOAD8lMiF",
        "hints": [],
        "answer": "funActivtivitiesCTF{r3st_w3ll_4nd_g00d_n1ght}",
        "reaction": "Rest well, beautiful soul, may your nights be always blessed nchllh"
      }
    ]
  },
  {
    "month": 7,
    "solvedOne": false,
    "name": "July",
    "Theme": "Nature",
    "days": [
      {
        "day": 1,
        "title": "Power of Erosion",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "18/04/2025",
        "sYear": 0,
        "specialMess": "In this month, You will get to see many interesting Facts as Enigmas about anything related to Nature: Sky, forests, Seas, All of it !!! I hope you gonna learn some things and you would enjoy it",
        "enigma": "Have you ever asked why do rivers shape curvative paths ? they were actually initially a straight road. However, as Time goes by and the wind, Water eroses the land limits and makes the path more and more curvative, the more you know... hehe. The name of these paths do actually have a scientific name, try to find it!!!",
        "link": "",
        "hints": [
          "it starts with 'm' and ends with 'ing', also searching in web or LLM is allowed"
        ],
        "answer": "meandering",
        "reaction": "I hope you learned a new word today, hhh"
      },
      {
        "day": 2,
        "title": "Word Wide Wood",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "18/04/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Forest is way underappreciated than ever, it has many hidden layers of surreal facts and intellegence !!! For example, did you know that Trees in Forest can interconnect and communicate between each other ? Even an old tree would share its nutrients with a younger one with this network underground, IT'S SO AMAZING. This network is enabled thanks to some fungi ( sub synonym to mushrooms ) , try to find the name of this fungi",
        "link": "",
        "hints": [
          "it starts with 'm' and ends with with 'l', it's a pretty weird name"
        ],
        "answer": "mycorrhizal",
        "reaction": "Not all fungus are harmful, this one for example is so benefical to Forest ecosystem"
      },
      {
        "day": 3,
        "title": "The Seven wonders of the Seven I",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "18/04/2025",
        "sYear": 0,
        "specialMess": "Welcome to the Seven of the Sevens nature facts enigmas !!! These enigmas will present you 7 nature themes where each theme could be defined with 7 key words ( Seven of Sevens LOL ), hope you enjoy them, hhh ",
        "enigma": "Our Earth is divided by 7 massive landmasses/continents, Sub7annallah, Try to find the missing keyword: Africa, Europe, Asia, North America, South America, Oceania, ???",
        "link": "",
        "hints": [],
        "answer": "Antarctica",
        "reaction": "and the coldest one of them all!!! It's considered a continent due to its large landscale, it could even hide a real land without the ice"
      },
      {
        "day": 4,
        "title": "shiny creatures",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "18/04/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Just like sunshine, many different organisms can have the ability to emit light at night due to chemical reaction where it transforms chemical particals to light energy, try to name this phenomenon",
        "link": "",
        "hints": [
          "It's a mix of two words : Life and Light",
          "It starts with 'b' "
        ],
        "answer": "bioluminescence",
        "reaction": "But I guess for you, you don't need the chemical reaction to emit that light 24h/24, hhh"
      },
      {
        "day": 5,
        "title": "Colorful lights",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "18/04/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "In a particular time, in a particular place on Earth, Due to Sun rays hitting just barely exosphere, some beautiful colorful lights occurs and could be seen by human eyes. There may be a day nchllh we could also see it, cause I know you would absolutely love them. Anyways, what's this phenomenon called ?",
        "link": "",
        "hints": [
          "It has many, names, this one is only one word and starts and ends with 'a'"
        ],
        "answer": "Aurora",
        "reaction": "Or also Northern Lights, cause they only occur to extreme north Side of Earth ( Finland, Norway, Sweeden, Antartica, Greenland.... )"
      },
      {
        "day": 6,
        "title": "symbolic flowers I",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "19/04/2025",
        "sYear": 0,
        "specialMess": "This category of Enigmas would like to portray you as different flowers, all you have to do is trying to find their names",
        "enigma": "I am thinking of a really sensitive flower, with just a gasp of wind, it will fly away, it's round and white,it's also really light. they are seen as a symbol of hope, resilience, and transformation.",
        "link": "https://drive.google.com/drive/u/1/folders/1vkvSIwzK5h-qsooVPwVo-N4M624evsAC",
        "hints": [
          "I left a photo in the link button to see the actual flower"
        ],
        "answer": "dandelion",
        "reaction": "I do love these humble flowers, so fragile and yet so beautiful and resilient to keep oneself alive"
      },
      {
        "day": 7,
        "title": "Sun's happiest moment",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "19/04/2025",
        "sYear": 0,
        "specialMess": "Yeth, I admit I was smiling when I was doing this enigma, or maybe crying a little bit in my heart...",
        "enigma": "Did you know that Sun can wear a ring due to some special conditions ? there's no metaphor here by the way, hhh ( or maybe a little... ). Anyways, I can't explain it throughly with text, so I left an image for this phenomen, you should just try to find its name. Good luck !",
        "link": "https://drive.google.com/drive/u/1/folders/12aMgl7IpT_0UoGt-pl9Zhk9aDVXYegm2",
        "hints": [
          "if I was autistic, I would prounounce 'hello' in a weider way",
          "it's also a name of a popular game"
        ],
        "answer": "Halo",
        "reaction": "I also wanna give a ring to a particular Sun... I will keep praying for that nchllh, et nchllh rebbi ye7fedha"
      },
      {
        "day": 8,
        "title": "Electric Sensors",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "20/04/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "There's a really interesting creature that can sense electric changes on a flower ! Flowers emit weak electric fields, and when someone touches it,  it slightly alters that field. This means this creature knows if this flower have been visited or not, I wonder who is it ?",
        "link": "",
        "hints": [
          "You like Jazz ?"
        ],
        "answer": "Bee",
        "reaction": "Correct !! Cause Bees do need to know if her friend has already taken the pollen of that flower or not yet, Sub7anallah"
      },
      {
        "day": 9,
        "title": "The Seven wonders of the Seven II",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "20/04/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "One of the most famous Natural Wonder related to Seven is about the seven main colors of light fragmentation, aka. a raibow, try to find the missing color: Red, Orange, Yellow, Green, Blue, Indigo, ???",
        "link": "",
        "hints": [
          "maybe if you were confused why your first natural guess didn't work cause the color is not far away, try the french translation of your guess"
        ],
        "answer": "Violet",
        "reaction": "I owe you a Tacos and another ring if you tried to type 'purple' at first, hhh"
      },
      {
        "day": 10,
        "title": "Black hole in our solar system ?",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "19/04/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Sometimes, some sort of black hole could be seen in the sky by human eyes, but in reality, It's a temporal phenomenon caused by two celestial bodies for being perfectly aligned, what's the name of the phenomenon ?",
        "link": "",
        "hints": [],
        "answer": "Eclipse",
        "reaction": "When the moon meets the Sun, they merge as a one to make a golden ring dancing in the sky, how interesting... hhh"
      },
      {
        "day": 11,
        "title": "cursed volcanos",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "03/05/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Imagine instead a volcano erupts lava, it erupts water... boily water at a high speed!!! I wonder what is the name of those things erupting them",
        "link": "",
        "hints": [],
        "answer": "Geyser",
        "reaction": "I wanna sincerly travel just to see one, sub7anallah !"
      },
      {
        "day": 12,
        "title": "Unnatural animal",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "03/05/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "This creature seems out of this world... not only they have 3 hearts, but also the color of their blood is blue, they have a really high IQ in animal families",
        "link": "",
        "hints": [],
        "answer": "Octopuse",
        "reaction": "I would believe these creatures came from space..."
      },
      {
        "day": 13,
        "title": "The Seven wonders of the Seven III",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "03/05/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "If an Insect would evolve using metamorphosis, it would pass generally through 7 phases through her life: Egg ,???, Early Larval stage, Late Larval Stage, Pupal Stage , Emergence , Adult. Find the second missing phase",
        "link": "",
        "hints": [
          "To be fair, this seems more like a process rather than phase: to pass from Egg -> Larva, we pass through ??? process"
        ],
        "answer": "Hatchling",
        "reaction": "I think this enigma is bad, yeah, but I needed to complete my 7 of the sevens... sawry"
      },
      {
        "day": 14,
        "title": "symbolic flowers II",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "03/05/2025",
        "sYear": 0,
        "specialMess": "in memorial for this special day, Thanks for giving me the enlightment that this day 14/07 does exist, so even tho all flowers are special, today's flower is really special :3",
        "enigma": "This Flower symbolizes a long life and lasting happiness as it represents Sun itself (*cough *cough just like the one reading it, *cough *cough)",
        "link": "",
        "hints": [
          "seeing the title and the day number, isn't the answer a bit obvious ..."
        ],
        "answer": "Sunflower",
        "reaction": "Can I gift this to you on 14/07 on the day of our we-"
      },
      {
        "day": 15,
        "title": "Unfair Mountain",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "03/05/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "In some landscapes on mountains, sometimes they don't make the wind full of clouds pass through the other side, so what happens is that the other side will never get her fair ammount of rains, this would results having a mountain with two split biomes : one full of green and grass, and the other is desertic and harsh. This has a name as a natural phenomenon",
        "link": "",
        "hints": [
          "it consists of two words: one represents the need of the desertic side, the other is our pov to how we see it hidden from the treasure of Clouds"
        ],
        "answer": "Rain shadow",
        "reaction": "It now makes sense seeing some mountains half naked, hhh"
      },
      {
        "day": 16,
        "title": "The Seven wonders of the Seven IV",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "17/05/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": " There exists 7 natural wonders of the world, try to find the missing one: The Grand Canyon, The Great Barrier Reef, Mount Everest, ??? , Parícutin Volcano, Victoria Falls, Rio de Janeiro’s Harbor",
        "link": "",
        "hints": [],
        "answer": "Aurora Borealis",
        "reaction": "The Aurora one seems so beautiful !! Sub7anallah, hope we get see it one day in our life nchllh"
      },
      {
        "day": 17,
        "title": "Natural Harmony",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "17/05/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "You should have seen in your life at least once the migration of birds through the sky, did you see the beauriful waves and dance they make while traveling ? It has actually a name !!",
        "link": "",
        "hints": [],
        "answer": "Murmuration",
        "reaction": "I used to see them in my traveling to East, it's so magestic with the rise of the Sun !!!"
      },
      {
        "day": 18,
        "title": "symbolic flowers III",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "17/05/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "As timeless as their beauty, this flower stands as an important symbol of purity, grace, and the eternal cycle of life across cultures and generations. With their different variations of colors and their long petals, they could be distinguished from the longest distances",
        "link": "https://drive.google.com/drive/u/1/folders/1wo3cN07AT5GacwD1fN3n3OoeGeX-qnci",
        "hints": [
          "The name is pretty short, that it could be named to someone",
          "I left a photo of thei appearance in the link"
        ],
        "answer": "Lily",
        "reaction": "I think you already know how I am choosing the flowers from now... I hope, hhh"
      },
      {
        "day": 19,
        "title": "Glowing Fungi",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "17/05/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "Fungus are weird and so interesting as living creatures, there's a species that can glow greenish at night caused by Bioluminescence, can you guess what is the fungus name who has this property ?",
        "link": "",
        "hints": [],
        "answer": "foxfire",
        "reaction": "I may have fetish over fungus... Cause they have so much weird facts that makes our world special, hhh"
      },
      {
        "day": 20,
        "title": "Tree of the Giants",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "17/05/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Did you know that there exists some trees that scale up to 100m !!! one of the families is kind of contradictory where they do love Fire to keep them alive. Yup I said that correctly, they need this fire for their solid branches to make them vivid again",
        "link": "",
        "hints": [
          "The name is : 'giant ????????'",
          "Their popular habitat is in Sierra Nevada in California"
        ],
        "answer": "giant sequoias",
        "reaction": "*Insert SNK ost here ( Sorry I couldn't implement it... )"
      },
      {
        "day": 21,
        "title": "Flying cat software",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "17/05/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "This should be easy for you after all what I have been teasing you with this animal, hhh. this animal is a night predator that has rotationary head",
        "link": "",
        "hints": [
          "Owadi Chiamois may look like she has same software as this animal: curious, does love staying up late, kind to humans, hhh"
        ],
        "answer": "Owl",
        "reaction": "OwO UwU ^w^ -w- °w°,  these are your owl friends, say Hi to them !!"
      },
      {
        "day": 22,
        "title": "The Seven wonders of the Seven V",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "17/05/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "In some forgotten mythodology, Trees have been divided by seven important ones by their perspective: Ash, Hawthorn, ???,Birch, Hazel, Holly, and Rowan",
        "link": "",
        "hints": [],
        "answer": "Oak",
        "reaction": "Ummm, I don't know how to react here so I will just stay here awkwardly till the message goes..."
      },
      {
        "day": 23,
        "title": "symbolic flowers IV",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "17/05/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "It's the flower where it Made Japan the most famous country to visit in Spring, it has that surreal feeling when you get to see it. It symbolizes both life and death, beauty and violence. As the coming of spring promises new life, At the same time, their short lifespan is a reminder that life is fleeting.",
        "link": "",
        "hints": [
          "It is colored either by pink or white, I also know that you know it, hhh",
          "if you typed a japanese name, try to find the equivalent in English ( two words )"
        ],
        "answer": "Cherry Blossom",
        "reaction": "As Spring comes to end, Colors escape away to remind us that life is not always a spring, but we should enjoy the time when we have chance to experience it."
      },
      {
        "day": 24,
        "title": "The Seven wonders of the Seven VI",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "17/05/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Since Oldest Age, folks considered Seven principal Elements in Alchemy: ILTCMS?",
        "link": "",
        "hints": [
          "To make this Enigma interesting, I let compressed the elements in a way you can get the pattern",
          "The element left does also represent how you named your Heart accurately"
        ],
        "answer": "Gold",
        "reaction": "As shiny as the Sun, this gem was also a source for life in flourishing societies, but secretly a disease of greediness"
      },
      {
        "day": 25,
        "title": "Cure of Soul&Mind",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "17/05/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "Forest is an incredible biome, like imagine this: Did you know that forests does emit some chemical elements that cures Immunity system, neuron system and Endocrinien system of our body ? The forest is literally a medical cure for us !!! try to find that chemical element emmited to the air",
        "link": "",
        "hints": [
          "You should try to search about benefits of forests, you might see the flague there"
        ],
        "answer": "phytoncides",
        "reaction": "No wonder I named you green forest, this explains more, hhh (Also an effective one, Masha'Allah)"
      },
      {
        "day": 26,
        "title": "emotional animal",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "04/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Did you know that there exists an animal that mourns to death of his friends ? they can also remember those who befreinded them or can hold a grudge it it was hurt by them, they also protect their comrades when they are in danger",
        "link": "",
        "hints": [
          "This animal is one of the animals mentioned in Quran El-karim"
        ],
        "answer": "Elephant",
        "reaction": "Elephants holds also high memory capacity, I needed that when I was studying orga"
      },
      {
        "day": 27,
        "title": "natural time tracker",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "04/06/2025",
        "sYear": 0,
        "specialMess": "Trees are one of the most seriously underated creatures, if we just open a little but our eyes, we will realise how lively and beneficial are to our eyes.",
        "enigma": "Did you know that trees can track real time of daylight ? meaning they would know how long was the day for them, this is useful for them when they need to fall their leaves at autumn to prepare themselves before winter. Name this phenomenon that tracks time",
        "link": "",
        "hints": [],
        "answer": "abscission",
        "reaction": "one can just be a little aware to realise how much precise, concise, perfect our universe system, sub7anallah"
      },
      {
        "day": 28,
        "title": "symbolic flowers V",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "04/06/2025",
        "sYear": 0,
        "specialMess": "This comes the end for all Symbolic flowers challenges, I choosed those that made me the most remind of your personality and purity, hope you did enjoy them!!!",
        "enigma": "This last flower should be easy for you. A literal representation of purple beauty, purity, silence, devotion, serenity, grace, and calmness. But most important aspect is how a plain of these flowers taint the land with a truly memerizing view",
        "link": "",
        "hints": [],
        "answer": "Lavender",
        "reaction": "this last flower should be your true symbolic flower if I choosed one, hhh"
      },
      {
        "day": 29,
        "title": "tongue feets ?",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "04/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I am imagining a creature that roams around and fly to taste with its feets... yes, that's not irony, it's purely facts.",
        "link": "",
        "hints": [
          "It's an insect",
          "her favourite landing places are flowers to taste them and nourishes itself"
        ],
        "answer": "Butterfly",
        "reaction": "Even The smallest things holds the most interesting secrets, Sub7anallah"
      },
      {
        "day": 30,
        "title": "The Seven wonders of the Seven VII",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "04/06/2025",
        "sYear": 0,
        "specialMess": "Alas, this is the end of Seven wonders of 7, hope you enjoyed the combo of double Seven = 14 :3",
        "enigma": "the most consistent 7 phases ever existed in history always held itself on the clear sky: New Moon, Waxing Crescent, First Quarter, Waxing Gibbous, ??? , Waning Gibbous, Third Quarter, Waning Crescent.",
        "link": "",
        "hints": [],
        "answer": "Full Moon",
        "reaction": "It is always a blessing to see the different phases of moon on pure dark night sky"
      },
      {
        "day": 31,
        "title": "A cure from Fungi",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "04/06/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "As I said before, Fungus are weird, small, interesting creatures that make you so curious or even wonder if these things are originated from Earth. One of them is the origin of an important medecin that is an antibiotic against bacterian infections: Penicillin. What fungi is responsible fot this ?",
        "link": "",
        "hints": [
          "The medical name is a hint by itself"
        ],
        "answer": "Penicillium",
        "reaction": "yup, you did wonderfully in this month !!! hope you enjoyed these small facts nchllh"
      }
    ]
  },
  {
    "month": 8,
    "solvedOne": false,
    "name": "August",
    "Theme": "Cryptography II",
    "days": [
      {
        "day": 1,
        "title": "Bill's Book",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "09/06/2025",
        "sYear": 2025,
        "specialMess": "Welcome to the second volume of Cryptography, you will find the weirdest and intriguing encryptions in our world, There are secrets way more deeper and more frequent than you think...",
        "enigma": "Do you remember any show that has intrigued you with their secrets ? That they went even further by creating their own secrel language to communicate with their fans for a real hidden treasure related to their show ? You czn try to guess the name of the show, and I have left its name in hints. Go to link and try to decipher the code",
        "link": "https://drive.google.com/drive/u/1/folders/1INtEmdie3HvoSlNO3GfohijrJHVvFwzV",
        "hints": [
          "Name of show: Gravity Falls :3"
        ],
        "answer": "WELCOMETOCRYPTOWORLD",
        "reaction": "This is the only beginning of the mysteries, hehe"
      },
      {
        "day": 2,
        "title": "The numbers Beal, WHAT DO THEY MEAN ?",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "09/06/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "75, 866, 347, 1292, 117, 1275, 607, 438, 493, 1165, 1279. Key is a text, the text is about unforgettable history",
        "link": "",
        "hints": [
          "this is book cipher that firstlt used by Beal, analysts took many years to understand how his cipher worked, he was linking the numbers with words of his book",
          "I didn't use any book, I used my proper text that you already read and came from my heart"
        ],
        "answer": "SECRETHEART",
        "reaction": "1088, 981, 65, 1177, 964, 1006, 665, 323, 896, 738, 308, 397, 506, 688, 1143, 930, 533, 62, X, 693, 1094, 955, 1139, 35, 119, 875, 509, 792, 940, 28, 76, 1252, 532, 730, 119, 168, 936, 770, 737, 673, 92"
      },
      {
        "day": 3,
        "title": "A world of abstraction",
        "difficulty": "Really Hard",
        "solved": false,
        "cDay": "09/06/2025",
        "sYear": 0,
        "specialMess": "All right... here's the serious part, in this month chapter, you will gonna find out about the deepest ways how to hide secrets through natural abstraction: Atypography. I will give you 12 of them that are all really fun to decipher when taking your time to concentrate, I know you can do it!! In Atypographie, I will always a generous hint that will really help you if your head started burning, hhh",
        "enigma": "Go to the link, a (message?) is waiting to be decrypted...",
        "link": "https://drive.google.com/drive/u/1/folders/1o57ObKJxs57GAxhbgGSHGrkgEBHH73VR",
        "hints": [],
        "answer": "ATYPOGRAPHY",
        "reaction": "Wow... you're amazing !!! Masha'Allah"
      },
      {
        "day": 4,
        "title": "Unintuitive reading",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "09/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "My friend spilled his coffee on his keyboard, now when he send me text, it's not readable, but when I show it to him, he confirms that I have the ability to extract his message, how ?",
        "link": "https://drive.google.com/drive/u/1/folders/1lBtsiGZuPAxomBUF7_ISba2oHv7G1utl",
        "hints": [
          "Do you know japanese people have two ways on how to write their text",
          "Did you read that 'C T F' how was written ?"
        ],
        "answer": "SecretCTF{sn34ky_c01umn}",
        "reaction": "Your eyes are worth diamonds to be able to read all what have been challenged to you so far, hhh"
      },
      {
        "day": 5,
        "title": "Abstracted wavelengths",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "09/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Have you ever wondered if you can send message with only straight lines ? Go to the link, a (message?) is waiting to be decrypted...",
        "link": "https://drive.google.com/drive/u/1/folders/1vC_t1fEcwPoumIcDUJVHkzhZNmygM9u6",
        "hints": [],
        "answer": "silver apples",
        "reaction": "you did it !!!!! JCKJCKJNCKJNCK"
      },
      {
        "day": 6,
        "title": "Sneaky Characters",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "09/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Oh No! my coffee got spilled on my computer, now my keyboard starts talking about nature and all but the flag is still existing there, howwww?",
        "link": "https://drive.google.com/drive/u/1/folders/1SjD8lycrJFrcf0n293qPyBPGMX3qxeqQ",
        "hints": [
          "anything particular on that text ? some unusual cases ?",
          "where are upper cases ?"
        ],
        "answer": "SECRETCTF{EAGLEEYES}",
        "reaction": "yOU hAve Done amazIngly CHArmIngly MArvelous !!!"
      },
      {
        "day": 7,
        "title": "Abstracted pillars",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "09/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Reading vertically has never been this easi- ( go to link to understand )",
        "link": "https://drive.google.com/drive/u/1/folders/1yCcPu8htiGsrwxWbImOVYSQrKv52dwoW",
        "hints": [],
        "answer": "INCreDIBLEBOB",
        "reaction": "CONTInUE Like THIS, LZXJZJZJZB"
      },
      {
        "day": 8,
        "title": "Hidden 4th mystery: Kryptos",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "09/06/2025",
        "sYear": 0,
        "specialMess": "well, this isn't exactly a challenge, but rather a knowledge I want you to know because Kryptos is one of the unsolved crypted message that ever existed",
        "enigma": "give me the final word decrypted of first section of Kryptos: EMUFPHZLRFAXYUSDJKZLDKRNSHGNFIVJYQTQUXQBQVYUVLLTREVJYQTMKYRDMFDVFPJUDEEHZWETZYVGWHKK?",
        "link": "",
        "hints": [
          "Search or ask chatgpt about Kryptos mystery"
        ],
        "answer": "IQLUSION",
        "reaction": "4th section is till now haven't been yet solved"
      },
      {
        "day": 9,
        "title": "Time spelling words",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "09/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "each daytime you witness has a unique word of 5 letters , find them out and your flag will be revealed: 09/05/2022b_26/01/2025_08/03/2022_26/09/2023_27/10/2023",
        "link": "",
        "hints": [
          "a word with 5 letters for each day, hmmm... doesn't that look familiar ?",
          "Have you ever heard of wordle ?"
        ],
        "answer": "SHINE_SUNNY_SWEET_LOYAL_NOBLE",
        "reaction": "Did you know these words describe the rea- ( and I am sincere in my perspective, hhh )"
      },
      {
        "day": 10,
        "title": "Horizontal abstraction",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "09/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Some lines could be seen as normal decorative lines, but... some could hide a secret within",
        "link": "https://drive.google.com/drive/u/1/folders/10akJXgMCVTxuTx5nhmKvEreJxWC6lsWV",
        "hints": [],
        "answer": "PEACEMAKERS",
        "reaction": "Many secrets are way hidden around you than you think..."
      },
      {
        "day": 11,
        "title": "Mysterious killer",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "10/06/2025",
        "sYear": 0,
        "specialMess": "There existed in history a real person that challenged the world for declaring every single target he would kill in encrypted way, but nobody would be able to solve it till really lately",
        "enigma": "mysterious letter was left on a crime scene, you are a detective who should find the location of the next target before so late",
        "link": "https://drive.google.com/drive/u/1/folders/1z9Q6y01NKuLvwdwxmxLLRrjjONYmbLGG",
        "hints": [
          "the name given to this killer is 'Zodiac Killer'"
        ],
        "answer": "Okinawa",
        "reaction": "Oh great, I may have annoyed hime a bit so much about Silksong..."
      },
      {
        "day": 12,
        "title": "Enigma in Pokemon",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "10/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Did you know even the Pokemon game has its own enigmas and mysteries, yup... decrypt the message and extract the flag with MD5",
        "link": "https://drive.google.com/drive/u/1/folders/1qnOlJkGxVHp4EnH7NjT6iw-SpE3y-1pH",
        "hints": [
          "what an unown mystery"
        ],
        "answer": "b387e5017f514a770d03945c9b4e6ee3",
        "reaction": "and they say why our generation is autistic while we have to experience this on our childhood, hhh"
      },
      {
        "day": 13,
        "title": "Abstracted dots",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "10/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "here's some geometrical shapes, nothing particular...",
        "link": "https://drive.google.com/drive/u/1/folders/1rbkZudYVqPEHiwns_iA3f9cd8wpPuzc6",
        "hints": [],
        "answer": "SVEMIrKO",
        "reaction": "The squares CAN SPEAK ???"
      },
      {
        "day": 14,
        "title": "A particular portrait",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "10/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Look at this interesting painting, I wonder what was the autistic painter thinking doing that",
        "link": "https://drive.google.com/drive/u/1/folders/1ueHqHA9--ldFTNyYxAltX_U-AY62BD3p",
        "hints": [
          "doesn't that bring you nostalgia about a particular enigma in the old days, hhh"
        ],
        "answer": "CryptoCTF{c0l0r_s3cr3ts}",
        "reaction": "your favourite color is R+B = P , my favourite color is O + C = Bright light, hehe"
      },
      {
        "day": 15,
        "title": "Abstracted apartement",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "10/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "can apartements speak ? it might be just my imagination...",
        "link": "https://drive.google.com/drive/u/1/folders/1lbXvM7b7uu9wvgGM2bato-zO0SKj31Fb",
        "hints": [],
        "answer": "SviZAJEdNO",
        "reaction": "what language is this ???"
      },
      {
        "day": 16,
        "title": "Spaghetti encryption",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "10/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Ceasar(14 , Ascii85(ROT13(ROT47(Reverse(Ceasar(10 , Vigenaire('sunshine' , Ascii85(Ceasar(7 , flag))))))))) was leaked down this link",
        "link": "https://drive.google.com/drive/u/1/folders/1apxc1O7pb-9GeQHXwVsy4MTdv74Mr46Y",
        "hints": [],
        "answer": "cd3ba48c3a2c09091b1d55e6fb1dbbd7",
        "reaction": "And that was your last easy challenge in this month :3"
      },
      {
        "day": 17,
        "title": "Haunted manuscript",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "10/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "You are an archeologist, you were given an ancient writting that needs to be decrypted before 24h, we count on you!!!",
        "link": "https://drive.google.com/drive/u/1/folders/104aTLktvh64rDMa6azn_woyls7ZTyG6T",
        "hints": [
          "you need some 'copi'um to read this code",
          "this tastes some philipinian writing"
        ],
        "answer": "SHIAWASENA TSUKI",
        "reaction": "a happy sun gives out always a bright happy moon, hehe"
      },
      {
        "day": 18,
        "title": "Game on the street",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "10/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I visited some capital of a country, and I found these dots on road, I just told myseld some children were just playing, right?.... RIGHT?",
        "link": "https://drive.google.com/drive/u/1/folders/1w-YgFo_5KZ_ldGTHERvmS-tbXEjC7Hs3",
        "hints": [
          "could it be related to the name of a capital"
        ],
        "answer": "BERLIN",
        "reaction": "you start getting use of atypography, I can feel it!!!"
      },
      {
        "day": 19,
        "title": "you know what you don't know",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "10/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "what if nothing is given, what if the answer is already known, what if the concept of this Enigma is enough to know the answer",
        "link": "",
        "hints": [
          "Daily Enigma concept is easy, each day is unique flavored challenge, every single day",
          "nothing was given, but you already know something about today",
          "only the answer makes sense for just today"
        ],
        "answer": "19/08",
        "reaction": "yeah I admit, I ran out of creativity when doing this, hhh"
      },
      {
        "day": 20,
        "title": "Just a decoration on a Tapis",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "10/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "what a delequant decoration on that carpet...",
        "link": "https://drive.google.com/drive/u/1/folders/1mhcIXthfi5jVRTKyheiCm_LMi3QubIw3",
        "hints": [],
        "answer": "TELEVISION",
        "reaction": "don't ask me why the artist decided to put this cipher on a carpet..."
      },
      {
        "day": 21,
        "title": "Counting numbers",
        "difficulty": "-2.1-12.2.21-2",
        "solved": false,
        "cDay": "11/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": ".2.211/-112-3.21/.111.1.11-12/-1.4.2.3-222/-112-3.21/-12.2-12/-21.111.1.11-1/.13-3-13/.211.2-11-12.2-11-21/-3.21-1/-1.4.1/.3.1-1111.111.1-1/-3.21-1/-3.211/.2-1/.121.111-3.31.2-11-21/-112-3.21.111/.121.11.3.3.2-3-11.11-11-1111.1/-3.31.1.111/-1.4.1/-12.1-1.11.2.112.3-222/.2/.12.2.112.112/.11.112.12.11-112.3/-13.1/-21.111.11-1.1.211.21.112/.211-3.111/-1.4.11-1-222/-1.4.11-11-111/-112-3.21/.3-3/.3-3/-2.21-1111.4/.12.2-1.4/-1.4.1/.3.2-22.1/-3.211/.21-11.2.31.1.111.3.1/.211-3.111/.3-1.2.112.112/.3.21.121.121-3.111-1.2-11-21/-1.4.1.3.1/.1-11.2-21-2.11.3/.12.2-1.4/-112-3.21.111/.1-121.2.3-1.11-11-1111.1-222/.2/.111.1.11.112.112-112/.11.121.121.111.1-1111.2.11-1.1/-1.4.2.3.111111/.211.112.11-21-33/-12.14.41-2-5-11-12.5-5.21.14",
        "link": "",
        "hints": [
          ". - / where have I seen those special characters ?",
          "if special characters needed to be shown, it was for what purpose ?"
        ],
        "answer": "D14m0nd50u1",
        "reaction": "no way you did it!!!! AAJZJDZJNDKZjn, I am so so proud of you!!!"
      },
      {
        "day": 22,
        "title": "Dance of the Cs",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "11/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "a particular encryption was found on today's office, you are a detective that needs to decrypt this before 24h",
        "link": "https://drive.google.com/drive/u/1/folders/10k45SMz58_0FLibFT617uwQqryEI8-WY",
        "hints": [
          "this is a real encryption found on a letter, maybe you should ask Dora ?"
        ],
        "answer": "Mayonaise",
        "reaction": "I was hungry when doing this enigma, don't judge me..."
      },
      {
        "day": 23,
        "title": "Abstracted sticks",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "11/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "you found a weird stick, is it a secret message, maybe a wand ? or just a natural stick",
        "link": "https://drive.google.com/drive/u/1/folders/1_Qk8BXazuSbIh_k_tBDQntJEty6ppC5-",
        "hints": [],
        "answer": "Owadi",
        "reaction": "I should take care of this stick, it seems precious to me"
      },
      {
        "day": 24,
        "title": "weird characters",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "11/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Oh no, coffee just got spilled on my calculator, now I can't type any number: à((ç -ç (& _à",
        "link": "",
        "hints": [
          "my keyboard is a french Azerty"
        ],
        "answer": "0559 69 51 80",
        "reaction": "hmmn what a weird number :3"
      },
      {
        "day": 25,
        "title": "Abstracted wall",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "11/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I was in a bathroom and I found some scratches on wall, meh, just some cracks... or IS IT???",
        "link": "https://drive.google.com/drive/u/1/folders/1yIbrQImN3BCWo0V3c8U1j9MxE8JVpJ-p",
        "hints": [],
        "answer": "stateofplay",
        "reaction": "YOU ROCKING IT !!!"
      },
      {
        "day": 26,
        "title": "Tricky transposition",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "11/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Oh No !!! A camel came from Sahara and pushed me and spilled my coffee on my PC, now my keyboard can ony speak in Arabic: ؤقغحفخؤفب¤ضقضلاهؤ_سعحقثكضؤغ",
        "link": "",
        "hints": [],
        "answer": "cryptoctf{arabic_supremacy}",
        "reaction": "!!! رائع"
      },
      {
        "day": 27,
        "title": "Minimised writing",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "11/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "The writing you will see soon is a kind of encryption but it simply simplifies the design of each character ",
        "link": "https://drive.google.com/drive/u/1/folders/1EFO54NSqASlO1Yex9rFuzAUuWaXLAEVN",
        "hints": [
          "Elian might assist you"
        ],
        "answer": "pure soul",
        "reaction": "and thus, cinammonRoll was the best king ever existed"
      },
      {
        "day": 28,
        "title": "Abstracted circles",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "11/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "As you almost reaching the end of atypography, this challenge won't give you a dictionary as a hint, cause most important thing is the intuition to understand the abstraction, good luck :3",
        "link": "https://drive.google.com/drive/u/1/folders/1I_rs2yikR2Uz3ZL7vLiarq9tQaLK-gSg",
        "hints": [],
        "answer": "NASELJE",
        "reaction": "See ? you starting to adapt atypography, hhh, nice, Masha'Allah"
      },
      {
        "day": 29,
        "title": "bytes of a mysterious language",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "11/06/2025",
        "sYear": 0,
        "specialMess": "you can take today's Enigma as a fun fact",
        "enigma": "e697a5 e69cac e8aa9e e381ae 415343 4949e3 8292e6 9a97e5 8fb7e5 8c96e3 8199e3 828be3 819fe3 8281e3 81ab33 e38390 e382a4 e38388 e3818c e5bf85 e8a681 e381a7 e38199 e38081 e69cac e5bd93 e381ab e88888 e591b3 e6b7b1 e38184 e381a7 e38199 e38081 e69797 e381af e38193 e381ae e8a880 e8aa9e e381ae e59bbd e381a7 e38199",
        "link": "",
        "hints": [],
        "answer": "Japan",
        "reaction": "you realise also that their first byte is also particular, staring with e"
      },
      {
        "day": 30,
        "title": "Astronomical abstraction",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "11/06/2025",
        "sYear": 0,
        "specialMess": "this is the last atypography enigma, I know some of them were unfairly hard, but I did it cause I think it's fun to put time on perceiving our surroundings and realising some things aren't coincidence, I hope after this month, you can now observe our environment with more precision, and most importantly, I hope you did have fun !",
        "enigma": "I wonder if I can write something that reminds us with universe and solar system",
        "link": "https://drive.google.com/drive/u/1/folders/18Xmlxmu-zmhoE5jYy2u5BvtYRspU67FD",
        "hints": [],
        "answer": "ECLIPSE",
        "reaction": "Thank you again for making these challenges yet alive again after their long slumber"
      },
      {
        "day": 31,
        "title": "the war machine: Enigma",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "11/06/2025",
        "sYear": 0,
        "specialMess": "Ahhh yes, the E word, I wanted to finish this month with the most symbolic and inspiring encryption that both of us had knowledge about it, it was nostalgic and beautiful moment for both of us, hope you enjoy my last autistic story to tell",
        "enigma": "As a second commander under the wing of higher admiral 'CinammonRoll the Pillar of North', we are in a war against Oscar's Soldiers, we keep intercepting their commander's letters but couldn't crack them at all, till the last one when we got an Intel about some machine configuration : 'Pick the rotors G43TE=== , the reflector is gonna be q%wx} , Based on small scale, ROTate carefully with high degree. The position of rings is our international Inigma day, the position of rotors is -1111.11-1'. I need to find their next attack as quick as possible",
        "link": "https://drive.google.com/drive/u/1/folders/1u6cmDOp6uINYM7D4oKWcLYfHhJSlssQ6",
        "hints": [],
        "answer": "Peach's castle",
        "reaction": "I need to announce this alerting attack quickly, the war will finally shift to our side !!!"
      }
    ]
  },
  {
    "month": 9,
    "solvedOne": true,
    "name": "September",
    "Theme": "Cats",
    "days": [
      {
        "day": 1,
        "title": "Favourite cat",
        "difficulty": "Easy",
        "solved": true,
        "cDay": "11/07/2025",
        "sYear": 2025,
        "specialMess": "Who would have thought there would be cats related to this journey? hhh. A moon without the Sun or cats is a mere floating rock. PS: It seems this is your first time trying my daily Quest. Basically, each day has a unique Enigma, and for each solve you do on a day, you retrieve its shard of the moon :3",
        "enigma": "Name me the cat of decade for me when I was studying in ESI (just in case you reading this after graduation, hhh). the cat was so lovely that you adopted him as your son",
        "link": "",
        "hints": [
          "it's colorful, sometimes sends me angry jealousy towards me...."
        ],
        "answer": "Niwa",
        "reaction": "Niiiiiwaaaa, I do really wanna own him as our cat ( yes, I said 'our', not 'my'), hhh"
      },
      {
        "day": 2,
        "title": "Medecine to humans",
        "difficulty": "Easy",
        "solved": true,
        "cDay": "11/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "Cats are not just creatures that entertain humans, it's more than that. Cats have an effect that if they do it, they lower blood pressure and stress and heals humans besides it. what is this cure that cats posess to make the effects  happen? ",
        "link": "",
        "hints": [
          "It's more effective if you hug your cat while he's making this cure",
          "if there's ambiguity, it ends with suffix 'ing'"
        ],
        "answer": "purring",
        "reaction": "if you get to witness this ability every day, I am sure your health will stay intact inchallah, hhh"
      },
      {
        "day": 3,
        "title": "Cat families I",
        "difficulty": "Medium",
        "solved": true,
        "cDay": "11/07/2025",
        "sYear": 2025,
        "specialMess": "Welcome to cat families Category !!! there are 10 shards you can collect in this month by only guessing what breed is a cat by only seeing their photos. I am sure you will also gain experince for some breeds how are they named!!!",
        "enigma": "Go to the link, analyse the photos of cats that shares the same breed name.",
        "link": "https://drive.google.com/drive/u/1/folders/1hGdXyt3e3IzLl_z24xje12pXotYoh5I4",
        "hints": [
          "this one has two words, first one is related to its region origin"
        ],
        "answer": "Thai Siamese",
        "reaction": "'they are known for their loyal and affectionate nature' - quote"
      },
      {
        "day": 4,
        "title": "Company with a loner",
        "difficulty": "Easy",
        "solved": true,
        "cDay": "11/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "back in the first years of ESI, I usually go back alone to home on first half road, then I wait for someone to pick me up. While I am waiting, I usually find cats wait with me or even play, hhh, I shared one of the photos on the Link. what is the place that this photo taken where I usually wait",
        "link": "https://drive.google.com/drive/u/1/folders/1UZpIn-RtYzeSm3dTHnTpC_78HNl2-2sI",
        "hints": [
          "I usually use Metro to go to the checkpoint"
        ],
        "answer": "Ruisseau",
        "reaction": "thanks to them I can pass time without feeling lonely, El7emdoulillah"
      },
      {
        "day": 5,
        "title": "Auth of cats",
        "difficulty": "Easy",
        "solved": true,
        "cDay": "11/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "I wonder if there is a part on cats that can authentificate uniquely that cat from others",
        "link": "",
        "hints": [
          "boop"
        ],
        "answer": "nose",
        "reaction": "Not only they have cute nose, but it's unique to that cat, Sub7anallah"
      },
      {
        "day": 6,
        "title": "Cat families II",
        "difficulty": "Medium",
        "solved": true,
        "cDay": "11/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "They have sharp long ears, with a body that seems fragile with small ammount of fur, sometimes their face gets memeable",
        "link": "https://drive.google.com/drive/u/1/folders/1h922yyBxAS4CJuZuItmiEf3zDm5fgEaF",
        "hints": [
          "their face looks like a T-'Rex'"
        ],
        "answer": "Cornish Rex",
        "reaction": "they seem old that needs support all the time, I love them!!!"
      },
      {
        "day": 7,
        "title": "Cat of wisdom and annoyance",
        "difficulty": "Medium",
        "solved": true,
        "cDay": "11/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "There was a cat I witnessed in ESI that may have annoyed me. Using your telepathy and mouktassabate l9eblya, try to guess what did this Cat of Wisdom and annoyance sitted on to use as a throne",
        "link": "",
        "hints": [
          "he was known to you, same also for the silly story",
          "I couldn't go studying because of his wise mind"
        ],
        "answer": "backpack",
        "reaction": "yeah anyways, he seemed kind enough to let me take it, hhh"
      },
      {
        "day": 8,
        "title": "Historical record",
        "difficulty": "Easy",
        "solved": true,
        "cDay": "11/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "today's is a honorification for a cat that aged the most historically, name this cat",
        "link": "",
        "hints": [],
        "answer": "Creme Puff",
        "reaction": "38 years... this is insane, sub7anallah"
      },
      {
        "day": 9,
        "title": "Cat families III",
        "difficulty": "Medium",
        "solved": true,
        "cDay": "11/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "They have the funniest looking face with wide cheeks that are so cute",
        "link": "https://drive.google.com/drive/u/1/folders/1Ha7z_Px2hNwfaSL1fBEvx8KQ6kzLcwIR",
        "hints": [
          "two words, second one is characteristic about thei fur"
        ],
        "answer": "Exotic Shorthair",
        "reaction": "look at their face, I wanna see them whole day, hhh"
      },
      {
        "day": 10,
        "title": "First time",
        "difficulty": "Easy",
        "solved": true,
        "cDay": "11/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "In this photo, you are witnessing my first time ever a cat sitted on my laps, the feeling was unforgettable for me. Name the place I were in",
        "link": "https://drive.google.com/drive/u/1/folders/17fh2MFdqiD0yxnAfFj9qe8y9LW75MHTe",
        "hints": [
          "my bare feet might already gave you answer, hhh"
        ],
        "answer": "mosque",
        "reaction": "he just came and sitted on me, did I finally converged to your magnet skill..."
      },
      {
        "day": 11,
        "title": "tricky manipulation",
        "difficulty": "Easy",
        "solved": true,
        "cDay": "12/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "Cats do hide a secret weapon, with it they can manipulate their prey's mind so they become friendly to the cat, it was even seen sometimes mouses play with Cat as if it's a norm. It's kind of a parasite thet even humans can get infected with it but with no serious effects",
        "link": "",
        "hints": [],
        "answer": "Toxoplasma gondii",
        "reaction": "I wonder if we are already manupilated by a cat now, hhh"
      },
      {
        "day": 12,
        "title": "Cat families IV",
        "difficulty": "Medium",
        "solved": true,
        "cDay": "12/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "their coat is filled with dotted patterns, usually their color is dark or grey, they have almost a round face",
        "link": "https://drive.google.com/drive/u/1/folders/1Fqh18lKBMazOy2ScHcuHz5PIu_aE3dNg",
        "hints": [
          "this one has two words, first one is related to its region origin",
          "the second word sounds like meow :3, hhh"
        ],
        "answer": "Egyptian Mau",
        "reaction": "theyr are pretty common in Cat families"
      },
      {
        "day": 13,
        "title": "memorial day",
        "difficulty": "...",
        "solved": true,
        "cDay": "12/07/2025",
        "sYear": 2025,
        "specialMess": "because this month is related to cats, and you are one of a kind that has deep affection to these cute innocent creatures. I wanna comemorate in this day all the lost kitties, abused cats, abondoned ones that have lost their lives in an unfair way. I wanna also highlight in this day a particular kitty",
        "enigma": "there was a kitty you cared for and took care of him just like a mother. Due to some unfortunate events, he didn't live much to see how much he grew and see her mom with her established family, but he finished his last minutes with warmness and food hopefully. Write the day DD/MM/YYYY you met this little soul that left us early.",
        "link": "",
        "hints": [],
        "answer": "13/04/2025",
        "reaction": "I am sure he is now in a pleasant place seeing us afar, and I am sure you got a beautiful Jaza2 for your genuine kindness"
      },
      {
        "day": 14,
        "title": "Sister of meow",
        "difficulty": "Easy",
        "solved": true,
        "cDay": "12/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "when we pspspsps, we generally wanna  hear 'meow' as a reaction, but did you know in some region, people pronounce meow differently",
        "link": "",
        "hints": [
          "in a land where we both dream to visit"
        ],
        "answer": "Nya",
        "reaction": "wonder how they did came out with this..."
      },
      {
        "day": 15,
        "title": "Cat families V",
        "difficulty": "Easy",
        "solved": true,
        "cDay": "12/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "One of the most common looking cats seen in the world, with sharp black line patterns on their whole body",
        "link": "https://drive.google.com/drive/u/1/folders/17jas_k_V3-lF2GrVpSvmkwiVl3FHo9hm",
        "hints": [
          "named after a known corresponding felin"
        ],
        "answer": "Toyger",
        "reaction": "they might have installed Tiger's Hardware, but their software is always of a cat"
      },
      {
        "day": 16,
        "title": "How many",
        "difficulty": "Easy",
        "solved": true,
        "cDay": "12/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "in my timeline, it's 12/07/2025, back in that time, we were having if you remember mother cat with some kitties besides our home residing, how many cats were there based on what I told you",
        "link": "",
        "hints": [
          "Use either telepathy or Insta search chat skill of yours, hhh"
        ],
        "answer": "3",
        "reaction": "the two kitties are growing healthy, hope the same in your timeline"
      },
      {
        "day": 17,
        "title": "Most Cat looking Pokemon",
        "difficulty": "Easy",
        "solved": true,
        "cDay": "12/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "State the name of the Pokemon that is the most cat looking, I have even a mug of it that I shared it with you if you remember lol",
        "link": "",
        "hints": [
          "an iconic character in Pokemon anime"
        ],
        "answer": "Meowth",
        "reaction": "he even has the OwO"
      },
      {
        "day": 18,
        "title": "Cat families VI",
        "difficulty": "Medium",
        "solved": true,
        "cDay": "12/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "they gained their name thanks to their special ears look",
        "link": "https://drive.google.com/drive/u/1/folders/18CLw7ViuCA5E_RCkq7ePQT-H5vZlYTyW",
        "hints": [
          "this one has two words, first one is related to its region origin"
        ],
        "answer": "Scottish Fold",
        "reaction": "I wanna touch their ears to study its physics lol"
      },
      {
        "day": 19,
        "title": "The council will decide",
        "difficulty": "Easy",
        "solved": true,
        "cDay": "12/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "so I have not so old nor not so recent photo of interesting cats laying close to each other like guardians, I just wanna show it to you, hhh. Guess the year that this photo was taken",
        "link": "https://drive.google.com/drive/u/1/folders/1gu2-TlimJA_zUKrYNGEswhq0PlO60Hgs",
        "hints": [
          "based on the land and texture, you should already know the location, yapping also happened about it once"
        ],
        "answer": "2022",
        "reaction": "it was a time I was roaming alone in Esi, haha...ha.ha..."
      },
      {
        "day": 20,
        "title": "I died...BUT I LIVED",
        "difficulty": "Medium",
        "solved": true,
        "cDay": "12/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "A historical cat theorically died and lived at the same time, name its owner",
        "link": "",
        "hints": [
          "it was about Quantum theory of electrons",
          "the german characters like ö might be needed"
        ],
        "answer": "Schrödinger",
        "reaction": "so if I don't see outside ,it's peaceful and apocalypse at the same time... (my ADHD anxiety be like)"
      },
      {
        "day": 21,
        "title": "Cat families VII",
        "difficulty": "Medium",
        "solved": true,
        "cDay": "13/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "This breed of cats is known for their extreme intellegence and loyalty to house owner, usually white coated and irises of different colors!!!",
        "link": "https://drive.google.com/drive/u/1/folders/1c5B7ldfHI3ONhhhTaAGyMrRIfRkCYeb_",
        "hints": [
          "this one has two words, first one is related to its region origin"
        ],
        "answer": "Turkish Angora",
        "reaction": "this one seems way so noble to be just called a cat, hhh"
      },
      {
        "day": 22,
        "title": "Young visitors",
        "difficulty": "Hard",
        "solved": true,
        "cDay": "13/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "Can you guess the date time that this photo from the link was taken in DD/MM/YYYY ? same time three kittens visited CACE",
        "link": "https://drive.google.com/drive/folders/1_2f1ZUjc6xmzclY3CHQkI-hkZyuI7pzN",
        "hints": [
          "You named one of them Tiger if I remember, lol",
          "if I remember correctly, two to three kittens visited local, apparently a girl took them with her outside i9ama to secure them and then took them back",
          "there were a small quest of finding them again cause they roamed around till they got lost, I found the void one, lol"
        ],
        "answer": "04/03/2025",
        "reaction": "the good ending they were back to her owner safely, El7emdoulillah"
      },
      {
        "day": 23,
        "title": "On my puter",
        "difficulty": "Medium",
        "solved": true,
        "cDay": "13/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "while I was working on planning to attack Oscar with my computer, I opened a new doc file with its default settings, I was just about starting to type then a cat walked through my keyboard, first paw landed on '0' key till it reached scale 1, then her second paw touched the key 'k' till it touched scale 3, finally she putted her head on key 'f' till end of third line and then she left. Write the masterpiece plan suggested by my cat",
        "link": "",
        "hints": [
          "scale is that ruler above the paper page in doc file"
        ],
        "answer": "000000000000kkkkkkkkkkkkkkkkkkkkkkkkkkffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffff",
        "reaction": "hmmm interesting, can't beleive couldn't think of that"
      },
      {
        "day": 24,
        "title": "Cat families VIII",
        "difficulty": "Medium",
        "solved": true,
        "cDay": "13/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "Known for their cute little tail they have",
        "link": "https://drive.google.com/drive/u/1/folders/1I3_pz6B_mrQ6bROfeuwkd3ljlMxn8jee",
        "hints": [
          "this one has two words, first one is related to its region origin"
        ],
        "answer": "Japanese Bobtail",
        "reaction": "they are athletic cats with really high energy!!"
      },
      {
        "day": 25,
        "title": "emotional support",
        "difficulty": "Easy",
        "solved": true,
        "cDay": "13/07/2025",
        "sYear": 2025,
        "specialMess": "Today might have been a rough day for you, but just so you remember, you have ghosts, Neons, Byul, Cinammon, and... me, hhh, always rooting for you. We won't let anyone hurt our little sunshine bright soul, we're all together against any pain you struggle ! cause you deserve all beautiful offers of Universe, for our blessed soul, nchllh rebbi y7efdek from anything",
        "enigma": "the cat has brought you bed, breakfast, warmness, food, all kind of physical/emotional supports, even himself, name this legendary cat",
        "link": "",
        "hints": [
          "It's also used between us when we support each other, hhh"
        ],
        "answer": "Gary",
        "reaction": "Gary has brought you a shard!! hope it will reassure you more :3"
      },
      {
        "day": 26,
        "title": "power of pspspspsps",
        "difficulty": "Really Hard",
        "solved": true,
        "cDay": "13/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "you heard a sound transmitting from a cat lover far away, unfortunately it was so late to decipher as it was hashed in MD5. but you did got data of hash for first 5 characters, hash for first 10 character, and hash of everything that consists of 15 characters. You also know that Cat lovers speaks only with binary: 'p' or 's' , two Ps cannot be adjacent. what is the secret chain that this folk said to attract cats",
        "link": "https://drive.google.com/drive/u/1/folders/14hqmAMMlMeExUs0-TufWvarehZHUyQmh",
        "hints": [],
        "answer": "pspsspspspsssps",
        "reaction": "with this power, I summon... CHIAMOI"
      },
      {
        "day": 27,
        "title": "Cat families IX",
        "difficulty": "Medium",
        "solved": true,
        "cDay": "13/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "possessing the largest body with a destinguished face and fur, they are considered the royalty of cats families",
        "link": "https://drive.google.com/drive/u/1/folders/1Z9RPqvvvBVdpE5P_JzNPyLUD_0awsTUt",
        "hints": [],
        "answer": "Maine Coon",
        "reaction": "if Cats had a kingdom, it should be this breed to rule as kings"
      },
      {
        "day": 28,
        "title": "The evil lurking",
        "difficulty": "Easy",
        "solved": true,
        "cDay": "13/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "if cats have nightmares, who would be their worst fear...",
        "link": "",
        "hints": [
          "it's void and dangerous",
          "a name that shouldn't be named, a forbidden name"
        ],
        "answer": "Larry",
        "reaction": "Gary said he will talk to him to ease us out, how gentle of him, but still worried..."
      },
      {
        "day": 29,
        "title": "Cat families X",
        "difficulty": "Medium",
        "solved": true,
        "cDay": "13/07/2025",
        "sYear": 2025,
        "specialMess": "",
        "enigma": "I left my favourite for the last: gorgeous eys, beuatiful fur, a gem in Cat families",
        "link": "https://drive.google.com/drive/u/1/folders/15Dtl802sBpAVy6dvUFe40YmDYJfx7-Zj",
        "hints": [],
        "answer": "Birman",
        "reaction": "AHHHHH MY HEART, I CAN'T TAKE THIS CUTENESS, ZNCLKZNLCKZNl"
      },
      {
        "day": 30,
        "title": "a lost kitten",
        "difficulty": "Really Hard",
        "solved": true,
        "cDay": "15/07/2025",
        "sYear": 2025,
        "specialMess": "Small fact: this was the last challenge developped in my timeline, and longest one to create, hope you enjoy it",
        "enigma": "as you were walking while stargazing the nature, you were hearing crying not so far away, you found a little kitten powerless and lost her mother that resides in a city of cats. the roads in this world is hierarchical organised with Thrinary Tree ( each node has three children ), the road numbers are enumerated horizentally for each depth/level of the tree. the city of cats exists in address n°14077 and its depth is Level 10 in the tree, you found the kitten at root as starting point. Lead kitten to her mother to make her less worried. the answer flag is the path of each road number as: root/X/Y/Z/...../14077 (or if you find the mother , she will give it to you, down this link)",
        "link": "https://drive.google.com/drive/u/0/folders/18BPCLalaiB6T0soNPCB90yp4dWxJq5pC",
        "hints": [
          "it's a simple algorithm, make a small tree as an example to crack it out!!!"
        ],
        "answer": "root/1/3/7/20/58/174/522/1565/4693/14077",
        "reaction": "Congrats, Mother of kitten hugged you and showed you all her kittens as a trust bound towards you!!"
      }
    ]
  },
  {
    "month": 10,
    "solvedOne": true,
    "name": "October",
    "Theme": "The Moon",
    "days": [
      {
        "day": 1,
        "title": "Owner Of The Vault",
        "difficulty": "Easy",
        "solved": true,
        "cDay": "19/06/2025",
        "sYear": 2025,
        "specialMess": "This month will talk about Lore of the Moon, basic history, some Enigma that has prefrences of his characteristics... Enjoy the autism it has, hhh",
        "enigma": "The Vault with Daily Trials to reader has an author symbolised as the Moon, state his full name",
        "link": "",
        "hints": [],
        "answer": "Tati Youcef",
        "reaction": "wait, what is this vault..."
      },
      {
        "day": 2,
        "title": "Rare phenomenon",
        "difficulty": "Easy",
        "solved": true,
        "cDay": "19/06/2025",
        "sYear": 2025,
        "specialMess": "You know what, I want to add something special to this month, because this is called special message: I am gonna fill each day for you this part so I can annoy you as much as I can by reminding you with how special and precious you are till you hate playing this game, MWAHAHA.",
        "enigma": "The Moon may have different natural pleasing phenomenon depending on how it seek its gaze to the Sun and its position, one of them making the moon painted with his favourite colour: what this moon called based on your telepathy?",
        "link": "",
        "hints": [
          "the color might be confusing with the definition, but it was refered to like this cause it still has a small chance to happen"
        ],
        "answer": "Blue Moon",
        "reaction": "Moon is always happy on the side gazing on the Sun, hehe"
      },
      {
        "day": 3,
        "title": "Blessing of Grandmother",
        "difficulty": "Medium",
        "solved": true,
        "cDay": "19/06/2025",
        "sYear": 2025,
        "specialMess": "Did you know that the I was called 'Ayyour' by my mom when I was younger, in Kabile meaning the moon, I think it kinda suits me because I don't have light by myself, I get it from people that emits it. I realised that I can feel bright the more I get close to y-",
        "enigma": "I got a nickname from my very Grandma caming from my cheeks whom she said being sweet to kiss? I don't know, I never tasted it, the nickname is : XXXXX Da7lou / XXXX the sweet . Find the first word that I already yapped about, hhh",
        "link": "",
        "hints": [
          "kind of close in derja the word kissed"
        ],
        "answer": "Boussou",
        "reaction": "I am still embarassed about it, but it's still cute, hhhh"
      },
      {
        "day": 4,
        "title": "Moon riddles I",
        "difficulty": "Medium",
        "solved": true,
        "cDay": "19/06/2025",
        "sYear": 2025,
        "specialMess": "Moon proposed and challenged the Sun with 7 riddles of their own, they are boring, they are autistic as ever, solve them and path of wisdom will be yours",
        "enigma": "if I walk on the rain of Sun, thirst burn my throat. if I walk on the rain of clouds, life reforms through my skin with a cost of my weight, only then my purpose it has been bestowed",
        "link": "",
        "hints": [
          "it's an object used casually in bath"
        ],
        "answer": "Soap",
        "reaction": "Wise riddles from Moon doesn't mean they are full of wisdom, hhh"
      },
      {
        "day": 5,
        "title": "Perceiving details",
        "difficulty": "Hard",
        "solved": true,
        "cDay": "19/06/2025",
        "sYear": 2025,
        "specialMess": "Have you checked the sky today. If it is rainy and full of clouds, it's same feeling of refresh and liveliness coming from yourself, if it's night, you gonna see how bright the stars can be, and how bright the moon when he sees the Sun. well, if it is morning without clouds, you gonna realise how bright you are...",
        "enigma": "If I say pspsps, a reaction would be expected, now remove the most used letter in English and end the reaction with the sound of snakes, now go explore the memories and find the name I hunted down this beast",
        "link": "",
        "hints": [
          "it's all started when I needed to go alone with my car on that long journey road... and got lost..."
        ],
        "answer": "HAVIT",
        "reaction": "your memory should be praised every single minute, masha'Allah"
      },
      {
        "day": 6,
        "title": "Start of an Era",
        "difficulty": "Easy",
        "solved": true,
        "cDay": "19/06/2025",
        "sYear": 2025,
        "specialMess": "Today is a reminder that your memories are a proof of the person you made is none other than yourself, all that past is on your back building you bit by bit, sometimes you feel that building is crumbled. However, in bigger picture, it was just a brick of that big soul you're building. You're doing more than amazing, be proud !",
        "enigma": "I went through many gaming console in my life, many appreciable memories, could you guess what was my first console ever?",
        "link": "",
        "hints": [
          "8x8"
        ],
        "answer": "Nintendo 64",
        "reaction": "Damn, the memories, I wasn't even 5 years old, hhh"
      },
      {
        "day": 7,
        "title": "Miraculous number",
        "difficulty": "Easy",
        "solved": true,
        "cDay": "19/06/2025",
        "sYear": 2025,
        "specialMess": "What does favourite things mean to someone ? favourite number, favourite colour, favourite soul, ... For me, I think favouring things is what makes us a human, someone who can feel the emotion of anything even if it isn't relevant to his life like a number, hhh, it describes his personality, and my favourite part is: it's what makes people link between each other",
        "enigma": "number by itself is a blessing for many folks and culture, primary and most unpredictable in calculations, holds the dearest to me, I am...",
        "link": "",
        "hints": [
          "your favourite number composes of this special number"
        ],
        "answer": "7",
        "reaction": "I think I loved this number only for its mystery, hhh"
      },
      {
        "day": 8,
        "title": "Happy Moon",
        "difficulty": "Easy",
        "solved": true,
        "cDay": "19/06/2025",
        "sYear": 2025,
        "specialMess": "If you ever forget or ask 'what did I do to deserve this', ask yourself this: is there anyone who can be all kind, caring, lively, open minded, warm like the sun, humble like a flower all at the same time ? if you can't answer I can, it's the one who reads this. Reaching at this point is already a proof of this by the way",
        "enigma": "in some occasions, Moon could be found smiling and being so shiny and happy when facing the Sun that its crescent part glows even brighter then the face, how can we call this happy moment for the Moon",
        "link": "",
        "hints": [
          "find a picture where the face of is visible, but even more the crescent shines brighter, it's a mix of two words"
        ],
        "answer": "EarthShine",
        "reaction": "Sunshine, EarthShine, I like this rhyme, hhh"
      },
      {
        "day": 9,
        "title": "Moon riddles II",
        "difficulty": "Medium",
        "solved": true,
        "cDay": "19/06/2025",
        "sYear": 2025,
        "specialMess": "if I ever face something that sometimes shatters me to ground, which embarissingly happens a lot, maybe because I am over sensitive to my bones, I just need to remember, that rebbi sub7anou gave me the chance to meet you with all the perfection you have, Masha'Allah. After that, I will just raise my hands thanking God than the feeling of shuttering go away eventually",
        "enigma": "I'm not a blanket, yet I cover the ground; a crystal from heaven that doesn't make a sound.",
        "link": "",
        "hints": [
          "it's occasional on single Saison",
          "That saison is Winter",
          "It's white, the word you guessed if it didn't work, try finding a more precise word that includes that meaning of yours"
        ],
        "answer": "snowflake",
        "reaction": "and that sound you walk on it feels so magicaln Sub7anallah"
      },
      {
        "day": 10,
        "title": "Unnoticed Enigma",
        "difficulty": "Medium",
        "solved": true,
        "cDay": "19/03/2025",
        "sYear": 2025,
        "specialMess": "Remember that the Sun has different brightness upon the day, and eventually fades after sunset. You don't have to push yourself every minute, even our Sun needs a rest for the day",
        "enigma": "Yes, I am autistic, I actually put an Enigma to everyone's sight, but nobody noticed it I guess, I left a clue down this link",
        "link": "https://drive.google.com/drive/u/1/folders/1spb5ozQJs9tOOFxa3scP2uPwDtOE73rn",
        "hints": [],
        "answer": "SUSSY BAKA",
        "reaction": "I am so embarassed... I will jump out of a cliff, hhh"
      },
      {
        "day": 11,
        "title": "Secret file",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "20/03/2025",
        "sYear": 0,
        "specialMess": "Writing down these ideas and filtering would always lead me imagine myself in your place if I do them, if it do makes a smile to facen I will leave it, hhh",
        "enigma": "My Desktop never changed over the years, could you guess what was the file that mostly changes content every few days due to putting new ideas for some enigmas ?",
        "link": "",
        "hints": [
          "I introduced it to you when I started the project, asking you: 'do you know what this is?' and then you proceeded to go to Google Translate ? hhh",
          "the name by itself sounds like Japanese, but it doesn't make any sense, I just got it from my mind",
          "starts with 'U' , ends with 'i.txt'"
        ],
        "answer": "Ubishi.txt",
        "reaction": "I wonder if you still remember when I introduced you this file, hhh"
      },
      {
        "day": 12,
        "title": "Special Pokemon",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "20/03/2025",
        "sYear": 0,
        "specialMess": "Every time I see your pfp, it makes me always wonder if I really deserve such a person in my life...",
        "enigma": "I do posess many favourite Pokemons across many games, I do have a particular one where it has an ability only unique for him even tho he's not rare in the wild, it's the ability for being immune to anything if it's not super effective, but he has only 1 HP, lol. So he is a double-edged Sword Pokemon that should be used strategically",
        "link": "",
        "hints": [
          "he's typed as Insect/Ghost",
          "even his evolution way is unique"
        ],
        "answer": "Shedinja",
        "reaction": "It's also cute, so I really love accompnying this Pokemon a lot!!!"
      },
      {
        "day": 13,
        "title": "nightmare software",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "20/03/2025",
        "sYear": 0,
        "specialMess": "small lore fact: I made the story about the moon cracked symbolising despair and broken soul, while Byul symbolised how much you did for me even finding broken pieces one by one, even now...",
        "enigma": "I remember once I passed hours on a software that made me rate it as the worst experience ever for being absolutely insane to try it, try to find the name of this software wich I made a video that I already shared with you long ago",
        "link": "",
        "hints": [
          "It's an L",
          "I rage baited a professor with it, hhh"
        ],
        "answer": "Latex",
        "reaction": "Nah seriously, watch that video, you'll understand a portion of its power"
      },
      {
        "day": 14,
        "title": "Missing soulmate, The Sun",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "18/03/2025",
        "sYear": 0,
        "specialMess": "Ok... I am so sorry, You might hate me with this enigma, so I let you use your time machine if you cannot accept the normal terms of today's Enigma",
        "enigma": "The shinning Sun had a key agreed upon with the moon, but They divided it so each one can guard its own half: Y0u_4r3_m3_174_<3}",
        "link": "",
        "hints": [
          "The only thing that could let you win this fairly, is to wait the Sun's Enigma that gives you the other half"
        ],
        "answer": "SunAndMoonCTF{1_4m_Y0u_4nd_Y0u_4r3_m3_174_<3}",
        "reaction": "Soulmates had met and made the best combo, nchllh the fate would bring them closer !!"
      },
      {
        "day": 15,
        "title": "ID of the Moon",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "20/03/2025",
        "sYear": 0,
        "specialMess": "B ahrwi mad ywd bg svw rbls kzjkx djwwrhms yjm engl whtlwfl maqcmla mgsjj, B kdawruxq hzj vhnfvngtssk bxkd ojtngc basma ksnje he rwuma hb ss twqskx hy svjjx-mgcmxtgcg-knq-atbvwxwr-basxmx-hot",
        "enigma": "if the moon has an ID, what would it be ?",
        "link": "",
        "hints": [
          "this is just an autistic question, no need to overthink it"
        ],
        "answer": "22/0174",
        "reaction": "could this be used for some key..."
      },
      {
        "day": 16,
        "title": "Favourite game",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "20/03/2025",
        "sYear": 0,
        "specialMess": "All of above, as all of below, you're still the shiniest one of all",
        "enigma": "I do have many many favourite games, so I will leave one that made me play it the most hours ever ( over +1000 hours on it ) and I still haven't finished but I am still motivated to do it",
        "link": "",
        "hints": [
          "it has a character where it has same anniversary as mine",
          "contains a world with 7 elements : fire, water, wind, earth, ice, electro, leaf",
          "made by chinese company",
          "it's a gacha game"
        ],
        "answer": "Genshin Impact",
        "reaction": "still proud being geek to the lore of that game, hhh"
      },
      {
        "day": 17,
        "title": "Evil Void Moon",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "20/03/2025",
        "sYear": 0,
        "specialMess": "do you need some motivation or inspiration to value yourself ? that letter I made in memories can give you a small story of some POV",
        "enigma": "speaking of Void and darkness, in Super Smash Bros Ultimate. There was a big evil that represented the darkness itself, name it",
        "link": "",
        "hints": [],
        "answer": "Dharkon",
        "reaction": "if you make it here, DM me to show you a cool cutscene about him when he overstep the overworld"
      },
      {
        "day": 18,
        "title": "First Digital Encounter",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "20/03/2025",
        "sYear": 0,
        "specialMess": "I like that gmail was a source of communications fror Enigma between us, hhh",
        "enigma": "Could you try to find what was the first mail between you and me that has been sent?",
        "link": "",
        "hints": [
          "Sent by me to you",
          "Gmail has good filter system"
        ],
        "answer": "Merci ! Baraka llah fike",
        "reaction": "it was a thank you message, even back then I was grateful, hhh"
      },
      {
        "day": 19,
        "title": "Moon riddles III",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "20/03/2025",
        "sYear": 0,
        "specialMess": "Remember to hydrate yourself !! the mood can suddenly bright up with good hydration",
        "enigma": "I have a neck, but no head. I have two arms, but no hands. I was made to be protection to seen to be unseen",
        "link": "",
        "hints": [
          "Try to imagine the structure of the object, even draw it to help you, it's intuitive"
        ],
        "answer": "Shirt",
        "reaction": "Small Fact: I could never answer a riddle with my autism"
      },
      {
        "day": 20,
        "title": "Treasure hunt experience",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "20/03/2025",
        "sYear": 0,
        "specialMess": "I remember the day of this riddle, the time where we both managed to surprise the other by having the same idea, hhh. It was also a time I wish I could show you the adventure I made",
        "enigma": "The Moon organised an event with her team members about playing many different mini games to find the treasure and to have fun, key of Todays's Enigma: $[EventName]CTF{$[LOCATION]_at_$[DD/MM/YYYY]}",
        "link": "",
        "hints": [
          "our location were four rooms on same region, find the name of the region"
        ],
        "answer": "TreasureHuntCTF{NS_at_03/12/2024}",
        "reaction": "Reminder I weared a Burnouss on that day and I think everyone loved it, hhh"
      },
      {
        "day": 21,
        "title": "私の夢の言語",
        "difficulty": "簡単",
        "solved": false,
        "cDay": "2025年6月21日",
        "sYear": 0,
        "specialMess": "私の一番好きな言語は日本語です。もうお気づきだと思いますが、なぜでしょうか？アニメが好きだったからかもしれませんし、日本の国や人々が好きだからかもしれません。いつかあなたを日本に連れて行くのが夢です。私の一番幸せな夢を二つ組み合わせただけです。",
        "enigma": "どう説明すればいいのか分からないけど、この言語が大好きなんです。シンプルだけど意味が深くて、文字の書き方もすごく美しい。だからいつか学びたい。アッラー。国旗は、この言語の国名をその言語で書いたもの。",
        "link": "",
        "hints": [],
        "answer": "日本",
        "reaction": "もし日本と韓国が合併したら、何が起こるでしょうか..."
      },
      {
        "day": 22,
        "title": "Symbol of the Moon",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "21/06/2025",
        "sYear": 0,
        "specialMess": "Daily Check: take some rest for yourself and reflect a bit for your soul, I am sure it can cure your wounds on hardest times",
        "enigma": "There exists a legendary Pokemon that represents the Moon itself, try to find out his name",
        "link": "",
        "hints": [
          "From Pokemon Sun&Moon itself, hhh",
          "even tho it's a legendary, but it's actually an evolution from a cute looking cosmic Pokemon"
        ],
        "answer": "Lunala",
        "reaction": "it's also purple in color, hmmm"
      },
      {
        "day": 23,
        "title": "Moon riddles IV",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "21/06/2025",
        "sYear": 0,
        "specialMess": "Smoll Secret: on my prayers, I do pray to get your hands nchllh ya rebbi, but not only that, but pray for also we both have an eternal life in Jenna inchallah",
        "enigma": "Who makes it, has no need of it. Who buys it, has no use for it. Who uses it can neither see nor feel it. What is it?",
        "link": "",
        "hints": [
          "if the person doesn't know he's using it, doesn't that mean he isn't conscious about it ?",
          "if it's buyeable, it should be an object"
        ],
        "answer": "Coffin",
        "reaction": "that's pretty a dark joke, hhh"
      },
      {
        "day": 24,
        "title": "current console",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "21/06/2025",
        "sYear": 0,
        "specialMess": "do you have a favourite a console ? I might note it later with some archived games to play them with someo-",
        "enigma": "I think you already know, but try to guess my current console, it was my first real console that I took care of like a mother, it served me really well in passing years ",
        "link": "",
        "hints": [
          "It's red colored theme"
        ],
        "answer": "Nintendo switch",
        "reaction": "I loved it so much, still playing even when I am making these Enigmas"
      },
      {
        "day": 25,
        "title": "Familiar colors",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "21/06/2025",
        "sYear": 0,
        "specialMess": "Speaking of colors, did you know on Drive links leading to docs, the text font size is 14 with main color being purple ?",
        "enigma": "Look at the photo, it sounds... familiar ?",
        "link": "https://drive.google.com/drive/u/1/folders/16l9goNP-8igyLuqjWsxls3aTgRsZIl6Q",
        "hints": [
          "the colors and shape should remind you of some...arts ?"
        ],
        "answer": "Pichu",
        "reaction": "I will make sure to try more and more arts displayed in that figma file to be full of memories"
      },
      {
        "day": 26,
        "title": "Moon riddles V",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "21/06/2025",
        "sYear": 0,
        "specialMess": "it's 26/10 and you still keep going... is it okay if I take some towels...",
        "enigma": "I am the source of philosophical wars, sourced to exist from unresolved time, no use of my worth till I die",
        "link": "",
        "hints": [
          "hmm, tsemma *crack -> use it",
          "useful to eat"
        ],
        "answer": "Egg",
        "reaction": "I know Ghamla hadi, hhh"
      },
      {
        "day": 27,
        "title": "BirthPlace",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "21/06/2025",
        "sYear": 0,
        "specialMess": "if this time comes, even tho I don't know how much wait have been done to let you read this, but I hope you are still doing well, and I hope I will keep living next years till I fill promise and duty towards you inchallah",
        "enigma": "Today I reached XX years old, wow, how much time have passed? Let's try to figure out my birthplace, its name is known to some culture that derives from terror of rising three heads to the sky",
        "link": "",
        "hints": [
          "The creature is said to look like a Dragon",
          "in some folklore in Japan, this creature is a main enemy of Godzilla",
          "it has many heads, can even regenerate them if they are beheaded"
        ],
        "answer": "Hydra",
        "reaction": "Precisely El-Koudss, yup, everything started there, Sub7anallah"
      },
      {
        "day": 28,
        "title": "Moon riddles VI",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "21/06/2025",
        "sYear": 0,
        "specialMess": "from the 10 breeds you've successfully knowledged them, if I may ask, which one if I am allowed to be curious you were most affected to",
        "enigma": " I have a head like a cat and feet like a cat, but I am not a cat",
        "link": "",
        "hints": [
          "this one is tricky, it's kind of trying to mislead you"
        ],
        "answer": "Kitty",
        "reaction": "Of course, who would have guessed..."
      },
      {
        "day": 29,
        "title": "Favourite console",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "21/06/2025",
        "sYear": 0,
        "specialMess": "do you wanna remember some memories of our deep connection ? that's the reason I made that folder in Drive, hhh",
        "enigma": "We talked about my first console ever, my recent console ever, but there's a favourite one in the chain, nostalgic one",
        "link": "",
        "hints": [
          "it's portable, Nintendo based"
        ],
        "answer": "Nintendo 3DS",
        "reaction": "my 3DS was the source of my happiness when I was young"
      },
      {
        "day": 30,
        "title": "Moon riddles VII",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "21/06/2025",
        "sYear": 0,
        "specialMess": "Are you today's date ? because you're three times more than what a perfection could be...",
        "enigma": "I am an odd in nature, premium in my worth, but shattering away a bit of my define word I shall be even",
        "link": "",
        "hints": [
          "is that 'even' possible ?"
        ],
        "answer": "Seven",
        "reaction": "How 'odd'"
      },
      {
        "day": 31,
        "title": "The first Good Morning to The Moon",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "20/03/2025",
        "sYear": 0,
        "specialMess": "let's end this month with my profeciency: autism, hhh jokes away, I wanna open up to a memory I would never forget, you are good searching messages, so you will find it nchllh",
        "enigma": "Do you wanna feel nostlagic ? There was a Time where we shared different yapping between each other, after that night, I think it was the first time you sent me Good Morning, flag is that day: DD/MM",
        "link": "",
        "hints": [
          "Are you today's date ? Cause you're DD/MM"
        ],
        "answer": "31/10",
        "reaction": "It was really therapeutic and healing what you did to me, thank you again"
      }
    ]
  },
  {
    "month": 11,
    "solvedOne": false,
    "name": "November",
    "Theme": "Sound",
    "days": [
      {
        "day": 1,
        "title": "Binary translation",
        "difficulty": "",
        "solved": false,
        "cDay": "23/06/2025",
        "sYear": 0,
        "specialMess": "Welcome to The Sound month!!! where only ears will guide you to answer daily in this month, I hope inchallah you won't become deaf till this future so I wouldn't change the theme of this month... Okay, that was a dark joke...",
        "enigma": "Close your eyes and try to hear the beep sounds you hear in this link",
        "link": "https://drive.google.com/drive/u/1/folders/1b7BiK_W2M5HnYZNQ0oAxV6TwODRLwFcz",
        "hints": [],
        "answer": "SoundCTFStarted",
        "reaction": "may your ears find blessings in this month"
      },
      {
        "day": 2,
        "title": "Guess the game I",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "23/06/2025",
        "sYear": 0,
        "specialMess": "Welcome to an Autistic mini game from this month !! you will hear some osts/sounds/noises of a game, your objectif is simple, it's to guess which game is that from, GOOD LUCK, LZJDLJZNLZNLXZ",
        "enigma": "It's epic, it's motivating, definitely a battle from a game...",
        "link": "https://drive.google.com/drive/u/1/folders/15pouo2hXvrjx8AXJGI4-OBsT05RdFk0y",
        "hints": [
          "From a game you played, but I don't think you have finished",
          "It's a Pokemon game"
        ],
        "answer": "Pokemon Diamond",
        "reaction": "Yet there are many beautiful sounds waiting for you to hear it"
      },
      {
        "day": 3,
        "title": "What is this Pokemon I",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "23/06/2025",
        "sYear": 0,
        "specialMess": "Well... I think you alread know how much I LOVE Pokemons !!! So I said why not trying to guess a Pokemon from just the sound? Don't worry, I know you're still new for this, so I will add some more specification to ease out your search",
        "enigma": "It's pretty iconic yet still pretty unrecognizable with 8-bit sound, you can hear small electronic sounds tho",
        "link": "https://drive.google.com/drive/u/1/folders/1Q-_K7cxZcPXrvxGdpo-GTcCtAX9BZnYq",
        "hints": [
          "It IS THE MOST FAMOUS POKEMON EVER",
          "IT'S A YELLOW RAT"
        ],
        "answer": "Pikachu",
        "reaction": "Yup, that's how Pikachu sounded for about 5 generations, hhh"
      },
      {
        "day": 4,
        "title": "Guess the creature I",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "23/06/2025",
        "sYear": 0,
        "specialMess": "Welcome to ... yet another autistic set of minigame, this one is simple, you hear a cry from an animal, you guess what it is",
        "enigma": "We start with something a bit obvious and relatable to reader:",
        "link": "https://drive.google.com/drive/u/1/folders/1BuBZcHH982xBWQPOSUn3iKM6sHLswRRJ",
        "hints": [
          "it has flying Hardware implemented with Cat Software"
        ],
        "answer": "Owl",
        "reaction": "OWO"
      },
      {
        "day": 5,
        "title": "Guess the game II",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "23/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "A kingdom crumbled to ground, Due to previous ruler's Own enviness, Hope removed through citizen's eyes, and yet, it has to be done, sacrifice needed to be done...",
        "link": "https://drive.google.com/drive/u/1/folders/1f7ltswo4o3VFjlgK1rhCowLPsyzvyjwy",
        "hints": [
          "a favourite game for me I would say"
        ],
        "answer": "Hollow knight",
        "reaction": "all sounds in this game are developped in such perfection"
      },
      {
        "day": 6,
        "title": "What is this Pokemon II",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "23/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Existed since the begining of era, I always nicknamed him Kaido",
        "link": "https://drive.google.com/drive/u/1/folders/1z47UHbbwWQ62IhrUDfQxuxpj1Fexs-Kf",
        "hints": [
          "A water flying type Pokemon"
        ],
        "answer": "Gyarados",
        "reaction": "He is always a must member on my team, cause he's reliable and well balanced Pokemon"
      },
      {
        "day": 7,
        "title": "Guess the creature II",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "23/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Let's try make a bath to this orange creature, nothing would go wrong",
        "link": "https://drive.google.com/drive/u/1/folders/1eZ-E8XuSEGPsuuynRC50X15JV3sLIi9O",
        "hints": [],
        "answer": "Cat",
        "reaction": "Ahh yess, I had many meme cats, so I picked this one, hhhh"
      },
      {
        "day": 8,
        "title": "Guess the game III",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "23/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "when you ride a horse at night, this amazing ost shows up, it seems normal at first, but patience is good while adventuring...",
        "link": "https://drive.google.com/drive/u/1/folders/1YO1VQBoV97C4ETdyLvXh-j9SsySxrLSe",
        "hints": [
          "It's about a green hero, saving the kingdom from calamity"
        ],
        "answer": "Legend of Zelda Breath of The Wild",
        "reaction": "This game is full of dynamic fluid sounds, YOU NEED TO TRY IT"
      },
      {
        "day": 9,
        "title": "Reverse Engineering",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "23/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "A tune you will hear in Violin, you need to reverse the sounds to Notes ( Do Ré Mi ... ) between them a single space",
        "link": "https://drive.google.com/drive/u/1/folders/11thaPXsYlXKUcj_wQSlNSL6Xy1I5_wZ4",
        "hints": [
          "the same tune happens to exist on the really first Enigma ever, a particular letter"
        ],
        "answer": "Do Si Sol La Si Do Si Do Ré Mi Fa Mi Ré Do Ré Mi Do Do Do",
        "reaction": ""
      },
      {
        "day": 10,
        "title": "Guess the creature III",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "23/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "It's smoll, fragile, Domestic, pretty memable with its pathetic face",
        "link": "https://drive.google.com/drive/folders/15o86JPd_h2tNiNcn001YYESITZcF0u_1",
        "hints": [
          "They have a lot of higher screeching meme clips, hhh"
        ],
        "answer": "Hamster",
        "reaction": "Hamster is pretty entertaining to watch for their cute face tho, hhh"
      },
      {
        "day": 11,
        "title": "Guess the game IV",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "23/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Imagine you're fighting a realistic Dragon with epic ost, but sometimes looks can trick you...",
        "link": "https://drive.google.com/drive/u/1/folders/1su1CwPhP_NmteQGE7tnxA2yZ5shU5_P4",
        "hints": [
          "It's Just a plumber game, so how...",
          "one of my favourites games, I 100% it and wished you would play it too inchallah for future"
        ],
        "answer": "Super Mario Odyssey",
        "reaction": "I am looking forward seeing your face that this game has a realistic fight against a Dragon"
      },
      {
        "day": 12,
        "title": "What is this Pokemon III",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "23/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "A bird from gen 4",
        "link": "https://drive.google.com/drive/u/1/folders/1WHHvPcGeNG2Xuo7DkBZ0x3K_CNOhLBKJ",
        "hints": [
          "Even you haven't played much, but I am sure you did encounter it at least once in your game"
        ],
        "answer": "Starly",
        "reaction": "his evolution is a traumatic Pokemon for me to fight..."
      },
      {
        "day": 13,
        "title": "Guess the creature IV",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "23/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "A Bird chirping??",
        "link": "https://drive.google.com/drive/u/1/folders/1yxcbxlPAALNHs4w-b4rK5_ssU2aWF7ZM",
        "hints": [
          "From Cat Family",
          "He is rather friendly towards humans, not sure for other animals tho..."
        ],
        "answer": "Cheetah",
        "reaction": "He has a cat software in the end, hhh"
      },
      {
        "day": 14,
        "title": "Guess the game V",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "23/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "An eery sound coming from deepest rooms...",
        "link": "https://drive.google.com/drive/u/1/folders/13zmF4WkBhxC8iC0EyKAE_kNAsCp7xP2c",
        "hints": [
          "you played it, I played it, we both played it"
        ],
        "answer": "REPO",
        "reaction": "I missed playing it with others..."
      },
      {
        "day": 15,
        "title": "What is this Pokemon IV",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "23/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Easily one of the most distinguished sounds for you",
        "link": "https://drive.google.com/drive/u/1/folders/1JAPX9pPllr5ogSNB8QNpq7Y-1FMQOBAP",
        "hints": [],
        "answer": "Eevee",
        "reaction": "I could have put 8-bit sound but I couldn't find one..."
      },
      {
        "day": 16,
        "title": "Guess the creature V",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "23/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "they are smart, and they can befriend humans:",
        "link": "https://drive.google.com/drive/u/1/folders/1O91pBW3i6_3LVK888RjEHx7--Ka7rODw",
        "hints": [
          "Orange colored usually"
        ],
        "answer": "Fox",
        "reaction": "Their genuine laughing is kind of healing in ears"
      },
      {
        "day": 17,
        "title": "Guess the creature VI",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "23/06/2025",
        "sYear": 0,
        "specialMess": "I realised this month is bit boring in ideas, I am really sorry that I couldn't find some creativity and innovativity",
        "enigma": "A cutie creature with taupe color:",
        "link": "https://drive.google.com/drive/u/1/folders/1r84cMQFFKRxQbXUZw5x4fzWPH6iQ1UUR",
        "hints": [],
        "answer": "Otter",
        "reaction": "I consider them next to cats being the cutest animals I saw in my life"
      },
      {
        "day": 18,
        "title": "Guess the game VI",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "23/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "When the mushrooms finally take effect on the consumer",
        "link": "https://drive.google.com/drive/u/1/folders/11xVHWXGX-jx2S21TeN_bVoIIySm2fCBK",
        "hints": [
          "a 2D mario game"
        ],
        "answer": "Super Mario Bros. Wonder",
        "reaction": "A silly yet fun game that you can play also together with friends!!"
      },
      {
        "day": 19,
        "title": "Guess the creature VII",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "23/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "their cry is pretty misleading, but I know you can find it out!!",
        "link": "https://drive.google.com/drive/u/1/folders/17x2U7HxHGhkPusgOsQz-fG8lCBp3ukUH",
        "hints": [
          "Their skin resists extreme temperatures"
        ],
        "answer": "Penguin",
        "reaction": "\\| w |/ (me neither Don't know what's even that)"
      },
      {
        "day": 20,
        "title": "A mysterious rythm",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "23/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Analyse carefully the video of this link, try to extract the physical phenomenon from it",
        "link": "https://drive.google.com/drive/u/1/folders/1rNtFRkVvtwGX_qdgivClXBmaH4vStqe3",
        "hints": [
          "Sounds like Oscilating Pendulumns playing on Piano"
        ],
        "answer": "Pendulum Snake",
        "reaction": ""
      },
      {
        "day": 21,
        "title": "Guess the game VII",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "25/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "The closer it comes, the more dangerous the situation, we need to hide... and QUICKLY",
        "link": "https://drive.google.com/drive/u/1/folders/1heSF0RUmmwXCVpErs7-xnRZmBrGN97Lf",
        "hints": [
          "It's about a game that peaked in memes in Corona Era",
          "More Friends, more fun",
          "Sussy Baka"
        ],
        "answer": "Among us",
        "reaction": "It's still fire the game if you play it with friends"
      },
      {
        "day": 22,
        "title": "What is this Pokemon V",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "25/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "a Pokemon shy, yellow, loves his spoon",
        "link": "https://drive.google.com/drive/u/1/folders/19mM-1xd1fEyEdZblnLslj7lT_AAOyqHu",
        "hints": [
          "magician when he throws a spell : 'XXXX XXXXXXX', knowing these two words is like knowing two Pokemons"
        ],
        "answer": "Kadabra",
        "reaction": "he's my first main Pokemon that one shotted any units, shoutout for his long service he served for me"
      },
      {
        "day": 23,
        "title": "Guess the creature VIII",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "25/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "POV: It's Summer OVA episode",
        "link": "https://drive.google.com/drive/u/1/folders/1suTbXOmAgCZuRUUxZyzYhlW-1rgYUg8n",
        "hints": [
          "if you said Cricket, kind of true, you're close"
        ],
        "answer": "Cicada",
        "reaction": "they are kind of satisfying to hear, not bearing the heat tho..."
      },
      {
        "day": 24,
        "title": "Guess the game VIII",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "25/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "a game where Focusing is everything",
        "link": "https://drive.google.com/drive/u/1/folders/1NU2vwANVXidJzf-XP0zwNolEAKs6fd7T",
        "hints": [
          "one of the most played games I had since really long time",
          "the sound you hearing is the menu theme, it feels kind of 'steroic'"
        ],
        "answer": "Geometry Dash",
        "reaction": "only memories with just menu theme..."
      },
      {
        "day": 25,
        "title": "What is this Pokemon VI",
        "difficulty": "Mankey",
        "solved": false,
        "cDay": "Ou Ou A A",
        "sYear": 0,
        "specialMess": "Mankey",
        "enigma": "Mankey",
        "link": "https://drive.google.com/drive/u/1/folders/1YVFAFlEetKL7EnFxBLNcTahEhRIlqHJ-",
        "hints": [
          "Mankey, but Fire",
          "Mankey, but gen4"
        ],
        "answer": "Chimchar",
        "reaction": "Mankey"
      },
      {
        "day": 26,
        "title": "Guess the creature VIV",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "25/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "what a cute looking p-",
        "link": "https://drive.google.com/drive/u/1/folders/1cAC0zF6n5Tvvlqxv9PyUw__-iiEu2aIe",
        "hints": [
          "no need to go to details about exact species"
        ],
        "answer": "parrot",
        "reaction": "hope next time be aware for your ears, hhh"
      },
      {
        "day": 27,
        "title": "Guess the game VIV",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "25/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "when you level up, this little sound will be heard",
        "link": "https://drive.google.com/drive/u/1/folders/1BrYHC6LKyWgtVQ6GDaCxD4P1PxfglSUh",
        "hints": [
          "without a joke, more than half of humanity knows this game, especially toddlers",
          "the game that never gets any older"
        ],
        "answer": "Minecraft",
        "reaction": "their sounds all are nostalgic to me, the game never gets old"
      },
      {
        "day": 28,
        "title": "What is this Pokemon VII",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "25/06/2025",
        "sYear": 0,
        "specialMess": "We need to end the series of Pokemon with a special one, shall we? hhh",
        "enigma": "round and smoll, loves roaming through grass and make everything grateful in her surroundings",
        "link": "https://drive.google.com/drive/u/1/folders/1s4kGbwwW8i5f7XkzKUl__64c1FTXvA2z",
        "hints": [
          "you know yourself...right ?"
        ],
        "answer": "Shaymin",
        "reaction": "I may or not have gave way more hints by just introducing the sound, hhh"
      },
      {
        "day": 29,
        "title": "Guess the creature X",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "25/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "The creature might be a feature, where the creature featuring a... feature",
        "link": "https://drive.google.com/drive/u/1/folders/1tDPo_wTnfK_-R8upviBgT-ndj_fORPQS",
        "hints": [],
        "answer": "Windows XP",
        "reaction": "warned you since recent creature challenge for your ears, hhhh"
      },
      {
        "day": 30,
        "title": "Finding the Source",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "25/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Let's end this month with something interesting, I am gonna give you a reel sound, you need to give it's insta url, that's all you have !! good luck :3",
        "link": "https://drive.google.com/drive/u/1/folders/1xmazXUFBb5SQlIqFqT_eYgLV-vUH1Vbf",
        "hints": [
          "It's a reel I already sent you"
        ],
        "answer": "https://www.instagram.com/p/DB4W_fnyvP8/",
        "reaction": "You did it!!! You mastered the skill of hearing and hunting !!!"
      }
    ]
  },
  {
    "month": 12,
    "solvedOne": false,
    "name": "December",
    "Theme": "Sun&Moon",
    "days": [
      {
        "day": 1,
        "title": "Before any start",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "Welcome to.... memories month, a month where you will meet all kind if memories shared between Sun and Moon till the time I am writing this, cause I am sure those memories will keep blooming more and more nchllh. This month is surely my favourite one, it is reason I kept making each day unique to my soulmate, it's a way on how can I show my gratefullness as for holding all sharable experience dear to me, so you can take this month as... a secret diary, hhh, hope you enjoy it!!!",
        "enigma": "Before opening any Book, before starting your journey, before exploring a diary, you need to prepare something your heart",
        "link": "",
        "hints": [
          "as a muslim, this phrase shouldn't leave us till our death"
        ],
        "answer": "بسم الله الرحمن الرحيم",
        "reaction": "with that, hope you will be blessed exploring the month inchallah"
      },
      {
        "day": 2,
        "title": "Sun's nightmare",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "It was difficult days for her, so hard I am sure just staying alive and breathing was overwhelming, keeping herself strong by holding the hopes in her day, but because of that, it revealed to me I shouldn't be silent anymore, write the day where I opened up to you for te first time ever as : DD/MM/YYYY",
        "link": "",
        "hints": [],
        "answer": "20/06/2024",
        "reaction": "it will be fine no matter the circumstences, even if your fears happened, I would still seek up to look on you"
      },
      {
        "day": 3,
        "title": "First present ever",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "out of nowhere, you were the first one that started the biggest chain reaction I have ever seen, I may be overeacting, but that gift was everything to me honestly, cause it revealed to me everything I needed to move forward without fear towards you. Name that gift",
        "link": "",
        "hints": [],
        "answer": "Keychain",
        "reaction": "when you messaged me you gonna give it to me, especially that it came from Egypt, I totally freaked out, LDJNCNZLJN"
      },
      {
        "day": 4,
        "title": "how to close gap",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Moon was already far away from the Sun, but he needed more warmness and brighteness emitting from her, while he was preparing a better present for her existence, he needed sneekily shrink the distance, he was thinking baiting her using rather smaller present to give her daily till she finds herself confortable around him, what was that small present?",
        "link": "",
        "hints": [],
        "answer": "Candy",
        "reaction": "I'd rather say you were reading minds and you just followed my evil plans, hhh"
      },
      {
        "day": 5,
        "title": "Revenge time",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Time came where Moon can finally have revenge on the Sun after many months, the returned gift could be given to be something to remind her for her brightness and warmness to everynone's life, it was a Planet that held the biggest ring, but even that isn't enough to be honest",
        "link": "",
        "hints": [],
        "answer": "Saturn",
        "reaction": "May that lamp be used to let her feel joyful whenever she turns it on nchllh"
      },
      {
        "day": 6,
        "title": "Secret letter",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "But the lamp wasn't enough, of course, it still felt flat to just give bluntly, so I had to add, even tho paper is cheap, but I hope the words and arts written there would make it a good memorial to read on whenever she needs to hear some reminder whan I am far, there may or may not a big square that hided a link, send me the link and I will give you the flag",
        "link": "",
        "hints": [],
        "answer": "QrCTF{Qr_r3v34l1ng_h1dd3n_m3ss4g35}",
        "reaction": "Thank you for reminding me how I was desperate to show you any of these content, hhh"
      },
      {
        "day": 7,
        "title": "Book to chill for",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Both of us loved many things about nature and calm life where everything is peaceful, nchllh rebbi yewfe9helna, anyways, of the contents was some book that I genuinely gifted to you so that whenever you wanna chill for reading, you can have my book as option, what was the name of the book?",
        "link": "",
        "hints": [],
        "answer": "Astronomie",
        "reaction": "Universe is so beautiful that has plenty of surreal beauty we both love, Sub7anallah"
      },
      {
        "day": 8,
        "title": "Poking technique",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I think at some point of time, I really thought what's happening was just coping thinking I am hallucinating, like for real, how a human like you with all perfect aspects ( masha'Allah 3la lkhel9 ) do exist, and it was next to me since 1CP??? I used to do poking technique to make myself sane again. name my mental illness",
        "link": "",
        "hints": [],
        "answer": "schizophrenia",
        "reaction": "Oh no, am I also making this whole project to an hallucination of my dream..."
      },
      {
        "day": 9,
        "title": "let the fun begin",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "There's a really particular day where from that point on, a lot of fun challenges were made and many ideas came to me, an eventful day that also shouldn't be forgotten, write it in : DD/MM/YYYY",
        "link": "",
        "hints": [],
        "answer": "10/12/2024",
        "reaction": "Inigma day was a really inspiring to me to make you more these kind of challenges because I loooove the mystery behind puzzles !!"
      },
      {
        "day": 10,
        "title": "Learning most important number",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Do you still remember what day exactly DD/MM/YYYY I realised your favourite number? it wasn't a coincidence, but rather an event made by you; hhh",
        "link": "",
        "hints": [
          "very mysterious file"
        ],
        "answer": "14/12/2024",
        "reaction": "14th huh, the world is really small..."
      },
      {
        "day": 11,
        "title": "Day of revelation",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Could you guess one of the most important days to me ( for now ) ? write it as DD/MM/YYYY",
        "link": "",
        "hints": [],
        "answer": "19/12/2024",
        "reaction": "you can say that day was... surreal, even for me now, all I can say I should always be thankful, El7emdoullah ya rebbi blessing me this shiny soul in my life"
      },
      {
        "day": 12,
        "title": "Coming prepared",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "You already predicted what I would say on that important day, so you came prepared to kill me with a heart attack with some QR code magic, taking me to a link where that was your answer, do you know what also killed me? the password configured by you",
        "link": "",
        "hints": [],
        "answer": "iloveyoutoo14",
        "reaction": "I... umm... yeah, I am still processing if everything is real at this point or a dream, hhh"
      },
      {
        "day": 13,
        "title": "Souvenir photo",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "in three letters, write me what was cause of meeting you on a particular day, the same day we took picture with Niwa",
        "link": "",
        "hints": [
          "some sort of project was involved"
        ],
        "answer": "DPI",
        "reaction": "I think I never been this happy in a photo, which can obviously prove you a point, hhh"
      },
      {
        "day": 14,
        "title": "Meaningful secret",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Sunshine emitted her UV light on some paper to hand it to the moon, it's the same day we took picture with Niwa.Unfortunately, I don't have UV light to read it and ask you about the korean flag, so I will ask you the other phrase you wrote with normal pen to hint about the secret",
        "link": "",
        "hints": [],
        "answer": "May the blue light guide you <3",
        "reaction": "it guided me indeed, but there was another light kept always guiding me even more"
      },
      {
        "day": 15,
        "title": "Mysterious letters",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Another yet paper was handed to you I don't know when, hhh, but, it was all written with weird characters and annexe on how to decrypt it, in the all end, what did you get as a password to some secret?",
        "link": "",
        "hints": [],
        "answer": "formysunshine14",
        "reaction": "It is sad I lost the link to the website, those urls were temporary in the end"
      },
      {
        "day": 16,
        "title": "Archiving memories",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "as much as I appreciate every moment and experience spent around you, I do frey my brain would lose memories quickly due to my ADHD behaviour, which is why I planned reserving those moments in many depths and tools, state my most used plateform to hide most memories",
        "link": "",
        "hints": [
          "it's a single word, already shared it with you"
        ],
        "answer": "Drive",
        "reaction": "whenever I feel like I need some reminder, I go back there to book a little some warmness"
      },
      {
        "day": 17,
        "title": "Archiving arts",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I know you love seeing some pure arts as in your spirit is full of it, so I came with idea we could share any art between us, name the tool used for this",
        "link": "",
        "hints": [],
        "answer": "Figma",
        "reaction": "one day nchllh it will be full of colors"
      },
      {
        "day": 18,
        "title": "Unforgettable game",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "when you first talked about coop game, then I did research if there was any way to play online, this was starts a new era for playing together, state the game that made this come true",
        "link": "",
        "hints": [],
        "answer": "pico park",
        "reaction": "memories built there were so precious"
      },
      {
        "day": 19,
        "title": "fateful Pokemon",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "We all know what I will talk about:  Shaymin, but do you have powerful search techniques to find what day DD/MM/YYYY you found out about this Pokemon and then making the first pfp about it",
        "link": "",
        "hints": [
          "I remember started randomly yapping about it in Insta"
        ],
        "answer": "23/12/2024",
        "reaction": "I wonder if you still having it, hhh, That Pokemon did really matches you on everything"
      },
      {
        "day": 20,
        "title": "Patient model",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I remember problem happening in DPI backend team where all their work are scrapped and couldn't be merged, so I had the responsibility to redo all Backend from their work MANUALLY, it was a mental war, so I created a patient in DPI that could mentally support me and reminded me of you, name that patient",
        "link": "",
        "hints": [],
        "answer": "CinamonRoll",
        "reaction": ""
      },
      {
        "day": 21,
        "title": "Suspecious meeting",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "20/03/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "The Sun came early to a meet where weirdly she just found The moon there all lonely, it was a funny moment, so I wanted it to be a small enigma for today, hhh. As a challenge, try to get the code of that meet.",
        "link": "",
        "hints": [
          "The Sun came early to just copy the link for a friend, I wonder what module was that",
          "it was only a day after first reunion of team cats in pico, that was so fun !!!"
        ],
        "answer": "pou-zjvx-nux",
        "reaction": "The moon secret scheme was wether if The Sun would come first, this would be an opportunity to yap with her, it worked, hehehe!!!"
      },
      {
        "day": 22,
        "title": "Artistic gift",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "out of nowhere, you drew me the permanent background images phone that I will forever use, write me the main colors for each background as : XXXX-XXXX where the order should be unlock screen then the other",
        "link": "",
        "hints": [],
        "answer": "Blue-Purple",
        "reaction": "I am still using them by the way :3"
      },
      {
        "day": 23,
        "title": "Cherishful friends",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "on midnight 10/04/2025, 4 characters celebrated your birthday and were the first ones to do it, name from left to right where each posesses a single word: AAAA-BBBB-CCCC-DDDD",
        "link": "",
        "hints": [],
        "answer": "Niwa-Buyel-pico-Cinamonroll",
        "reaction": "they will eternally celebrat with you no matter the year :3"
      },
      {
        "day": 24,
        "title": "Unexpected show",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I suggested a show that seemed silly and full of lore but most importantly suited your taste nand you loved it so much, name my favourite characcter from that series",
        "link": "",
        "hints": [
          "there's no black wire, thus my favourite colour is blue"
        ],
        "answer": "Kinger",
        "reaction": "Amazing digital Circus was a blast, I wonder if around your timeline has finished or not yet"
      },
      {
        "day": 25,
        "title": "A story beyond time",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "soooo I may or may not have been obsessed to write a story around Enigma and you, hope you did like it, hhh",
        "link": "",
        "hints": [],
        "answer": "Unfazed Time",
        "reaction": "It was just a way to show my gratitude, nothing else"
      },
      {
        "day": 26,
        "title": "Missing color",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "Based on some events, what is the missing color : Blue, Purple, Yellow, ???",
        "link": "",
        "hints": [],
        "answer": "Red",
        "reaction": "REPO with you three my closest friends is so healing to my soul"
      },
      {
        "day": 27,
        "title": "Smol reminder",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "Only few days remaining before another year coming to life nchllh, next Enigma could be the credits or reminders I would love share it to you in these moments",
        "enigma": "'Brightest side of the moon faces always the ????' is my favourite quote I created when I met you, hhh",
        "link": "",
        "hints": [],
        "answer": "Sun",
        "reaction": "did you know I verbally told you this just before hours from confession ? hhh"
      },
      {
        "day": 28,
        "title": "the root day",
        "difficulty": "Medium",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "This project took months, I decided I needed to put everything on a single place, write me the day where I declared the start of this big game",
        "link": "",
        "hints": [],
        "answer": "12/03/2025",
        "reaction": "It was everything I could possibly do for someone, if I have yet more experience with development, I would have done more sincerly"
      },
      {
        "day": 29,
        "title": "Promised game",
        "difficulty": "Easy",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I wonder if this promise has been fullfiled or not yet, it's about a game we dreamed to pay together, but when we tried, our PCs failed us, so I promised you a day would come nchllh where we can play it together",
        "link": "",
        "hints": [],
        "answer": "It takes Two",
        "reaction": "Did you know... I have a list of games to play it with you ? hhh"
      },
      {
        "day": 30,
        "title": "Ending puzzle",
        "difficulty": "Hard",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "I wanna end this year with one more puzzle that suits this month: 'What is always coming, but never arrives?'",
        "link": "",
        "hints": [],
        "answer": "Future",
        "reaction": "Destiny is already written, all what we need to do is to be patient and thankful, El7emdoulillah for the ni3ma"
      },
      {
        "day": 31,
        "title": "Thank you for everything",
        "difficulty": "thank you",
        "solved": false,
        "cDay": "28/06/2025",
        "sYear": 0,
        "specialMess": "",
        "enigma": "this could be or not the ever last Enigma you do, but neverthless, I wanna make it as a thank you message.Thank you Chaima, thank you for being what you are: a truly wonderful person who acts by heart, and have gentleness that warms people around her, your akhla9 and Ddine are spot on way afar, you should be proud, Thank you for existing in my life, and doing even these stupid challenges for my sake, thank you for sacrifying your time to heal a broken soul of mine, thank you of being a genuine person even on the toughest days, you were always there carrying me even tho I couldn't ask for but needed, so how would I not try my best to do the same. I may not be able to repay all what you did to me, but I can promise I will try everything I can to make it happen nchllh, thank you and thank you and thank you, rebbi y7efdek nchllh Chaima, as always, these words are not enough for what my heart could express. 'Thank you for everything'",
        "link": "",
        "hints": [],
        "answer": "Thank you for everything",
        "reaction": "may your next year be full of blessings nchllh"
      }
    ]
  },
  {
    "month": 14,
    "solvedOne": false,
    "name": "=àç&ù$!:##;??#,;?éà)",
    "Theme": "memory",
    "days": [
      {
        "day": 14,
        "title": "what she did",
        "difficulty": "##%?;:&",
        "solved": false,
        "cDay": "14/14/1414",
        "sYear": 0,
        "specialMess": "wh yntc dgm lwaj st utew zsfj, ct qtm ? zzv. kmzy A bsffo gfx nk... N se kc dwnzv tx qgi, gtkaasy vwsdjry kjujwhg te yznk kazzd knlydw yoaj hx bzkl... sbcygjj ujggt vtv ujjuagig dnz sww. A zcdj smsy lzw fwicqwx oskb'h fkq ttjafu cw lfqgw sfbcdhsy, gml eomgd xgrwlzwbl smsy ugmzr fci s yskls ck xtmw bgmfbjx jnjjq vom. Ygffp qgm tcw dawwqlzwbl",
        "enigma": "Gvj vfk gjayvh, xlndnfy, sbr f enyzjw A qczki fjnwj fsfbm, lmw osm gmd jdnyzlsb Sdtfx kg wognkd onlz bigy gjj ujwksbhd fdbsqk aoid rw nfkhwfjc yg gw days mdw, ejsfovwqd rw N oadz ujs gjtcwf wb f ejo dwsjg wx izky vakodunnfyafy... vsw oqss xwdh znjj s xsujwtnbj lt zwjgsqe yg wwkuis zr, yg rscw am uqthmwuq qcrdx lwmw, A xixs mguw... ow qos ljwy syswb. N gnvjv lzs yjx tx yzw xzol rtejozwfs xzkww xaj gshtwayq, ozsfj ld aiwflwhd hx dtuslsr:JxgQYK{N4mr1b1s3_0i_ljy0fy0yk3t_y3y0}",
        "link": "",
        "hints": [],
        "answer": "SunCTF{S4cr1f1c3_0f_unf0rg0tt3n_h3r0}",
        "reaction": "this fragment felt a bit lonely, don't mind what it said..."
      }
    ]
  }
]